[
    {
        "title": "executive summary",
        "content": "Cisco Talos has identified a new wave of what is believed to be an ongoing campaign using the Delphi malware since 2017. Talos believes with high confidence that this is the work of the Arid Viper threat actor. This is a group believed to be based out of Gaza that's known to target organizations all over the world. The actor uses the Micropsia implant in the most recent wave that started around October 2021. \nThis actor uses their Delphi-based Micropsia implant to target Palestinian individuals and organizations, using politically themed file names and decoy documents. The most recent wave uses content originally published on the Turkish state-run news agency Anadolu and on the Palestinian MA'AN development center to target activists and Palestinian institutions. The tactics, techniques and procedures (TTPs) used in the most recent samples found by Talos lead us to believe this is a campaign linked to the previous campaign we reported on in 2017. Meta exposed this actor in an April 2021 report that focused mainly on mobile targeting operations. However, that did not stop the group, as they've continued to target Windows-based systems. Although this group hasn't technologically evolved, it has the motivation and means to operate longstanding campaigns against the same targets. This level of motivation makes them particularly dangerous to organizations that may come into their crosshairs. An in-depth defense using protections against the several layers of their infection chain is the best strategy to defend against this kind of threat. This should include email security to detect and prevent their most common initial attack vector, along with Cisco Secure Endpoint if the implant is successfully delivered using novel attack vectors. On the network side, Cisco Secure Firewall and Umbrella can be used to detect command and control (C2) communications performed with new versions and variants of their implants. ",
        "phase": "other"
    },
    {
        "title": "arid viper threat actor",
        "content": "Arid Viper, also known as Desert Falcon or APT C-23, was first exposed in 2015. This threat actor's main motivation is espionage and information theft, and has been attributed to malicious operators politically motivated towards the liberation of Palestine. Its victimology is dispersed all over the world, including Palestinian organizations and individuals. Arid Viper is not a technically evolved actor, however, it is known to target mobile and desktop platforms, including Apple iOS. Their toolkit consists of Delphi packers and compilers around their staple malware, Micropsia. \nThis implant has also been ported to other platforms with versions based on Python and an Android version. ",
        "phase": "other"
    },
    {
        "title": "campaign",
        "content": "Talos has identified new waves of this campaign against Palestinian individuals and organizations. It uses the same TTPs that we published in our first report on this actor back in 2017. The image below shows an example of a lure used in 2019 - while the file name refers to an annual report from 2018, the contents actually mention 2014 and 2015. \nExample of the decoy document from 2019. \nThe table below shows a small chronology of malicious implants masquerading as documents of interest being created with the same themes, which we associate with high confidence to the same ongoing campaign. \nThe use of politically themed lures reduced during 2018 and 2019, but we observed a definite increase in their usage in 2020 and 2021. Talos also observed other themes being used by this group (to deliver Micropsia) during 2018 and 2019 and into 2020/21, but they were not considered as part of this campaign in analysis and are beyond the scope of this research. ",
        "phase": "other"
    },
    {
        "title": "most recent decoys",
        "content": "The politically motivated content in the decoy documents, along with the use of the Arabic language, point to the victims being Palestinian individuals and organizations. \nThe most recent decoy document from September 2021 contains an article about the reunification of Palestinian families, originally published by the Anadolu Agency on Sept. 3, 2021. \nCe&Lelekr .\"levrle cFc Lclpcb pcr V(p \nDecoy document containing text on Palestinian reunification. \nAnother decoy, also from September 2021, consists of an article on social and economically sustainable development in Palestine by the MA'AN development center - a Palestinian development and training institution aimed at community development. \nDecoy document containing an article on Palestinian sustainable development. \nAnother decoy from July 2021 consisted of a patient's report containing affidavits from the State of Palestine's Ministry of Health. During March and February 2021, we observed the use of politically themed decoys. One of these decoys consisted of a list of questions from a Palestinian activist on the Presidential decree issued on Feb. 20, 2021, ordering the respect of freedom of expression ahead of legislative elections in May. \nKaaiullalwg leKahwgl ll uwl awl a aallaepw e \nDecoy containing a list of questions from a Palestinian activist. ",
        "phase": "other"
    },
    {
        "title": "deployment",
        "content": "During this investigation, Talos could not find any email or social media posts that were somehow linked to the Micropsia implants. However, we found the implants and compressed files containing the implants. This follows the same pattern that we described in our 2017 post about this actor. It is highly likely that the threat actor has continued to use the email vector to deliver their lures and implants. ",
        "phase": "initial access"
    },
    {
        "title": "out different malicious activities described below.",
        "content": "Form1 containing the four timers. \nLeft $=~24$ $\\begin{array}{l c l}{{\\tt I o p}=\\frac{\\gamma_{0}}{\\alpha_{\\sf}}}\\end{array}$ Width $\\begin{array}{r l}{\\mathbf{\\zeta}}&{{}=\\mathbf{\\zeta}\\nabla\\Xi}\\end{array}$ Height $=25$ Caption $=$ 'Buttonl' Taborder $\\c{\\underline{{\\underline{{\\mathbf{\\zeta\\zeta}}}}}}\\mathrm{~\\c~\\underline{{\\underline{{\\mathbf~\\zeta~}}}}~}$ Onclick $=$ Buttonlclick   \nend   \nobject Button2: TButton Left $=\\pm20$ $\\mathbb{T}\\mathfrak{O P}=\\mathfrak{g}$ Width $\\begin{array}{r l}{\\small}&{{}=~75}\\end{array}$ Height $=~25$ Caption $=$ 'Button2' Taborder $\\begin{array}{r l}{\\quad}&{{}=\\quad2}\\end{array}$ onClick $=$ Button2click   \nend   \nobject Button3: TButton Left $=~216$ $\\mathbb{T}\\mathfrak{O P}=\\mathfrak{g}$ Width $\\begin{array}{r l}{\\small}&{{}=~75}\\end{array}$ Height $=25$ Caption $=$ \"Button3' Taborder $=3$ Onclick $=$ Button3click   \nend   \nobject Button4: TButton Left $=~312$ $\\begin{array}{r l}{\\mathbb{T}\\odot\\mathtt{p}}&{{}=~\\mathfrak{s}}\\end{array}$ Width $=75$ Height $=25$ Caption $=$ 'Button4' Taborder $=4$ Onclick $=$ Button4click   \nend   \nobject IdMemo: TMemo Left $=~476$ $\\mathbb{T}\\mathfrak{Q}\\mathbb{P}\\mathrm{~=~}\\mathfrak{s}$ Width $\\c=\\phantom{-}151$ Height $=25$ Taborder $\\r=\\r_{5}$   \nend   \nobject Timerl: TTimer Interva] $\\underline{{\\underline{{\\mathbf{\\Pi}}}}}=2000$ OnTimer $=$ TimerlTimer Left = 40 $\\begin{array}{l}{\\mathrm{Top}=56}\\end{array}$   \nend   \nobject Timer2: TTimer Enabled $=$ False Interva $\\underline{{1}}~=~25000$ OnTimer $=$ Timer2Timer Left $=\\pm20$ $\\mathbb{T}\\boldsymbol{\\odot}\\mathbb{P}~=~54$   \nend   \nobject Timer3: TTimer Interval $\\begin{array}{r l}{\\mathrm{~\\boldmath~\\omega~}}&{{}=~\\Im000(\\$ OnTimer $=$ Timer3Timer Left $=~216$ To $,\\quad=72$   \nend   \nobject Timer4: TTimer Enabled $=$ False Interval $=$ 35000 OnTimer $=$ Timer4Timer Left $=304$ $\\mathrm{\\DeltaTop~=~72}$ \nAll the malicious functionalities are implemented through the timers configured in the implant. ",
        "phase": "other"
    },
    {
        "title": "deploying the decoy document",
        "content": "One of these timers is responsible for extracting the decoy document and saving it to the %TEMP% folder and then displaying it via ShellExecute: \nloc_6D9030:  \npush 1  \npush θ  \npush θ  \npush offset Parameters :  \npush [ebp+lpDirectory] ; lpDirectorypush offset Parameters ;  \n1ea eax, [ebp+var_20]  \nmov edx, 3  \ncall sub_40ACB0  \nmov eax, [ebp+var_20]  \ncall sub_40A9C0  \npush eax ;lpFile  \npush offset aOpen_0 ; lpoperationpush θ ; hwnd  \ncall shell32_ShellExecuteW  \nxor eax, eax  \npop edx  \n[pop ecx  \npop ecx  \nmov fs:[eax], edx  \njmp short 1oc_6D90BB\nDecoy document extracted and displayed to the target. \nNow, if the implant is started with the \"-start\" command-line switch, it will skip the process for dropping and displaying the decoy document and jump straight to its RAT functionalities. ",
        "phase": "execution"
    },
    {
        "title": "establishing persistence",
        "content": "Another timer is used to establish persistence for the implant on the endpoint. \nHere, the implant will establish persistence by obtaining its current command line, which is then used to create a shortcut for itself in the %TEMP% directory. The shortcut to run the implant contains the \"-start\" switch (used to skip the displaying of the decoy document). This shortcut is then moved over to the currently logged-in user's Startup folder to complete persistence across reboots and re-logins. ",
        "phase": "persistence"
    },
    {
        "title": "information gathering",
        "content": "The remaining two timers will gather preliminary system information and activate the RAT capabilities of the implant. \nThe sequence of actions followed for gathering system information from the endpoint are as follows: \n1. Generate a pc ID for the infected endpoint. Save this value into a data file, such as: \"%APPDATA%\\dsfjj45k.tmp\" \n2. Gather the Computername and username from ENV. Concatenate the computername, username and pcid into format: <COMPNAME>_<username>_<pcid> \n3. Gather installed AV information from the endpoint via \"winmgmts:\\\\localhost\\root\\SecurityCenter2\" using query \"SELECT \\* FROM AntiVirusProduct\". From the AV information obtained, record the DisplayName. \n4. Get OS information specifically the installed product name. \n5. Get the current implant's command line and record it. \nAll this data gathered from the system is individually base64-encoded and assigned to HTTP form query variables with the following name-value pairs: \nvcqmxylcv= base64 encoded <COMPNAME>_<username>_<pcid> vcnwaapcv= base64 encoded AV Name list.   \nvcllgracv= base64 encoded OS version string.   \nvcwjlxycv= base64 encoded implant command line.   \nvccodwfcv= base64 encoded hardcoded flag. \nThe data is then sent to the implant's C2 server via an HTTP POST request, which is fairly standard in Micropsia implants. ",
        "phase": "collection"
    },
    {
        "title": "rat capabilities",
        "content": "Once the preliminary information has been sent, the implant now begins its remote access trojan (RAT) activity and waits for command codes from the C2 server. \nThe implant now uses two additional HTTP form variables to transmit the output of the commands executed on the endpoint: \nvcgqjdlrcv = hardcoded value 0.   \nmugnaq = base64 encoded screenshot or command output. \nThe C2 issues distinct command codes to the implant to carry out various actions on the infected endpoint. \nThe commands follow the format: ;<cmd_code>;<base64_encoded_supporting_data> \nThe above example would run the ipconfig command on the endpoint. \nThe command codes accepted by the implant are listed here: \nWe have observed implants using two distinct URLs to instrument communications with the C2, one for exfiltration of screenshots and the other for all the other RAT commands. \nFor example one of the implants used a distinct URL for screenshots: \nhxxp[s]://deangelomcnay[.]news/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/ZCgbo9EVhYMA8PX While another URL was used for all other commands: \nhxxp[s]://deangelomcnay[.]news/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/bu5EmpJE7DUfzZD ",
        "phase": "command and control"
    },
    {
        "title": "conclusion",
        "content": "Since its initial disclosure by Talos in 2017, this campaign from Arid Viper has become a longstanding offensive cyber attack spanning well into 2021. \nState-sponsored actors and privateer groups rely heavily on stealth in their operations. The public disclosures of campaigns and targeted attacks are usually followed by the actors taking down their infrastructure and revamping their implants to avoid discovery of their malicious assets. \nHowever, in the case of Arid Viper, the continued use of the same TTPs over the past four years indicates that the group doesn't feel affected by the public exposure of its campaigns and implants, and continues to operate business as usual. This complete lack of deterrence makes them a dangerous group once they decide to target an organization or individual. \nThe lack of change also points to a certain level of success with their current TTPs. The new campaign and accompanying versions of Arid Viper's Micropsia implant disclosed in this research by Talos brings the spotlight back to their politically themed campaign to remind potential victims that the group is still very active. \nArid Viper is a prime example of groups that aren't very advanced technologically, however, with specific motivations, are becoming more dangerous as they evolve over time and test their tools and procedures on their targets. Implants such as Micropsia come in various forms such as Delphi, Python and Android. Such RATs proliferated and operated by a highly motivated threat actor who refuses to back down, consist of a variety of functionalities and are constantly evolving. These RATs can be used to establish long-term access into victim environments and additionally deploy more malware purposed for espionage and stealing information and credentials. \nIn-depth defense strategies based on a risk analysis approach can deliver the best results in the prevention. However, this should always be complemented by a good incident response plan which has been not only tested with tabletop exercises, but also reviewed and improved every time it is put to the test on real-world engagements. \nCoverage \nWays our customers can detect and block this threat are listed below. \nCisco Secure Endpoint (formerly AMP for Endpoints) is ideally suited to prevent the execution of the malware detailed in this post. Try Secure Endpoint for free here. \nCisco Secure Web Appliance web scanning prevents access to malicious websites and detects malware used in these attacks. \nCisco Secure Email (formerly Cisco Email Security) can block malicious emails sent by threat actors as part of their campaign. You can try Secure Email for free here. \nCisco Secure Firewall (formerly Next-Generation Firewall and Firepower NGFW) appliances such as Threat Defense Virtual, Adaptive Security Appliance and Meraki MX can detect malicious activity associated with this threat. \nCisco Secure Network/Cloud Analytics (Stealthwatch/Stealthwatch Cloud) analyzes network traffic automatically and alerts users of potentially unwanted activity on every connected device. \nCisco Secure Malware Analytics (Threat Grid) identifies malicious binaries and builds protection into all Cisco Secure products. \nUmbrella, Cisco's secure internet gateway (SIG), blocks users from connecting to malicious domains, IPs and URLs, whether users are on or off the corporate network. Sign up for a free trial of Umbrella here. \nCisco Secure Web Appliance (formerly Web Security Appliance) automatically blocks potentially dangerous sites and tests suspicious sites before users access them. \nAdditional protections with context to your specific environment and threat data are available from the Firewall Management Center. \nCisco Duo provides multi-factor authentication for users to ensure only those authorized are accessing your network. \nOpen-source Snort Subscriber Rule Set customers can stay up to date by downloading the latest rule pack available for purchase on Snort.org. \nIOCS ",
        "phase": "other"
    }
]