[
    {
        "title": "banking trojan escelar infects thousands in brazil and the us",
        "content": "Unit 42 for the past three months has been tracking a banking Trojan targeting victims in Brazil and the United States. Escelar originally surfaced in January of this year, and has since had roughly 100,000 instances of attempted infections.\nAttackers deliver the Trojan using generic Portuguese language phishing emails and are currently targeting seven Brazilian banks. Once delivered, Escelar has multiple installation stages where malware is downloaded using direct connections to multiple Microsoft SQL servers. These SQL servers are also used for command and control (C2) functionality.\nThe most recently discovered Microsoft SQL server being used as Escalar infrastructure contained records of 1660 infections that all connected in a two-day time frame.\nThe malware is able to control banking transactions conducted using Internet Explorer, and harvest email credentials, which are in turn used to spread the malware further.\nFigure 1. AutoFocus map of victims receiving Escalar Trojan",
        "phase": "other"
    },
    {
        "title": "infection",
        "content": "Escelar is distributed almost exclusively through phishing emails. A large number of emails were originally seen in the January 2015 period, and more e-mails have continued coming since then at a somewhat slower rate.\nFigure 2. Graph of sessions carrying Escalar each week in 2015\nThese emails are often labeled using the current date, and contain a generic message to entice the victim into running the attachment.\nFigure 3. Example email containing Escelar\nThe following top file names have been observed in attempted infections against Palo Alto Networks customers. Many of them include resume/curriculum vitae themes using female names.",
        "phase": "initial access"
    },
    {
        "title": "escalar execution – stage 1",
        "content": "After the victim unzips and executes the attached file, an executable written in .NET will be run. These executables are often obfuscated to thwart reverse engineers and any security controls that may be in place on the victim's machine.\nImportant string names within Escelar samples are obfuscated using various cryptographic libraries. We have identified samples using both RijndaelEnhance and TripleDES.\nFigure 4. Cryptographic function contained in Escelar\nFigure 5. Encrypted string and decrypted version stored as a comment\nThis executable has limited functionality, and is only responsible for downloading an additional executable and establishing persistence via the Run registry key.\nIt begins by generating a random path of 8 alphabetic characters in the %APPDATA% directory. An executable name of 15 random alphabetic characters will hold to a soon-to-be-downloaded file. Escelar then makes a direct connection to a remote Microsoft SQL server and downloads a raw binary file to this local location.\nFigure 6. Microsoft SQL connection\nFigure 7. Acquiring raw binary image from Microsoft SQL server\nFigure 8. Raw binary image\nAfter this file successfully downloads, the following registry key is written to ensure persistence across reboots.\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run [Computer Name] : [Path to Executable]\nFinally, the downloaded malware is executed via a call to Interaction.Shell().",
        "phase": "execution"
    },
    {
        "title": "escelar execution – stage 2",
        "content": "The second stage of the Escelar malware family shares many characteristics with the first stage. Both samples make use of direct Microsoft SQL connections, as well as encryption of important strings within the binary. They're also both written in .NET and are often obfuscated.\nThis sample is once again another downloader, grabbing a raw binary image from a remote Microsoft SQL server and storing it to the following path:\n%TEMP%\\\\JO[Computer Name][Computer Virtual Memory].exe\nFigure 9. Stored image in Microsoft SQL server\nFinally, the malware is executed via a call to Interaction.Shell().",
        "phase": "command and control"
    },
    {
        "title": "escelar execution – stage 3",
        "content": "The third stage of the malware contains the banking Trojan itself. Once again this binary is written in .NET and makes direct connections to Microsoft SQL servers. It begins by droppingJCS.Components.NeroBar.dllin the Startup folder. This DLL is used to generate progress bars and is used when the attacker chooses to generate a 'blocker' on the victim's banking webpage, which we discuss later in this section.\nThe malware proceeds to identify the following DLLs, which are used by various Brazilian banks to prevent malicious activity. The identifier is stored in the Microsoft SQL database in order to alert the attacker as to what plugins are installed.\nThe IdPC identifier in the following image is made up of the following data.\nComputer Name \nProcessor ID \nHD Serial \nPhysical Memory \nVirtual Memory\nFigure 10. Victim infections of Escelar listed in the Database\nThe malware monitors the victim's browser activity. In the event they user attempts to navigate to one of the following Brazilian banking websites, the malware takes action.\nhttps://internetbanking.caixa.gov.br/SIIBC/index.processa \nhttp://www.bradesco.com.br/ \nhttp://www.bb.com.br/ \nhttps://www.itau.com.br/ \nhttps://www.santander.com.br \nhttps://www.sicredi.com.br \nhttp://www.hsbc.com.br/1/2/br/para-sua-empresa\nShould the victim try to open any of these banking websites in a browser other than Internet Explorer, the malware will generate a false error, close the current browser, and re-open the link in Internet Explorer.\nFigure 11. False error displayed to the victim when viewing a targeted page in Google Chrome\nThe attacker has the ability to send a number of different commands in the 'fun' column of the Microsoft SQL server.\nFigure 12. Commands being sent to victims\nEscalar can accept the commands show below (with their translations).\nThese commands allow the attacker to manipulate a victim's banking web session and perform fraudulent transactions among other functions.\nThe following screenshot shows an image that is used by the malware in order to trick victims into entering the unique authentication code sent by banks to the victim's cellular telephone. This data is uploaded to the attackers in order to conduct fraudulent transactions.\nFigure 13. Escelar tricking a victim into entering the authentication code sent to their cell phone\nThe following screenshot shows examples of an attacker blocking a victim's banking web session in Internet Explorer.\nFigure 14. Blocking of victim's banking web session\nThese pages are specific to the bank the victim is using, as we can see in the following second example.\nFigure 15. Blocking of victim's banking web session",
        "phase": "command and control"
    },
    {
        "title": "e-mail harvesting and spreading",
        "content": "Escelar includes a component that is responsible for harvesting credentials from the following web services.\nGmail \nHotmail \nWebmail (any website containing the string \"webmail\" in the URL)\nThese credentials are stored in a remote Microsoft SQL server. The harvested email credentials are then used by the attackers to send additional e-mails containing Escelar. The total sum of emails in the database displayed below indicated that 3,057 emails had been sent from these addresses. The SQL server keeps track of the number of emails sent by each email address.\nFigure 16. Table containing email addresses and tallies of spam emails sent\nBy harvesting email credentials from Escelar victims, the malware authors are able to further propagate Escelar in the event a portion of the email senders are blocked.",
        "phase": "credential access"
    },
    {
        "title": "conclusion",
        "content": "The Escelar threat has been active for approximately seven months, targeting primarily Brazil- and US-based users. We have collected over 600 variants of to date, with roughly 100,000 attempted infections. The malware provides the attacker with multiple capabilities, including the ability to harvest email credentials and manipulate banking transaction sessions. Additionally, due to the way the malware is architected, it can easily update itself, along with the infrastructure supporting it.\nUsers located in Brazil and the United States that use Brazilian banking services should be aware of this threat and take necessary precautions against it, such as ensuring that suspicious emails are not opened.\nPalo Alto Networks customers using theAutoFocusservice can use theEscelartag to determine if they have been impacted and conduct additional analysis, and customers usingWildFireorTrapswith WildFire integration are automatically protected against this threat. Organizations should monitor their networks for unexpected outbound Microsoft SQL traffic (App-ID mssql) that may indicate an Escelar infection.\nFor a list of SHA256 hashes of identified instances of Escelar and identified Microsoft SQL server domains being used by Escelar, please refer tothis link.",
        "phase": "other"
    }
]