[
    {
        "title": "introduction",
        "content": "While investigating theConfucius threat actor, we found a recent spear phishing campaign that utilizes Pegasus spyware-related lures to entice victims into opening a malicious document downloading a file stealer. The NSO Group's spyware spurred a collaborativeinvestigationthat found that it was being used to target high-ranking individuals in 11 different countries.\nIn this blog entry, we take a look at the lures used by the malicious actor and provide a short analysis of the file stealer used in the campaign, which was launched in early August.",
        "phase": "other"
    },
    {
        "title": "the contents of the spear phishing email",
        "content": "The campaign involves a two-step attack. During the first phase, an email without a malicious payload containing content copied from a legitimate Pakistani newspaper's article is sent to the target. The sender address, which is spoofed, impersonates the PR wing of the Pakistani Armed Forces (info@ispr.gov.pk).\nTwo days later, a second email - purportedly a warning from a Pakistani military about the Pegasus spyware - containing a cutt.ly link to a malicious encrypted Word document and the password for decryption will be sent to the target. The sender address impersonates a service similar to that on the first email (alert@ispr.gov.pk).\nIf the target clicks on either the link or on the \"unsubscribe\" link, it will download a Word document from the domain parinari[.]xyz.\nThe emails are sent either from an ExpressVPN exit node in Pakistan, or from a mail server under the attacker's control.",
        "phase": "initial access"
    },
    {
        "title": "examining the encrypted document containing macros",
        "content": "After entering the password mentioned in the message, a document containing macros is displayed on screen.\nIf the victim enables macros, the malicious code will be loaded. If the victim enters any phone number and clicks \"SUBMIT,\" the text field will be replaced by the message \"Phone Number Not Found.\"\nBehind the scenes, a .NET DLL file named skfk.txt, which is filled with content found inside the \"Comments\" property of the document, is created in the temporary directory. The file is then loaded in memory via PowerShell.\nStage 1 is a simple download & execute program. It downloads an ASCII file from the same domain and converts it into binary before loading it on to the memory and jump to a dynamic function.\nStage 2 is also .NET DLL file that downloads a third file from parinari[.]xyz, converts it from ASCII to binary, and then creates a scheduled task to load it.\nStage 3 is similar to stage 1, with the only change being the URL to retrieve the next stage.\nStage 4 is the final payload (analyzed in the next section). it is never written in clear text to the file disk.\nIt should be noted that most of the compilation timestamps of these DLL files have been modified by the attacker to a year in the far future (2060, 2099 ...), and the server IP addresses are often hidden behind CloudFlare.",
        "phase": "initial access"
    },
    {
        "title": "analysis of the file stealer",
        "content": "The final payload is a .NET DLL file designed to steal documents and images with the following extensions:\nThe \"Documents,\" \"Downloads,\" \"Desktop,\" and \"Pictures\" folders of every user are checked. The DLL file also examines drives other than C:.\nWhen a file matching one of the listed extensions is found, its MD5 hash is calculated and compared to an exclusion list retrieved from the command-and-control (C&C) server pirnaram[.]xyz.\nIf the hash is not listed, the file is sent via the C&C to a directory named after the concatenation of the machine name and the username. The exclusion list is different for every machine name-username string.",
        "phase": "collection"
    },
    {
        "title": "other campaigns",
        "content": "During our monitoring of Confucius, we came across a campaign delivering the same payload, using a different lure. In this instance, the campaign impersonated the PakistaniDefense Housing Authority. Again, this threat actor's interest in military personnel is obvious.\nThe lures used in an older campaign from April 2021 impersonated the Federal Board of Revenue. There were minor differences in tools, tactics, and procedures: the malicious document was directly attached to the spear phishing email - still encrypted - and the decryption password was sent in a different email. The first stage was also hidden in the \"Comments\" section. However, the second stage contained the final payload, which was once again a file stealer with the exact same structure (a .NET DLL). Instead of exfiltrating the files through PHP scripts, they were done via FTP server.\nIt should be noted that in some occasions, the threat actor sent spear-phishing emails from the domain name mailerservice[.]directory which we attributed to thePatchworkthreat actor in previous research. We disclosedmultiplelinksbetween Patchwork and Confucius threat actors in the past, so this came as no surprise to us.",
        "phase": "other"
    },
    {
        "title": "the creative use of social engineering lures and how to defend against them",
        "content": "In ourpreviousresearch, we already found Confucius, which is known for targeting Pakistan military for espionage purposes, employing multiple file stealers. While the code quality of its payloads is not of the highest standard, this threat actor uses innovative techniques when crafting its malicious documents, such as  hiding malicious code in the comments section, or using encrypted documents to prevent automatic analysis. Therefore, it's highly likely that Confucius will continue to experiment and try out different kinds of social engineering lures in future campaigns.\nDespite the variety of lures used by the threat actor, best security practices still apply to these attacks. Users should always be wary and avoid clicking on any link or downloading any file from unsolicited emails or suspicious sources. Red flags such as unusual sender domains or grammatical and spelling errors are also a sign that the email is malicious in nature, or at the very least, should be approached with proper security protocols in mind.\nThe following security solutions can also protect users from email-based attacks:\nTrend Micro™ Cloud App Security– Enhances the security of Microsoft Office 365 and other cloud services via computer vision and real-time scanning. It also protects organizations from email-based threats. \nTrend Micro™ Deep Discovery™ Email Inspector– Defends users through a combination of real-time scanning and advanced analysis techniques for known and unknown attacks. \n",
        "phase": "other"
    }
]