[
    {
        "phase": "initial access",
        "content": "All observed cases used spear phishing emails with Microsoft Word 97 – 2003 (.doc) files attached or CPL files. The doc files exploit both Microsoft Office (CVE2012-0158 and CVE-2013-3906) and Microsoft Word (CVE- 2014-1761). \nThere are indicators that point to a possible Chinese origin for the exploits used in these attachments. Command and Control (C2) servers located in China have been identified in this campaign. In addition, registration information for some of the domains use details of supposedly Chinese citizens. Obviously, all this could just be a red herring. The targets were all employees affiliated to the affected institution. The spear phishing email messages appeared legitimate and in some cases were sent from compromised coworkers' accounts. In this way compromised systems were used as a transmission vector. \nGiven that the victims were mostly Russian-speaking financial institutions, the names of the attachments we have identified were generally in Russian. Examples include “Соответствие ФЗ-115” and “Приглашение” which translate into “Accordance to Federal Law” and “Invitation” respectively. This is enough to induce a typical employee to open the attachment and execute the malware. For a complete list of file names see Appendix 4. In this case, the attachment was a CPL file compressed using the Roshal Archive (.rar) format. \nOnce the remote code execution vulnerability is successfully exploited, it installs Carbanak on the victim's system. The complete list of observed spear phishing emails can be found in Appendix 1 – Spear phishing. \nAn additional infection vector that we believe was used by the criminals is a classical drive-by-download attack. We have found traces of the Null and the RedKit exploits kits. The image above translates as Country_name, All visitors, Unique visitors, Banned visitor, Revoked infections, Infected. ",
        "relationship": "1. [CoT]: The text mentions that the observed cases used spear phishing emails with Microsoft Word 97 – 2003 (.doc) files attached, indicating a process (spear phishing email process) sending a file (.doc).   [Relationships]: <process:spear phishing email process,send,file:.doc>. \n2. [CoT]: The text states that the doc files exploit Microsoft Office (CVE2012-0158 and CVE-2013-3906), showing a process (doc files process) exploiting a vulnerability (CVE2012-0158 and CVE-2013-3906).   [Relationships]: <process:doc files process,exploit,vulnerability:CVE2012-0158 and CVE-2013-3906>. \n3. [CoT]: The text describes that the doc files exploit Microsoft Word (CVE-2014-1761), indicating a process (doc files process) exploiting a vulnerability (CVE-2014-1761).   [Relationships]: <process:doc files process,exploit,vulnerability:CVE-2014-1761>. \n4. [CoT]: The text mentions that Command and Control (C2) servers located in China have been identified, showing a process (C2 servers process) communicating with a socket (C2 servers).   [Relationships]: <process:C2 servers process,communicate with,socket:C2 servers>. \n5. [CoT]: The text states that the spear phishing email messages were sent from compromised coworkers' accounts, indicating a process (spear phishing email process) sending a process (compromised coworkers' accounts process).   [Relationships]: <process:spear phishing email process,send,process:compromised coworkers' accounts>. \n6. [CoT]: The text describes that the attachment was a CPL file compressed using the Roshal Archive (.rar) format, showing a process (spear phishing email process) sending a file (.rar file).   [Relationships]: <process:spear phishing email process,send,file:.rar>. \n7. [CoT]: The text states that once the remote code execution vulnerability is successfully exploited, it installs Carbanak, indicating a process (remote code execution vulnerability process) installing a process (Carbanak process).   [Relationships]: <process:remote code execution vulnerability,install,process:Carbanak>. \n8. [CoT]: The text mentions traces of the Null and the RedKit exploits kits, showing a process (drive-by-download attack process) using a process (Null and the RedKit exploits kits).   [Relationships]: <process:drive-by-download attack,use,process:Null and the RedKit exploits kits>. ",
        "semantic_relationship": "[CoT]: The original relationship states that the spear phishing email process is sending a .doc file. In system-level terms, this action corresponds to a process writing data (the email with the attached file) to a file on the system, hence the 'Write' relationship. [System-level Relationships]: <process:spear phishing email process,Write,file:.doc>. \n[CoT]: The original relationship states that the doc files process is exploiting the vulnerability CVE2012-0158 and CVE-2013-3906. In system-level terms, this exploitation results in the execution of the vulnerability, as it involves one process triggering the exploit in another process. Therefore, the system-level relationship is 'Fork' from the doc files process to the vulnerability. [System-level Relationships]: <process:doc files process,Fork,vulnerability:CVE2012-0158 and CVE-2013-3906>. \n[CoT]: The original relationship describes a process (doc files process) exploiting a vulnerability (CVE-2014-1761). In system-level terms, this exploitation results in the process injecting code into the Microsoft Word process to achieve code execution. Therefore, the system-level relationship is \"Inject\" from the doc files process to the Microsoft Word process. [System-level Relationships]: <process:doc files process,Inject,process:Microsoft Word>. \n[CoT]: The original relationship \"communicate with\" between a process and a socket implies a network connection, which in system-level terms translates to \"Connect\" as it describes the establishment of a connection between a process and a socket. [System-level Relationships]: <process:C2 servers process,Connect,socket:C2 servers>. \n[CoT]: The original relationship describes a spear phishing email process sending email messages from compromised coworkers' accounts. In system-level terms, this action translates to the spear phishing email process forking (creating a new process) to send the email messages, hence the \"Fork\" relationship. The compromised coworkers' accounts are being used as the destination for the forked process to send email messages. [System-level Relationships]: <process:spear phishing email process,Fork,process:compromised coworkers' accounts>. \n[CoT]: The original relationship \"send\" between the process and the file implies that the process is writing the .rar file to a network socket for transmission, which aligns with the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:spear phishing email process,Write,file:.rar>. \n[CoT]: The term \"install\" in the original relationship implies that the remote code execution vulnerability process is executing code to launch the Carbanak process, which aligns with the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:remote code execution vulnerability,Fork,process:Carbanak>. \n[CoT]: The original relationship \"use\" between two processes typically implies that the parent process (drive-by-download attack) is executing the child process (Null and the RedKit exploits kits). In system-level terms, this maps to the \"Fork\" relationship, where one process creates another. [System-level Relationships]: <process:drive-by-download attack,Fork,process:Null and the RedKit exploits kits>. "
    },
    {
        "phase": "execution",
        "content": "Carbanak is a backdoor used by the attackers to compromise the victim's machine once the exploit, either in the spear phishing email or exploit kit, successfully executes its payload. This section provides a functional analysis of Carbanak’s capabilities. \nCarbanak copies itself into “%system32%\\com” with the name “svchost.exe” with the file attributes: system, hidden and read-only. The original file created by the exploit payload is then deleted. \nTo ensure that Carbanak has autorun privileges the malware creates a new service. The naming syntax is “ $<$ <ServiceName $>$ Sys” where ServiceName is any existing service randomly chosen, with the first character deleted. For example, if the existing service's name is “aspnet” and the visible name is “Asp.net state service”, the service created by the malware would be “aspnetSys” with a visible name of “Sp.net state service”. \n\nBefore creating the malicious service, Carbanak determines if either the avp.exe or avpui.exe processes (components of Kaspersky Internet Security) is running. If found on the target system, Carbanak will try to exploit a known vulnerability in Windows XP, Windows Server 2003, Windows Vista, Windows Server 2008, Windows 7, Windows 8, and Windows Server 2012, CVE-2013-3660, for local privilege escalation. We believe this is not relevant and that the attackers adapt their tools to the victim's defenses. \nCarbanak creates a file with a random name and a .bin extension in %COMMON_APPDATA%\\Mozilla where it stores commands to be executed. \nThen the malware gets the proxy configuration from the registry entry: \n[HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings] and the Mozilla Firefox configuration file in: \n%AppData%\\Mozilla\\Firefox\\<ProfileName>\\prefs.js. \nAdditionally, Carbanak can obtain proxy configuration information from headers sent through an application via SOCKS or HTTP. \nCarbanak injects its code into svchost.exe. Most of the actions described below happen within this process. \nCarbanak downloads the file kldconfig.plug from its C2 server. This file includes the names of the processes to be monitored. \nOnce the system is infected, Carbanak logs keystrokes and takes screenshots every 20 seconds. This monitoring is performed by intercepting the ResumeThread call. To enable connections to the infected computer using the Remote Desktop Protocol (RDP), Carbanak sets Termservice service execution mode to Auto. Also, after executing this service, it modifies the executable code in memory in order to establish simultaneous work processes for both remote and local users. Modules modified in this process are: termsrv.dll, csrsrv.dll, msgina.dll and winlogon.exe. \nIf Carbanak detects the banking application BLIZKO (funds transfer software) in the infected computer, it sends a special notification to its C2 server. Carbanak is also aware of the IFOBS banking application and can, on command, substitute the details of payment documents in the IFOBS system. \nTo communicate with its C2 server, Carbanak uses the HTTP protocol with $\\mathsf{R C2+}$ Base64 encryption, adding additional characters not included in Base64. It also inserts strings with different extensions (.gif,.htm, etc.) at random locations in the HTTP request.\nCarbanak sends its collected monitoring data to its C2 server. It also receives commands. The commands are compared with a hash table; if there is a match Carbanak performs the associated action: In order to render the malware less suspicious, the latest Carbanak samples are digitally signed: \n1.\t footprintcrsgn.dll MD5  08F83D98B18D3DFF16C35A20E24ED49A 2.\t PAExec_Move0.dat MD5  972092CBE7791D27FC9FF6E9ACC12CC3 \nOne of Carbanak’s lateral movement tools is also digitally signed: \n3.\t PAExec-6980-PB-FS-01.ex_ MD5  86A5C466947A6A84554843D852478248 ",
        "relationship": "1. [CoT]: The text states that Carbanak copies itself into \"%system32%\\com\" with the name \"svchost.exe\".   [Relationships]: <process:Carbanak, copies, file:%system32%\\com\\svchost.exe>. \n2. [CoT]: The text mentions that the original file created by the exploit payload is deleted after Carbanak copies itself.   [Relationships]: <process:Carbanak, deletes, file:original file created by the exploit payload>. \n3. [CoT]: Carbanak determines if the avp.exe or avpui.exe processes are running, indicating a process-to-process relationship.   [Relationships]: <process:Carbanak, determines, process:avp.exe or avpui.exe>. \n4. [CoT]: Carbanak creates a file with a random name and a .bin extension in %COMMON_APPDATA%\\Mozilla.   [Relationships]: <process:Carbanak, creates, file:%COMMON_APPDATA%\\Mozilla\\random.bin>. \n5. [CoT]: Carbanak gets proxy configuration from the registry key [HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings].   [Relationships]: <process:Carbanak, gets, reg:[HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings]>. \n6. [CoT]: Carbanak obtains proxy configuration information from the Mozilla Firefox configuration file.   [Relationships]: <process:Carbanak, obtains, file:%AppData%\\Mozilla\\Firefox\\<ProfileName>\\prefs.js>. \n7. [CoT]: Carbanak injects its code into svchost.exe, indicating a process-to-process relationship.   [Relationships]: <process:Carbanak, injects, process:svchost.exe>. \n8. [CoT]: Carbanak downloads the file kldconfig.plug from its C2 server, indicating a process-to-socket relationship.   [Relationships]: <process:Carbanak, downloads, socket:kldconfig.plug from its C2 server>. \n9. [CoT]: Carbanak logs keystrokes, indicating a process-to-file relationship (implied by logging).   [Relationships]: <process:Carbanak, logs, file:keystrokes>. \n10. [CoT]: Carbanak takes screenshots every 20 seconds, indicating a process-to-file relationship (implied by taking screenshots).   [Relationships]: <process:Carbanak, takes, file:screenshots>. \n11. [CoT]: Carbanak sets the Termservice service execution mode to Auto, indicating a process-to-process relationship.   [Relationships]: <process:Carbanak, sets, process:Termservice service>. \n12. [CoT]: Carbanak modifies modules in termsrv.dll, indicating a process-to-file relationship.   [Relationships]: <process:Carbanak, modifies, file:termsrv.dll>. \n13. [CoT]: Carbanak modifies modules in csrsrv.dll, indicating a process-to-file relationship.   [Relationships]: <process:Carbanak, modifies, file:csrsrv.dll>. \n14. [CoT]: Carbanak modifies modules in msgina.dll, indicating a process-to-file relationship.   [Relationships]: <process:Carbanak, modifies, file:msgina.dll>. \n15. [CoT]: Carbanak modifies modules in winlogon.exe, indicating a process-to-file relationship.   [Relationships]: <process:Carbanak, modifies, file:winlogon.exe>. \n16. [CoT]: Carbanak sends monitoring data to its C2 server, indicating a process-to-socket relationship.   [Relationships]: <process:Carbanak, sends, socket:monitoring data to its C2 server>. \n17. [CoT]: Carbanak receives commands from its C2 server, indicating a process-to-socket relationship.   [Relationships]: <process:Carbanak, receives, socket:commands from its C2 server>. \n18. [CoT]: Carbanak is digitally signed by footprintcrsgn.dll, indicating a process-to-process relationship.   [Relationships]: <process:Carbanak, signed by, process:footprintcrsgn.dll>. \n19. [CoT]: Carbanak is digitally signed by PAExec_Move0.dat, indicating a process-to-process relationship.   [Relationships]: <process:Carbanak, signed by, process:PAExec_Move0.dat>. \n20. [CoT]: Carbanak's lateral movement tool PAExec-6980-PB-FS-01.ex_ is digitally signed, indicating a process-to-process relationship.   [Relationships]: <process:Carbanak, signed by, process:PA",
        "semantic_relationship": "[CoT]: The action \"copies\" implies that the process Carbanak is writing data to the file svchost.exe, which corresponds to the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:Carbanak,Write,file:%system32%\\com\\svchost.exe>. \n[CoT]: The original relationship states that Carbanak deletes a file. In system-level terms, deleting a file involves removing it from the filesystem, which is best represented by the 'Delete' relationship between a process and a file. [System-level Relationships]: <process:Carbanak,Delete,file:original file created by the exploit payload>. \n[CoT]: The original relationship \"determines\" implies that Carbanak is checking the status of avp.exe or avpui.exe, which corresponds to the system-level \"Fork\" relationship where one process checks the status of another process. [System-level Relationships]: <process:Carbanak,Fork,process:avp.exe or avpui.exe>. \n[CoT]: The original relationship states that the Carbanak process creates a file with a .bin extension. In system-level terms, this corresponds to the \"Create\" action between a process and a file. The action is explicitly named as \"creates\" in the original relationship, which directly maps to the system-level \"Create\" relationship between a process and a file. [System-level Relationships]: <process:Carbanak,Create,file:%COMMON_APPDATA%\\Mozilla\\random.bin>. \n[CoT]: The original relationship describes Carbanak reading data from the registry key, which corresponds to the system-level 'Readkey' action in the Process-to-Registry category. [System-level Relationships]: <process:Carbanak,Readkey,reg:[HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings]>. \n[CoT]: The original relationship states that Carbanak \"obtains\" information from the Firefox configuration file. In system-level terms, this implies that the process reads data from the file, hence the \"Read\" relationship. [System-level Relationships]: <process:Carbanak,Read,file:%AppData%\\Mozilla\\Firefox\\<ProfileName>\\prefs.js>. \n[CoT]: The original relationship \"injects\" indicates that the Carbanak process is performing code injection into the svchost.exe process. In system-level terms, this corresponds to the \"Inject\" relationship between processes. [System-level Relationships]: <process:Carbanak,Inject,process:svchost.exe>. \n[CoT]: The original relationship describes a process downloading a file from a C2 server, which implies establishing a connection to the socket (C2 server). In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:Carbanak,Connect,socket:kldconfig.plug>. \n[CoT]: The action \"logs keystrokes\" implies that the Carbanak process is writing data to a file (keystrokes), which aligns with the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:Carbanak,Write,file:keystrokes>. \n[CoT]: The action \"takes screenshots\" implies that the Carbanak process is writing data to a file named \"screenshots\". Therefore, the system-level relationship is \"Write\" from the process to the file. [System-level Relationships]: <process:Carbanak,Write,file:screenshots>. \n[CoT]: The original relationship describes Carbanak modifying the execution mode of the Termservice service. In system-level terms, this action corresponds to modifying process attributes (specifically, the Priority class) of another process, which is captured by the \"Inject\" relationship in the Process-to-Process category. [System-level Relationships]: <process:Carbanak,Inject,process:Termservice service>. \n[CoT]: The original relationship states that Carbanak modifies termsrv.dll, which implies a change to the file's attributes or content. In system-level terms, this corresponds to a Write relationship between the process and the file, as it involves writing modified data to the file. [System-level Relationships]: <process:Carbanak,Write,file:termsrv.dll>. \n[CoT]: The original relationship states that Carbanak modifies modules in csrsrv.dll, which implies that the process is writing to the file (modifying its contents). Therefore, the system-level relationship is 'Write'. [System-level Relationships]: <process:Carbanak,Write,file:csrsrv.dll>. \n[CoT]: The original relationship states that Carbanak modifies msgina.dll, which implies a change to the file's content. In system-level terms, this corresponds to a \"Write\" operation where the process writes to the file. [System-level Relationships]: <process:Carbanak,Write,file:msgina.dll>. \n[CoT]: The original relationship states that Carbanak \"modifies\" winlogon.exe, which implies a change to the file's content. In system-level terms, this corresponds to a \"Write\" operation, as the process is modifying the file's modules. [System-level Relationships]: <process:Carbanak,Write,file:winlogon.exe>. \n[CoT]: The original relationship \"sends\" indicates that the Carbanak process is sending data to a socket (C2 server). In system-level terms, this corresponds to the \"Send\" relationship between a process and a socket. [System-level Relationships]: <process:Carbanak,Send,socket:monitoring data to its C2 server>. \n[CoT]: The original relationship describes a process receiving commands from a socket (C2 server). In system-level terms, this corresponds to the 'Receive' action between a process and a socket. [System-level Relationships]: <process:Carbanak,Receive,socket:commands from its C2 server>. \n[CoT]: The original relationship \"signed by\" indicates that the Carbanak process is loading a DLL (footprintcrsgn.dll) into its process space. In system-level terms, this corresponds to the \"Loadlibrary\" relationship between processes. [System-level Relationships]: <process:Carbanak,Loadlibrary,process:footprintcrsgn.dll>. \n[CoT]: The original relationship indicates that Carbanak is signed by PAExec_Move0.dat, which implies that Carbanak executed PAExec_Move0.dat. In system-level terms, this translates to an \"Fork\" relationship between the two processes. [System-level Relationships]: <process:Carbanak,Fork,process:PAExec_Move0.dat>. \n[CoT]: The original relationship \"signed by\" indicates that the Carbanak process is executing the PAExec-6980-PB-FS-01.ex_ file, which is signed by the process. In system-level terms, this translates to a \"Fork\" relationship, as the signing process (Carbanak) is executing the signed file (PAExec-6980-PB-FS-01.ex_). [System-level Relationships]: <process:Carbanak,Fork,process:PAExec-6980-PB-FS-01.ex_>"
    },
    {
        "phase": "command and control",
        "content": "Carbanak uses different tools on infected systems, each one with a different purpose. There appears to be a preference for the Ammyy Admin remote administration tool for remote control. Specifically, the attackers have been detected uploading: Ammyy Admin 3.5 (f8cd52b70a11a1fb3f29c6f89ff971ec) as svchost.exe. It is believed that the attackers used this remote administration tool because it is commonly whitelisted in the victims’ environments as a result of being used regularly by administrators. \nIn another instance, a Secure Shell (SSH) backdoor was used to communicate with the C2 server in 190.97.165.126 (operatemesscont.net). \nThis indicates that the attackers did not limit themselves to Microsoft Windows environments. In this case, the victim used the Telnet/SSH client PuTTY to connect to the server, and the attackers recompiled the machine’s SSH daemon with a backdoor so they could gain direct access. \nLogs for these tools indicate that they were accessed from two different IPs, probably used by the attackers, and located in Ukraine and France. \nWe have also found traces of many different tools used by the attackers inside the victim's network to gain control of additional systems, such as Metasploit, PsExec or Mimikatz. ",
        "relationship": "1. [CoT]: The text states that Carbanak uses different tools, including Ammyy Admin remote administration tool, which is later identified as being uploaded as svchost.exe. [Relationships]: <process:Carbanak,uses,process:Ammyy Admin remote administration tool>. \n2. [CoT]: The text mentions that the attackers used Ammyy Admin 3.5 to upload to the C2 server at 190.97.165.126. [Relationships]: <process:Ammyy Admin remote administration tool,uploads,socket:190.97.165.126>. \n3. [CoT]: The text describes that the victim used PuTTY to connect to the server, which is later identified as operatemesscont.net. [Relationships]: <process:victim used,process:used,socket:operatemesscont.net>. \n4. [CoT]: The text states that the attackers recompiled the machine's SSH daemon with a backdoor. [Relationships]: <process:attackers,recompiled,process:SSH daemon>. \n5. [CoT]: The text mentions that the attackers used tools like Metasploit, PsExec, and Mimikatz within the victim's network. [Relationships]: <process:attackers,used,process:Metasploit>. ",
        "semantic_relationship": "[CoT]: The original relationship states that Carbanak \"uses\" Ammyy Admin remote administration tool. In system-level terms, this implies that Carbanak executes the Ammyy Admin process, as it is uploading and running svchost.exe. Therefore, the correct system-level relationship is \"Fork\". [System-level Relationships]: <process:Carbanak,Fork,process:Ammyy Admin remote administration tool>. \n[CoT]: The original relationship \"uploads\" indicates that the process is sending data to a remote socket, which corresponds to the system-level \"Send\" relationship between a process and a socket. [System-level Relationships]: <process:Ammyy Admin remote administration tool,Send,socket:190.97.165.126>. \n[CoT]: The original relationship \"used\" between two processes (victim and PuTTY) is converted to \"Fork\" as it indicates the initiation or spawning of a network connection by one process to another. [System-level Relationships]: <process:victim,Fork,socket:operatemesscont.net>. \n[CoT]: The original relationship \"recompiled\" implies that the attackers modified the SSH daemon's code, which would involve injecting new code or libraries into the process memory. This aligns with the system-level relationship \"Inject\" between processes. [System-level Relationships]: <process:attackers,Inject,process:SSH daemon>. \n[CoT]: The original relationship \"used\" between the attackers process and Metasploit process implies that the attackers executed the Metasploit process, which aligns with the system-level relationship \"Fork\" between two processes. [System-level Relationships]: <process:attackers,Fork,process:Metasploit>. "
    },
    {
        "phase": "command and control",
        "content": "There appear to be four distinct types of C2 servers: \nLinux servers used for issuing commands to deployed Carbanak instances and for receiving collected monitoring data;   \nWindows servers used for remote connections to victim systems;   \nBackup servers; and   \nDrop servers where additional executable files (e.g. remote administration tools) are hosted. \nServer rotation occurs more or less on a biweekly basis. For a complete list of identified Carbanak servers please check the regularly updated Carbanak IOC document. The current list of IOCs is provided at Appendix 3 in his document. \nSome of these C2 servers are responsible for dropping Ammyy (configuration and executable files), the KLG plugin configuration (list of processes to monitor) and the VNC server (both 32 and 64 bits to be injected in rundll). In one of the observed servers there was also a Metasploit module. \nVictim systems are catalogued in the servers’ databases. The victims belong to a number of different communities, thus simplifying administration. In all, 85 different victims belonging to seven communities were found. ",
        "relationship": "1. [CoT]: The text mentions that Carbanak instances receive collected monitoring data from Linux servers, indicating a process-to-socket relationship where 'Carbanak instances' is the process and 'receiving collected monitoring data' refers to the socket. [Relationships]: <process:Carbanak instances,receiving,socket:collected monitoring data>. \n2. [CoT]: The text states that Carbanak instances receive commands from Linux servers, showing a process-to-socket relationship similar to the previous one. [Relationships]: <process:Carbanak instances,receiving,socket:commands>. \n3. [CoT]: The text describes Windows servers being used for remote connections to victim systems, indicating a process-to-process relationship where 'Windows servers' is the process and 'remote connections to victim systems' refers to the other process. [Relationships]: <process:Windows servers,used,process:victim systems>. \n4. [CoT]: The text mentions that some C2 servers are responsible for dropping Ammyy files, showing a process-to-file relationship where 'C2 servers' is the process and 'dropping Ammyy (configuration and executable files)' refers to the files. [Relationships]: <process:C2 servers,dropping,file:Ammyy files>. \n5. [CoT]: The text also mentions the dropping of KLG plugin configuration files by C2 servers, further supporting a process-to-file relationship. [Relationships]: <process:C2 servers,dropping,file:KLG plugin configuration>. \n6. [CoT]: The text describes the injection of VNC server into rundll, indicating a process-to-file relationship where 'some of these C2 servers' is the process and 'VNC server' refers to the file being injected. [Relationships]: <process:C2 servers,injecting,file:VNC server>]. \n7. [CoT]: The text mentions the presence of a Metasploit module in one of the observed servers, showing a process-to-file relationship where 'observed servers' is the process and 'Metasploit module' refers to the file. [Relationships]: <process:observed servers,hosting,file:Metasploit module>. \n8. [CoT]: The text states that victim systems are catalogued in the servers' databases, indicating a process-to-file relationship where 'servers' is the process and 'databases' refers to the files. [Relationships]: <process:servers,cataloguing,file:databases>. ",
        "semantic_relationship": "[CoT]: The original relationship describes a process receiving data from a socket, which directly maps to the system-level 'Receive' relationship between a process and a socket. This indicates network data being received by the Carbanak instances from the collected monitoring data socket. [System-level Relationships]: <process:Carbanak instances,Receive,socket:collected monitoring data>. \n[CoT]: The original relationship describes Carbanak instances receiving commands from Linux servers via socket. In system-level terms, this corresponds to the 'Receive' action between a process and a socket, as the process is accepting data transmitted over the network. [System-level Relationships]: <process:Carbanak instances,Receive,socket:commands>. \n[CoT]: The original relationship states that Windows servers 'used' remote connections to victim systems. In system-level terms, this implies the Windows servers initiated a connection to the victim systems, which maps to the 'Connect' relationship between processes. [System-level Relationships]: <process:Windows servers,Connect,process:victim systems>. \n[CoT]: The term \"dropping\" in the original relationship implies that the C2 servers are creating Ammyy files on the system, which corresponds to the \"Create\" action in the system-level relationships framework. [System-level Relationships]: <process:C2 servers,Create,file:Ammyy files>. \n[CoT]: The term \"dropping\" in the original relationship implies that the C2 servers are creating new configuration files on the system, which aligns with the system-level relationship \"Create\" between a process and a file. [System-level Relationships]: <process:C2 servers,Create,file:KLG plugin configuration>. \n[CoT]: The original relationship describes a process ('C2 servers') injecting into a file ('VNC server'). In system-level terms, this corresponds to the 'Inject' relationship between a process and a file, as it involves writing data into another process or file. [System-level Relationships]: <process:C2 servers,Inject,file:VNC server>]. \n[CoT]: The original relationship indicates that the observed servers are hosting the Metasploit module, which implies that the process is executing the file (Metasploit module). Therefore, the system-level relationship is 'Execute' as it aligns with the Process-to-File relationship where the process runs the file. [System-level Relationships]: <process:observed servers,Execute,file:Metasploit module>. \n[CoT]: The original relationship describes 'servers' cataloguing data in 'databases', which implies that the servers are writing or modifying data in the databases. Therefore, the system-level relationship is 'Write' as it involves modifying the content of the files. [System-level Relationships]: <process:servers,Write,file:databases>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that the observed cases used spear phishing emails with Microsoft Word 97 – 2003 (.doc) files attached, indicating a process (spear phishing email process) sending a file (.doc).   [Original Relationships]: <process:spear phishing email process,send,file:.doc>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the spear phishing email process is sending a .doc file. In system-level terms, this action corresponds to a process writing data (the email with the attached file) to a file on the system, hence the 'Write' relationship. [System-level Relationships]: <process:spear phishing email process,Write,file:.doc>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the doc files exploit Microsoft Office (CVE2012-0158 and CVE-2013-3906), showing a process (doc files process) exploiting a vulnerability (CVE2012-0158 and CVE-2013-3906).   [Original Relationships]: <process:doc files process,exploit,vulnerability:CVE2012-0158 and CVE-2013-3906>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the doc files process is exploiting the vulnerability CVE2012-0158 and CVE-2013-3906. In system-level terms, this exploitation results in the execution of the vulnerability, as it involves one process triggering the exploit in another process. Therefore, the system-level relationship is 'Fork' from the doc files process to the vulnerability. [System-level Relationships]: <process:doc files process,Fork,vulnerability:CVE2012-0158 and CVE-2013-3906>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text describes that the doc files exploit Microsoft Word (CVE-2014-1761), indicating a process (doc files process) exploiting a vulnerability (CVE-2014-1761).   [Original Relationships]: <process:doc files process,exploit,vulnerability:CVE-2014-1761>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (doc files process) exploiting a vulnerability (CVE-2014-1761). In system-level terms, this exploitation results in the process injecting code into the Microsoft Word process to achieve code execution. Therefore, the system-level relationship is \"Inject\" from the doc files process to the Microsoft Word process. [System-level Relationships]: <process:doc files process,Inject,process:Microsoft Word>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that Command and Control (C2) servers located in China have been identified, showing a process (C2 servers process) communicating with a socket (C2 servers).   [Original Relationships]: <process:C2 servers process,communicate with,socket:C2 servers>. ",
                "semantic_relationship": "[CoT]: The original relationship \"communicate with\" between a process and a socket implies a network connection, which in system-level terms translates to \"Connect\" as it describes the establishment of a connection between a process and a socket. [System-level Relationships]: <process:C2 servers process,Connect,socket:C2 servers>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the spear phishing email messages were sent from compromised coworkers' accounts, indicating a process (spear phishing email process) sending a process (compromised coworkers' accounts process).   [Original Relationships]: <process:spear phishing email process,send,process:compromised coworkers' accounts>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a spear phishing email process sending email messages from compromised coworkers' accounts. In system-level terms, this action translates to the spear phishing email process forking (creating a new process) to send the email messages, hence the \"Fork\" relationship. The compromised coworkers' accounts are being used as the destination for the forked process to send email messages. [System-level Relationships]: <process:spear phishing email process,Fork,process:compromised coworkers' accounts>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text describes that the attachment was a CPL file compressed using the Roshal Archive (.rar) format, showing a process (spear phishing email process) sending a file (.rar file).   [Original Relationships]: <process:spear phishing email process,send,file:.rar>. ",
                "semantic_relationship": "[CoT]: The original relationship \"send\" between the process and the file implies that the process is writing the .rar file to a network socket for transmission, which aligns with the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:spear phishing email process,Write,file:.rar>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that once the remote code execution vulnerability is successfully exploited, it installs Carbanak, indicating a process (remote code execution vulnerability process) installing a process (Carbanak process).   [Original Relationships]: <process:remote code execution vulnerability,install,process:Carbanak>. ",
                "semantic_relationship": "[CoT]: The term \"install\" in the original relationship implies that the remote code execution vulnerability process is executing code to launch the Carbanak process, which aligns with the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:remote code execution vulnerability,Fork,process:Carbanak>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions traces of the Null and the RedKit exploits kits, showing a process (drive-by-download attack process) using a process (Null and the RedKit exploits kits).   [Original Relationships]: <process:drive-by-download attack,use,process:Null and the RedKit exploits kits>. ",
                "semantic_relationship": "[CoT]: The original relationship \"use\" between two processes typically implies that the parent process (drive-by-download attack) is executing the child process (Null and the RedKit exploits kits). In system-level terms, this maps to the \"Fork\" relationship, where one process creates another. [System-level Relationships]: <process:drive-by-download attack,Fork,process:Null and the RedKit exploits kits>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that Carbanak copies itself into \"%system32%\\com\" with the name \"svchost.exe\".   [Original Relationships]: <process:Carbanak, copies, file:%system32%\\com\\svchost.exe>. ",
                "semantic_relationship": "[CoT]: The action \"copies\" implies that the process Carbanak is writing data to the file svchost.exe, which corresponds to the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:Carbanak,Write,file:%system32%\\com\\svchost.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that the original file created by the exploit payload is deleted after Carbanak copies itself.   [Original Relationships]: <process:Carbanak, deletes, file:original file created by the exploit payload>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Carbanak deletes a file. In system-level terms, deleting a file involves removing it from the filesystem, which is best represented by the 'Delete' relationship between a process and a file. [System-level Relationships]: <process:Carbanak,Delete,file:original file created by the exploit payload>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak determines if the avp.exe or avpui.exe processes are running, indicating a process-to-process relationship.   [Original Relationships]: <process:Carbanak, determines, process:avp.exe or avpui.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship \"determines\" implies that Carbanak is checking the status of avp.exe or avpui.exe, which corresponds to the system-level \"Fork\" relationship where one process checks the status of another process. [System-level Relationships]: <process:Carbanak,Fork,process:avp.exe or avpui.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak creates a file with a random name and a .bin extension in %COMMON_APPDATA%\\Mozilla.   [Original Relationships]: <process:Carbanak, creates, file:%COMMON_APPDATA%\\Mozilla\\random.bin>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the Carbanak process creates a file with a .bin extension. In system-level terms, this corresponds to the \"Create\" action between a process and a file. The action is explicitly named as \"creates\" in the original relationship, which directly maps to the system-level \"Create\" relationship between a process and a file. [System-level Relationships]: <process:Carbanak,Create,file:%COMMON_APPDATA%\\Mozilla\\random.bin>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak gets proxy configuration from the registry key [HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings].   [Original Relationships]: <process:Carbanak, gets, reg:[HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings]>. ",
                "semantic_relationship": "[CoT]: The original relationship describes Carbanak reading data from the registry key, which corresponds to the system-level 'Readkey' action in the Process-to-Registry category. [System-level Relationships]: <process:Carbanak,Readkey,reg:[HKCU\\Software\\Microsoft\\Windows\\CurrentVersion\\Internet Settings]>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak obtains proxy configuration information from the Mozilla Firefox configuration file.   [Original Relationships]: <process:Carbanak, obtains, file:%AppData%\\Mozilla\\Firefox\\<ProfileName>\\prefs.js>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Carbanak \"obtains\" information from the Firefox configuration file. In system-level terms, this implies that the process reads data from the file, hence the \"Read\" relationship. [System-level Relationships]: <process:Carbanak,Read,file:%AppData%\\Mozilla\\Firefox\\<ProfileName>\\prefs.js>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak injects its code into svchost.exe, indicating a process-to-process relationship.   [Original Relationships]: <process:Carbanak, injects, process:svchost.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship \"injects\" indicates that the Carbanak process is performing code injection into the svchost.exe process. In system-level terms, this corresponds to the \"Inject\" relationship between processes. [System-level Relationships]: <process:Carbanak,Inject,process:svchost.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak downloads the file kldconfig.plug from its C2 server, indicating a process-to-socket relationship.   [Original Relationships]: <process:Carbanak, downloads, socket:kldconfig.plug from its C2 server>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process downloading a file from a C2 server, which implies establishing a connection to the socket (C2 server). In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:Carbanak,Connect,socket:kldconfig.plug>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak logs keystrokes, indicating a process-to-file relationship (implied by logging).   [Original Relationships]: <process:Carbanak, logs, file:keystrokes>. ",
                "semantic_relationship": "[CoT]: The action \"logs keystrokes\" implies that the Carbanak process is writing data to a file (keystrokes), which aligns with the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:Carbanak,Write,file:keystrokes>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak takes screenshots every 20 seconds, indicating a process-to-file relationship (implied by taking screenshots).   [Original Relationships]: <process:Carbanak, takes, file:screenshots>. ",
                "semantic_relationship": "[CoT]: The action \"takes screenshots\" implies that the Carbanak process is writing data to a file named \"screenshots\". Therefore, the system-level relationship is \"Write\" from the process to the file. [System-level Relationships]: <process:Carbanak,Write,file:screenshots>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak sets the Termservice service execution mode to Auto, indicating a process-to-process relationship.   [Original Relationships]: <process:Carbanak, sets, process:Termservice service>. ",
                "semantic_relationship": "[CoT]: The original relationship describes Carbanak modifying the execution mode of the Termservice service. In system-level terms, this action corresponds to modifying process attributes (specifically, the Priority class) of another process, which is captured by the \"Inject\" relationship in the Process-to-Process category. [System-level Relationships]: <process:Carbanak,Inject,process:Termservice service>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak modifies modules in termsrv.dll, indicating a process-to-file relationship.   [Original Relationships]: <process:Carbanak, modifies, file:termsrv.dll>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Carbanak modifies termsrv.dll, which implies a change to the file's attributes or content. In system-level terms, this corresponds to a Write relationship between the process and the file, as it involves writing modified data to the file. [System-level Relationships]: <process:Carbanak,Write,file:termsrv.dll>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak modifies modules in csrsrv.dll, indicating a process-to-file relationship.   [Original Relationships]: <process:Carbanak, modifies, file:csrsrv.dll>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Carbanak modifies modules in csrsrv.dll, which implies that the process is writing to the file (modifying its contents). Therefore, the system-level relationship is 'Write'. [System-level Relationships]: <process:Carbanak,Write,file:csrsrv.dll>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak modifies modules in msgina.dll, indicating a process-to-file relationship.   [Original Relationships]: <process:Carbanak, modifies, file:msgina.dll>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Carbanak modifies msgina.dll, which implies a change to the file's content. In system-level terms, this corresponds to a \"Write\" operation where the process writes to the file. [System-level Relationships]: <process:Carbanak,Write,file:msgina.dll>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak modifies modules in winlogon.exe, indicating a process-to-file relationship.   [Original Relationships]: <process:Carbanak, modifies, file:winlogon.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Carbanak \"modifies\" winlogon.exe, which implies a change to the file's content. In system-level terms, this corresponds to a \"Write\" operation, as the process is modifying the file's modules. [System-level Relationships]: <process:Carbanak,Write,file:winlogon.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak sends monitoring data to its C2 server, indicating a process-to-socket relationship.   [Original Relationships]: <process:Carbanak, sends, socket:monitoring data to its C2 server>. ",
                "semantic_relationship": "[CoT]: The original relationship \"sends\" indicates that the Carbanak process is sending data to a socket (C2 server). In system-level terms, this corresponds to the \"Send\" relationship between a process and a socket. [System-level Relationships]: <process:Carbanak,Send,socket:monitoring data to its C2 server>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak receives commands from its C2 server, indicating a process-to-socket relationship.   [Original Relationships]: <process:Carbanak, receives, socket:commands from its C2 server>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process receiving commands from a socket (C2 server). In system-level terms, this corresponds to the 'Receive' action between a process and a socket. [System-level Relationships]: <process:Carbanak,Receive,socket:commands from its C2 server>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak is digitally signed by footprintcrsgn.dll, indicating a process-to-process relationship.   [Original Relationships]: <process:Carbanak, signed by, process:footprintcrsgn.dll>. ",
                "semantic_relationship": "[CoT]: The original relationship \"signed by\" indicates that the Carbanak process is loading a DLL (footprintcrsgn.dll) into its process space. In system-level terms, this corresponds to the \"Loadlibrary\" relationship between processes. [System-level Relationships]: <process:Carbanak,Loadlibrary,process:footprintcrsgn.dll>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak is digitally signed by PAExec_Move0.dat, indicating a process-to-process relationship.   [Original Relationships]: <process:Carbanak, signed by, process:PAExec_Move0.dat>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that Carbanak is signed by PAExec_Move0.dat, which implies that Carbanak executed PAExec_Move0.dat. In system-level terms, this translates to an \"Fork\" relationship between the two processes. [System-level Relationships]: <process:Carbanak,Fork,process:PAExec_Move0.dat>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Carbanak's lateral movement tool PAExec-6980-PB-FS-01.ex_ is digitally signed, indicating a process-to-process relationship.   [Original Relationships]: <process:Carbanak, signed by, process:PA",
                "semantic_relationship": "[CoT]: The original relationship \"signed by\" indicates that the Carbanak process is executing the PAExec-6980-PB-FS-01.ex_ file, which is signed by the process. In system-level terms, this translates to a \"Fork\" relationship, as the signing process (Carbanak) is executing the signed file (PAExec-6980-PB-FS-01.ex_). [System-level Relationships]: <process:Carbanak,Fork,process:PAExec-6980-PB-FS-01.ex_>"
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that Carbanak uses different tools, including Ammyy Admin remote administration tool, which is later identified as being uploaded as svchost.exe. [Original Relationships]: <process:Carbanak,uses,process:Ammyy Admin remote administration tool>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Carbanak \"uses\" Ammyy Admin remote administration tool. In system-level terms, this implies that Carbanak executes the Ammyy Admin process, as it is uploading and running svchost.exe. Therefore, the correct system-level relationship is \"Fork\". [System-level Relationships]: <process:Carbanak,Fork,process:Ammyy Admin remote administration tool>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that the attackers used Ammyy Admin 3.5 to upload to the C2 server at 190.97.165.126. [Original Relationships]: <process:Ammyy Admin remote administration tool,uploads,socket:190.97.165.126>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uploads\" indicates that the process is sending data to a remote socket, which corresponds to the system-level \"Send\" relationship between a process and a socket. [System-level Relationships]: <process:Ammyy Admin remote administration tool,Send,socket:190.97.165.126>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes that the victim used PuTTY to connect to the server, which is later identified as operatemesscont.net. [Original Relationships]: <process:victim used,process:used,socket:operatemesscont.net>. ",
                "semantic_relationship": "[CoT]: The original relationship \"used\" between two processes (victim and PuTTY) is converted to \"Fork\" as it indicates the initiation or spawning of a network connection by one process to another. [System-level Relationships]: <process:victim,Fork,socket:operatemesscont.net>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the attackers recompiled the machine's SSH daemon with a backdoor. [Original Relationships]: <process:attackers,recompiled,process:SSH daemon>. ",
                "semantic_relationship": "[CoT]: The original relationship \"recompiled\" implies that the attackers modified the SSH daemon's code, which would involve injecting new code or libraries into the process memory. This aligns with the system-level relationship \"Inject\" between processes. [System-level Relationships]: <process:attackers,Inject,process:SSH daemon>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that the attackers used tools like Metasploit, PsExec, and Mimikatz within the victim's network. [Original Relationships]: <process:attackers,used,process:Metasploit>. ",
                "semantic_relationship": "[CoT]: The original relationship \"used\" between the attackers process and Metasploit process implies that the attackers executed the Metasploit process, which aligns with the system-level relationship \"Fork\" between two processes. [System-level Relationships]: <process:attackers,Fork,process:Metasploit>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that Carbanak instances receive collected monitoring data from Linux servers, indicating a process-to-socket relationship where 'Carbanak instances' is the process and 'receiving collected monitoring data' refers to the socket. [Original Relationships]: <process:Carbanak instances,receiving,socket:collected monitoring data>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process receiving data from a socket, which directly maps to the system-level 'Receive' relationship between a process and a socket. This indicates network data being received by the Carbanak instances from the collected monitoring data socket. [System-level Relationships]: <process:Carbanak instances,Receive,socket:collected monitoring data>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that Carbanak instances receive commands from Linux servers, showing a process-to-socket relationship similar to the previous one. [Original Relationships]: <process:Carbanak instances,receiving,socket:commands>. ",
                "semantic_relationship": "[CoT]: The original relationship describes Carbanak instances receiving commands from Linux servers via socket. In system-level terms, this corresponds to the 'Receive' action between a process and a socket, as the process is accepting data transmitted over the network. [System-level Relationships]: <process:Carbanak instances,Receive,socket:commands>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes Windows servers being used for remote connections to victim systems, indicating a process-to-process relationship where 'Windows servers' is the process and 'remote connections to victim systems' refers to the other process. [Original Relationships]: <process:Windows servers,used,process:victim systems>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Windows servers 'used' remote connections to victim systems. In system-level terms, this implies the Windows servers initiated a connection to the victim systems, which maps to the 'Connect' relationship between processes. [System-level Relationships]: <process:Windows servers,Connect,process:victim systems>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that some C2 servers are responsible for dropping Ammyy files, showing a process-to-file relationship where 'C2 servers' is the process and 'dropping Ammyy (configuration and executable files)' refers to the files. [Original Relationships]: <process:C2 servers,dropping,file:Ammyy files>. ",
                "semantic_relationship": "[CoT]: The term \"dropping\" in the original relationship implies that the C2 servers are creating Ammyy files on the system, which corresponds to the \"Create\" action in the system-level relationships framework. [System-level Relationships]: <process:C2 servers,Create,file:Ammyy files>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text also mentions the dropping of KLG plugin configuration files by C2 servers, further supporting a process-to-file relationship. [Original Relationships]: <process:C2 servers,dropping,file:KLG plugin configuration>. ",
                "semantic_relationship": "[CoT]: The term \"dropping\" in the original relationship implies that the C2 servers are creating new configuration files on the system, which aligns with the system-level relationship \"Create\" between a process and a file. [System-level Relationships]: <process:C2 servers,Create,file:KLG plugin configuration>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes the injection of VNC server into rundll, indicating a process-to-file relationship where 'some of these C2 servers' is the process and 'VNC server' refers to the file being injected. [Original Relationships]: <process:C2 servers,injecting,file:VNC server>]. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process ('C2 servers') injecting into a file ('VNC server'). In system-level terms, this corresponds to the 'Inject' relationship between a process and a file, as it involves writing data into another process or file. [System-level Relationships]: <process:C2 servers,Inject,file:VNC server>]. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions the presence of a Metasploit module in one of the observed servers, showing a process-to-file relationship where 'observed servers' is the process and 'Metasploit module' refers to the file. [Original Relationships]: <process:observed servers,hosting,file:Metasploit module>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the observed servers are hosting the Metasploit module, which implies that the process is executing the file (Metasploit module). Therefore, the system-level relationship is 'Execute' as it aligns with the Process-to-File relationship where the process runs the file. [System-level Relationships]: <process:observed servers,Execute,file:Metasploit module>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that victim systems are catalogued in the servers' databases, indicating a process-to-file relationship where 'servers' is the process and 'databases' refers to the files. [Original Relationships]: <process:servers,cataloguing,file:databases>. ",
                "semantic_relationship": "[CoT]: The original relationship describes 'servers' cataloguing data in 'databases', which implies that the servers are writing or modifying data in the databases. Therefore, the system-level relationship is 'Write' as it involves modifying the content of the files. [System-level Relationships]: <process:servers,Write,file:databases>. "
            }
        ]
    }
]