[
    {
        "phase": "initial access",
        "content": "The attackers would usually send a malicious email message that either links to an archive file (RAR or ZIP compressed) or has one attached to it.  Below are malicious email messages that have been sent to multiple targets on September and December 2015. \n The link may include these parameters: \n Id - the ID of the current wave of malicious email messages, composed of a plaintext word, a plus sign, and a number. For example: Rand+281   \n token1 - same as id, but Base64 encoded   \n token2 - Base64 encoded email address of the target to which the malicious message was sent.   \n C - the word Click or openexe \nThe following regular expression matches the structure of malicious links: \\/[A-Za-z]+\\.php\\?((?:id|token1|token2|C)=[A-Za-z0-9\\/=+%]\\*={0,2}&?){4}.\nFor example:   \nspynews.otzo[.]com/20151104/Update.php?id=>redacted>&token1 $=$ >redacted>&token2 $\\asymp$ >redacted>&C=Cli   \nck \nThe archive contains an .exe file, sometimes disguised as a Microsoft Word file, a video, or another file format, using the corresponding icon. For example: ",
        "relationship": "1. [CoT]: The text states that the attackers send a malicious email with a link to an archive file (RAR or ZIP compressed), indicating a process (the email client) interacting with a socket (the URL link).   [Relationships]: <process:email client,links,socket:URL link>. \n2. [CoT]: The text mentions that the malicious email has an attached archive file, showing a process (the email client) interacting with a file (the attached archive file).   [Relationships]: <process:email client,has,file:attached archive file>. \n3. [CoT]: The text describes that the archive contains an .exe file, another interaction between a process (the email client) and a file (the .exe file).   [Relationships]: <process:email client,contains,file:.exe file>. ",
        "semantic_relationship": "[CoT]: The original relationship \"links\" indicates that the email client process is interacting with the URL link, which represents a network connection. In system-level terms, this interaction corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:email client,Connect,socket:URL link>. \n[CoT]: The original relationship \"has\" indicates that the email client process is interacting with the attached archive file, which in system-level terms translates to the \"Read\" relationship, as the process is reading the file contents. [System-level Relationships]: <process:email client,Read,file:attached archive file>. \n[CoT]: The original relationship \"contains\" between a process and a file typically implies that the process is executing the file, which aligns with the system-level relationship \"Execute\" in the Process-to-File category. [System-level Relationships]: <process:email client,Execute,file:.exe file>. "
    },
    {
        "phase": "initial access",
        "content": "If the victim extracts the archive and clicks the .exe file, the lure document or video are presented while the computer is being infected with DustySky. \nIn recent samples the group used Microsoft Word files embed with a malicious macro, which would infect the victim if enabled. Note, that these infection methods rely on social engineering - convincing the victim to open the file (and enabling content if it is disabled) - and not on software vulnerabilities. \nThe subject line of the malicious email message, as well as the name and content of the lure document, are usually related to recent events in diplomacy, defense, and politics. Sometimes lure topics are gossip or sex related and might even include a pornographic video. In recent samples, fake invoices and a copy of the public Google privacy policy were used. \nThe content of the lure document is always copied from a public news item or other web content, and is never an original composition of the attackers. \nThe \"from\" field in malicious messages is usually set to be related to the lure document, such as \"Latest Israel news\", \"Israeli Hot Stories\", \"Israel Defense Forces\", \"تاسايسلل تاراملإا زكرم\" (impersonates the Emirates Policy Center organization6). \nWhen linked from the malicious message, the malware would be hosted either on a cloud service (many times in copy.com, a legitimate file hosting service), or on a server controlled by the attackers. ",
        "relationship": "1. [CoT]: The text states that the victim clicks the .exe file, indicating a process-to-file relationship where the process is the victim's action and the .exe file is the target file.   [Relationships]: <process:victim,clicks,file:.exe>. \n2. [CoT]: The text mentions that Microsoft Word files are used with malicious macros, implying that the victim's system (process) executes the Microsoft Word files.   [Relationships]: <process:victim,executes,file:Microsoft Word files>. \n3. [CoT]: The text describes that the malware would be hosted on a cloud service (copy.com) or an attacker-controlled server, indicating that the victim's system (process) connects to these hosting locations (socket).   [Relationships]: <process:victim,connects,socket:cloud service or server>. \n4. [CoT]: The text states that the malware is hosted on a cloud service (copy.com), which is a domain name, establishing a process-to-socket relationship where the process is the victim's action and the socket is the domain name.   [Relationships]: <process:victim,connects,socket:copy.com>. \n5. [CoT]: The text mentions that the malware would be hosted on a server controlled by the attackers, which is a domain name or IP address, indicating a process-to-socket relationship where the process is the victim's action and the socket is the server location. [Relationships]: <process:victim,connects,socket:server controlled by the attackers>. ",
        "semantic_relationship": "[CoT]: The action \"clicks\" in the original relationship implies that the victim's process is executing the .exe file, which aligns with the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:victim,Execute,file:.exe>. \n[CoT]: The original relationship states that the victim's process executes Microsoft Word files, which directly translates to the system-level relationship \"Execute\" between a process and a file. This aligns with the defined system-level relationships where a process can execute a file. [System-level Relationships]: <process:victim,Execute,file:Microsoft Word files>. \n[CoT]: The original relationship describes a process (victim) connecting to a socket (cloud service or server). In system-level terms, this maps directly to the 'Connect' relationship between a process and a socket, as it involves establishing a network connection. [System-level Relationships]: <process:victim,Connect,socket:cloud service or server>. \n[CoT]: The original relationship describes the victim's process connecting to a socket (domain name), which aligns with the system-level 'Connect' relationship between a process and a socket. The term 'connects' in the original relationship is directly mapped to 'Connect' in the system-level framework. [System-level Relationships]: <process:victim,Connect,socket:copy.com>. \n[CoT]: The original relationship describes a process (victim) connecting to a socket (server controlled by attackers). In system-level terms, this corresponds to a 'Connect' relationship between a process and a socket, as it involves establishing a connection to a remote server. [System-level Relationships]: <process:victim,Connect,socket:server controlled by the attackers>. "
    },
    {
        "phase": "initial access",
        "content": "When the malware is hosted on a server controlled by the attackers, the User-Agent string of the target's browser is checked when they click the malicious link. If the target is using Windows, DuskySky is served. If the operating system is different than Windows, the target is served a Google, Microsoft, or Yahoo phishing page: \nThe source code of the phishing page is made up of a single JavaScript block, which at runtime decodes a single variable into HTML: \nAfter the victim fills in and sends the fake login form, they are redirected to a legitimate website. For example, in one case the victim was redirected to a news item7 in the Israeli news website NRG. Only the news item was old (from one year prior to the attack) and unrelated to the original subject of the malicious email message. It was probably used in previous attacks, and the attackers did not care enough or forgot to change it to a relevant one. ",
        "relationship": "1. [CoT]: The text states that the User-Agent string of the target's browser is checked when they click the malicious link, indicating that the user agent (a string entity) is checked by the malicious link (a socket entity).   [Relationships]: <process:malicious link,check,socket:user agent>. \n2. [CoT]: The text states that if the target is using Windows, DuskySky is served, showing that the malicious link (a process entity) serves the DuskySky (a process entity).   [Relationships]: <process:malicious link,serve,process:DuskySky>. \n3. [CoT]: The text mentions that if the operating system is different than Windows, the target is served a Google, Microsoft, or Yahoo phishing page, indicating that the malicious link (a process entity) serves a Google, Microsoft, or Yahoo phishing page (a process entity).   [Relationships]: <process:malicious link,serve,process:phishing page>. \n4. [CoT]: The text describes that the source code of the phishing page is made up of a single JavaScript block, which at runtime decodes a single variable into HTML, showing that the JavaScript (a process entity) decodes a single variable (a file entity) into HTML (a file entity).   [Relationships]: <process:JavaScript,decode,file:single variable>. \n5. [CoT]: The text states that after the victim fills in and sends the fake login form, they are redirected to a legitimate website, indicating that the fake login form (a process entity) redirects the victim (a user entity) to a legitimate website (a socket entity).   [Relationships]: <process:fake login form,redirect,user:victim>. \n6. [CoT]: The text mentions that the victim was redirected to a news item in the Israeli news website NRG, showing that the legitimate website (a process entity) redirects the victim (a user entity) to a news item (a socket entity).  [Relationships]: <process:legitimate website,redirect,user:victim>. ",
        "semantic_relationship": "[CoT]: The original relationship \"check\" implies that the malicious link is inspecting or reading the user agent string, which aligns with the system-level \"Receive\" relationship between a process and a socket. This indicates the process is receiving data from the socket (user agent string). [System-level Relationships]: <process:malicious link,Receive,socket:user agent>. \n[CoT]: The term \"serve\" in the original relationship implies that the malicious link process is executing or running the DuskySky process. In system-level terms, this corresponds to the \"Fork\" relationship between processes. [System-level Relationships]: <process:malicious link,Fork,process:DuskySky>. \n[CoT]: The original relationship \"serve\" implies that the malicious link process is displaying or loading the phishing page process, which in system-level terms translates to the \"Fork\" relationship between processes. This indicates that the malicious link process is executing the phishing page process to display it. [System-level Relationships]: <process:malicious link,Fork,process:phishing page>. \n[CoT]: The original relationship describes a process (JavaScript) decoding a file (single variable). In system-level terms, this action corresponds to the 'Read' operation, as the process is reading and interpreting the contents of the file to decode it. [System-level Relationships]: <process:JavaScript,Read,file:single variable>. \n[CoT]: The original relationship \"redirect\" indicates that the fake login form changes the user's connection to a legitimate website, which aligns with the system-level \"Connect\" relationship between a process and a socket. This reflects the action of redirecting network traffic to a new destination. [System-level Relationships]: <process:fake login form,Connect,socket:legitimate website>. \n[CoT]: The term \"redirect\" in the original relationship implies that the legitimate website is sending the victim's browser to a new URL, which corresponds to a \"Connect\" action between the process and the socket representing the new URL. [System-level Relationships]: <process:legitimate website,Connect,socket:news item URL>. "
    },
    {
        "phase": "execution",
        "content": "IP address 45.32.13.169 and all the domains that are pointing to it8 host a webpage which is a copy of a legitimate and unrelated software website - iMazing, an iOS management software. \nAmong the domains is a similar looking one - imazing[.]ga. \nThe source code of the fake website reveals that it was copied from the legitimate source on 22 October 2015: \nThe fake website, similarly to the legitimate one, offers visitors to download the iMazing software. However, the version on the fake website is bundled with DustySky malware. Upon execution of the malicious version (2f452e90c2f9b914543847ba2b431b9a) the legitimate iMazing is installed, while in the background DustySky is dropped as a file named Plugin.exe (1d9612a869ad929bd4dd16131ddb133a), and executed: \nPlugin.exe immediately starts communicating with its command and control sever using the hardcoded address ns.suppoit[.]xyz and supo.mefound[.]com, both also pointing to above mentioned 45.32.13.169. \nInterestingly, we found the fake domain imazing[.]ga mentioned in a job posting9 in the freelancers marketplace website freelancer.com. In the posting, the attackers claim they are looking for someone to build \"an application like that this website [sic]\" and entice the viewer to \"download application and take an overlook [sic]\" from imazing[.]ga and \"Let me know if any idea is missing or...\". \nThis behavior deviates from the attackers' usual pattern of sending malicious email to selected (albeit many) individuals. It is unclear to us why they would go after random infections, but we can imagine various reasons, such as access to computers which would be used as proxies for attacks, or access to licenses for software owned by the victims. ",
        "relationship": "1. [CoT]: The text states that the IP address 45.32.13.169 hosts a webpage which is a copy of a legitimate and unrelated software website, indicating a process-to-socket relationship where the process is the webpage hosting process.   [Relationships]: <process:webpage,hosts,socket:45.32.13.169>. \n2. [CoT]: The text mentions that among the domains is a similar looking one - imazing[.]ga, implying that the webpage is hosted on this domain, indicating a process-to-socket relationship where the process is the webpage hosting process.   [Relationships]: <process:webpage,hosts,socket:imazing[.]ga>. \n3. [CoT]: The text states that the fake website offers visitors to download the iMazing software, indicating a process-to-file relationship where the process is the fake website and the file is the malicious version of iMazing software.   [Relationships]: <process:fake website,offers file:iMazing software>. \n4. [CoT]: The text describes that the malicious version (2f452e90c2f9b914543847ba2b431b9a) is executed, indicating a process-to-file relationship where the process is the execution process.   [Relationships]: <process:execution process,executes file:2f452e90c2f9b914543847ba2b431b9a>. \n5. [CoT]: The text states that DustySky is dropped as a file named Plugin.exe, indicating a process-to-file relationship where the process is the DustySky process.   [Relationships]: <process:DustySky,drops file:Plugin.exe>. \n6. [CoT]: The text describes that Plugin.exe is executed, indicating a process-to-file relationship where the process is the execution process.   [Relationships]: <process:execution process,executes file:Plugin.exe>. \n7. [CoT]: The text states that Plugin.exe immediately starts communicating with its command and control sever using the hardcoded address ns.suppoit[.]xyz, indicating a process-to-socket relationship where the process is Plugin.exe.   [Relationships]: <process:Plugin.exe,communicates with,socket:ns.suppoit[.]xyz>. \n8. [CoT]: The text also mentions that Plugin.exe communicates with another command and control server at supo.mefound[.]com, indicating another process-to-socket relationship where the process is Plugin.exe. [Relationships]: <process:Plugin.exe,communicates with,socket:supo.mefound[.]com>. ",
        "semantic_relationship": "[CoT]: The original relationship states that the webpage \"hosts\" the socket (IP address 45.32.13.169), which implies that the webpage is receiving connections from this socket. In system-level terms, this translates to a \"Receive\" relationship between the process (webpage) and the socket, as the process is accepting connections from the socket. [System-level Relationships]: <process:webpage,Receive,socket:45.32.13.169>. \n[CoT]: The original relationship indicates that the webpage (process) \"hosts\" the domain (socket). In system-level terms, this means the webpage establishes a connection to the domain, which aligns with the \"Connect\" relationship between a process and a socket. This indicates the webpage is connecting to the domain's server. [System-level Relationships]: <process:webpage,Connect,socket:imazing[.]ga>. \n[CoT]: The original relationship \"offers file\" implies that the fake website is providing access to download the iMazing software file. In system-level terms, this translates to the process (fake website) executing the file (iMazing software) when the visitor downloads it. The \"Execute\" relationship is appropriate here as it represents the action of running or launching the file. [System-level Relationships]: <process:fake website,Execute,file:iMazing software>. \n[CoT]: The original relationship describes a process executing a file, which directly maps to the system-level 'Execute' relationship between a process and a file. [System-level Relationships]: <process:execution process,Execute,file:2f452e90c2f9b914543847ba2b431b9a>. \n[CoT]: The original relationship \"drops\" implies that the DustSky process is creating a new file (Plugin.exe) on the system, which aligns with the system-level relationship \"Create\" between a process and a file. [System-level Relationships]: <process:DustySky,Create,file:Plugin.exe>. \n[CoT]: The original relationship indicates that a process (execution process) executes a file (Plugin.exe). In the system-level relationships framework, this corresponds to the \"Execute\" relationship between a process and a file. [System-level Relationships]: <process:execution process,Execute,file:Plugin.exe>. \n[CoT]: The original relationship \"communicates with\" implies that Plugin.exe is establishing a connection to the specified socket (C2 server), which aligns with the system-level relationship \"Connect\" between a process and a socket. This indicates the process is initiating communication with the remote server. [System-level Relationships]: <process:Plugin.exe,Connect,socket:ns.suppoit[.]xyz>. \n[CoT]: The original relationship \"communicates with\" indicates a network connection between the process Plugin.exe and the socket supo.mefound[.]com. In system-level terms, this is best represented as a \"Connect\" relationship, as it describes the process establishing a connection to the remote socket. [System-level Relationships]: <process:Plugin.exe,Connect,socket:supo.mefound[.]com>. "
    },
    {
        "phase": "collection",
        "content": "This section describes the actions performed by the attackers on infected computers we have investigated. \nAfter infecting the computer, the attackers used both the capabilities of DustySky, and those of public hacking tools they had subsequently downloaded to the computer. \nThey took screenshots and a list of active processes in the computer, and sent them to their command and control severs. They used BrowserPasswordDump10, a public and free-to-use tool that recovers passwords saved in browsers. Below is the log file (empty in this case) that we recovered after the attackers had deleted it: \nThe malware would also scan the computer for files that contain certain keywords. The list of keywords, in base64 format, is retrieved from the command and control as a text file. For example: \nBelow are the encoded strings from the above image, decoded and translated: These words teach us what the attackers are after: personal documents; credentials, certificates and private keys; information pertaining to homeland security.",
        "relationship": "1. [CoT]: The text states that the attackers used DustySky's capabilities to take screenshots, indicating a process-to-file relationship where DustySky is the process and screenshots are the file. [Relationships]: <process:DustySky,used,file:screenshots>. \n2. [CoT]: The text mentions that attackers took a list of active processes, which is stored as a file, indicating a process-to-file relationship where DustySky is the process and the list of active processes is the file. [Relationships]: <process:DustySky,used,file:list of active processes>. \n3. [CoT]: The text states that the malware scans the computer for files with certain keywords, indicating a process-to-file relationship where malware is the process and files with keywords are the files. [Relationships]: <process:malware,scan,file:files with keywords>. \n4. [CoT]: The text mentions that the list of keywords is retrieved from the command and control as a text file, indicating a process-to-file relationship where command and control is the process and the text file with keywords is the file. [Relationships]: <process:command and control,retrieved,file:text file with keywords>. ",
        "semantic_relationship": "[CoT]: The original relationship states that DustySky \"used\" screenshots, which implies that the process accessed the file to take screenshots. In system-level terms, this corresponds to a \"Read\" operation since the process is reading the screen capture data from the file. [System-level Relationships]: <process:DustySky,Read,file:screenshots>. \n[CoT]: The original relationship \"used\" implies that the process DustySky accessed the file \"list of active processes\". In system-level terms, this typically translates to a \"Read\" operation since the process is reading the file's contents. [System-level Relationships]: <process:DustySky,Read,file:list of active processes>. \n[CoT]: The term \"scan\" implies that the malware is reading the contents of the files to check for keywords, which corresponds to the \"Read\" operation in the system-level relationships framework. [System-level Relationships]: <process:malware,Read,file:files with keywords>. \n[CoT]: The original relationship states that the command and control process \"retrieved\" the text file with keywords. In system-level terms, this action implies that the process read the file to retrieve the contents, hence the relationship is converted to \"Read\". [System-level Relationships]: <process:command and control,Read,file:text file with keywords>. "
    },
    {
        "phase": "initial access",
        "content": "In one case, the attackers used stolen email credentials and logged in from 96.44.156.201, potentially their proxy or VPN endpoint. They also logged in from 5.101.140.118 , an IP address that belongs to a proxy service called privatetunnel.com (in previous incidents, emails were sent from a nearby address - 5.101.140.114). ",
        "relationship": "1. [CoT]: The text mentions that the attackers logged in from 96.44.156.201, indicating a process (attackers) interacting with a socket (IP address). [Relationships]: <process:attackers,logged in from,socket:96.44.156.201>. \n2. [CoT]: The text states that the attackers logged in from 5.101.140.118, showing another interaction between the processes (attackers) and the socket (IP address). [Relationships]: <process:attackers,logged in from,socket:5.101.140.118>. \n3. [CoT]: The text implies that the IP address 5.101.140.118 belongs to the proxy service privatetunnel.com, indicating a relationship between the socket and the process (proxy service). [Relationships]: <socket:5.101.140.118,belongs to,process:privatetunnel.com>. ",
        "semantic_relationship": "[CoT]: The original relationship \"logged in from\" implies that the process attackers established a connection to the socket (IP address 96.44.156.201). In system-level terms, this corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:attackers,Connect,socket:96.44.156.201>. \n[CoT]: The original relationship \"logged in from\" indicates that the attackers established a connection to the socket (IP address). In system-level terms, this corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:attackers,Connect,socket:5.101.140.118>. \n[CoT]: The original relationship states that the socket belongs to the process, which in system-level terms translates to the socket being a child process of the proxy service. The 'Fork' relationship is used here as it indicates the socket is created or owned by the process. [System-level Relationships]: <socket:5.101.140.118,Fork,process:privatetunnel.com>. "
    },
    {
        "phase": "defense evasion",
        "content": "The DustySky dropper tries to evade running in a virtual machine. Once sure the computer is not a VM, it extracts, runs and adds persistency to DustySky Core. It extracts basic information about the operating system and checks for the existence of an Antivirus. It also extracts and opens the lure document. \nThe dropper's resources are two components that are dropped at run time. One is the lure document (internally called \"news\"), which is presented to the victim once the dropper is executed. The other is DustySky Core, a Trojan backdoor, (internally called ${}^{\\prime\\prime}|0g^{\\prime\\prime}|$ ). \nThe dropper uses the following function to obfuscate the name of functions and other parts of the malware (In later versions, SmartAssembly 6.9.0.114 .NET obfuscator was used): \nFor VM evasion the dropper checks whether there is a DLL that indicate that the malware is running in a virtual machine (vboxmrxnp.dll and vmbusres.dll which indicate vitualbox and vmGuestlib.dll which indicates vmware). \nIf the dropper is indeed running in a virtual machine, it will open the lure document and stop its activity: \nThe dropper uses Windows Management Instrumentation11 to extract information about the operating system and whether an antivirus is active. \nDustySky Core is dropped to $\\%T E M P\\%$ and runs using either cmd or the .NET interface. \nA registry entry is created for persistency after computer restart: ",
        "relationship": "1. [CoT]: The text states that the DustySky dropper extracts the lure document (\"news\") once it is executed, indicating a process-to-file relationship. [Relationships]: <process:DustySky dropper,extracts,file:news>. \n2. [CoT]: The text mentions that the dropper drops DustySky Core ($^{\\prime\\prime}|0g^{\\prime\\prime}|$) at runtime, indicating another process-to-file relationship. [Relationships]: <process:DustySky dropper,drops,file:DustySky Core>. \n3. [CoT]: The dropper uses Windows Management Instrumentation11 to extract information about the operating system, indicating a process-to-process relationship. [Relationships]: <process:DustySky dropper,uses,process:Windows Management Instrumentation11>. \n4. [CoT]: The dropper drops DustySky Core to %T E M P%, indicating a process-to-file relationship. [Relationships]: <process:DustySky dropper,drops,file:%T E M P%\\\\DustySky Core>. \n5. [CoT]: The text mentions that DustySky Core runs using either cmd or the .NET interface, indicating a process-to-process relationship. [Relationships]: <process:.NET interface,runs,process:DustySky Core>. \n6. [CoT]: The text states that a registry entry is created for persistency after computer restart, indicating a process-to-registry relationship. [Relationships]: <process:DustySky dropper,creates,reg:registry entry>. ",
        "semantic_relationship": "[CoT]: The term \"extracts\" in the original relationship implies that the DustySky dropper process is reading data from the file \"news\". In system-level terms, this corresponds to a \"Read\" operation between a process and a file. [System-level Relationships]: <process:DustySky dropper,Read,file:news>. \n[CoT]: The term \"drops\" in the original relationship implies that the dropper process is creating a new file (DustySky Core) at runtime. In system-level terms, this corresponds to a \"Create\" action between a process and a file. [System-level Relationships]: <process:DustySky dropper,Create,file:DustySky Core>. \n[CoT]: The original relationship \"uses\" indicates that the DustySky dropper process is leveraging Windows Management Instrumentation (WMI) to extract information. In system-level terms, this implies the dropper is executing or running the WMI process to perform its actions, hence the \"Fork\" relationship. [System-level Relationships]: <process:DustySky dropper,Fork,process:Windows Management Instrumentation11>. \n[CoT]: The original relationship \"drops\" implies that the dropper process is writing the DustySky Core file to the specified location, which corresponds to the system-level \"Write\" relationship between a process and a file. [System-level Relationships]: <process:DustySky dropper,Write,file:%T E M P%\\\\DustySky Core>. \n[CoT]: The original relationship \"runs\" indicates that the .NET interface is executing the DustySky Core process, which aligns with the system-level \"Fork\" relationship where one process executes another. [System-level Relationships]: <process:.NET interface,Fork,process:DustySky Core>. \n[CoT]: The original relationship states that the DustySky dropper process creates a registry entry. In system-level terms, creating a registry entry is mapped to the \"Createkey\" relationship between a process and a registry key. [System-level Relationships]: <process:DustySky dropper,Createkey,reg:registry entry>. "
    },
    {
        "phase": "command and control",
        "content": "DustySky Core is a Trojan backdoor and the main component of the malware. It communicates with the command and control server, exfiltrates collected data, information and files, and receives and executes commands.  It has the following capabilities: \nCollecting information about the OS version, running processes and installed software.   \n Searching for removable media and network drives, and duplicating itself into them.   \n Extracting other components (such as the keylogging component) or receiving them from the command and control server, and running or removing them. Evading virtual machines. Turning the computer off or restarting it. Making sure only a single instance of the malware is running. \nThe keylogging log file is uploaded to the server every 50 seconds. The files are uploaded via a POST request to a URL that ends with key.php. ",
        "relationship": "1. [CoT]: DustySky Core is a process that communicates with the command and control server (socket) to upload files. [Relationships]: <process:DustySky Core,upload,file:key.php>. \n2. [CoT]: DustySky Core receives and executes other components (file) from the command and control server. [Relationships]: <process:DustySky Core,receive,file:other components>. \n3. [CoT]: DustySky Core duplicates itself (file) into removable media and network drives. [Relationships]: <process:DustySky Core,duplicate,file:self>. \n4. [CoT]: The malware makes sure only a single instance of itself (process DustySky Core) is running. [Relationships]: <process:malware,ensure,process:DustySky Core>. \n5. [CoT]: The keylogging component (process) is extracted by DustySky Core or received from the command and control server. [Relationships]: <process:DustySky Core,extract,process:keylogging component>. \n6. [CoT]: The keylogging component logs data (file) to a log file. [Relationships]: <process:keylogging component,log,file:log file>. \n7. [CoT]: The keylogging log file (file) is uploaded to the server via a POST request to URL key.php. [Relationships]: <process:DustySky Core,upload,file:key.php>. ",
        "semantic_relationship": "[CoT]: The original relationship \"upload\" indicates that the process DustySky Core is sending data to the file key.php, which is acting as a socket to communicate with the command and control server. In system-level terms, this \"upload\" action corresponds to the \"Send\" relationship between a process and a socket. [System-level Relationships]: <process:DustySky Core,Send,socket:key.php>. \n[CoT]: The original relationship \"receive\" implies that DustySky Core reads data from the file received from the command and control server. In system-level terms, this corresponds to a \"Read\" operation between a process and a file. [System-level Relationships]: <process:DustySky Core,Read,file:other components>. \n[CoT]: The original relationship states that DustySky Core duplicates itself (file) into removable media and network drives. Therefore, the action involves writing the process's own file to another location, which maps to the 'Write' relationship between a process and a file in the system-level framework. [System-level Relationships]: <process:DustySky Core,Write,file:self>. \n[CoT]: The original relationship \"ensure\" means the malware enforces the single-instance rule, which typically involves terminating any existing instances of \"DustySky Core\". Therefore, the system-level relationship is \"Exit\" as the malware exits the \"DustySky Core\" process. [System-level Relationships]: <process:malware,Exit,process:DustySky Core>. \n[CoT]: The term \"extract\" in the original relationship implies that the DustySky Core process is injecting code into or reading data from the keylogging component process. In system-level terms, this aligns with the \"Inject\" relationship between processes. [System-level Relationships]: <process:DustySky Core,Inject,process:keylogging component>. \n[CoT]: The original relationship \"log\" implies that the keylogging component is writing data to the log file, which corresponds to the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:keylogging component,Write,file:log file>. \n[CoT]: The original relationship \"upload\" indicates that the process DustySky Core is writing data to the file key.php, which corresponds to the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:DustySky Core,Write,file:key.php>. "
    },
    {
        "phase": "collection",
        "content": "One of the components contained in DustySky core is a keylogger (for example   \n15be036680c41f97dfac9201a7c51cfc). When ordered by the command and control server, the keylogger is extracted and executed. Keylogging logs are saved to %TEMP%\\temps . ",
        "relationship": "1. [CoT]: The text states that the keylogger saves logs to a file path '%TEMP%\\temps', indicating a process-to-file relationship where the process 'keylogger' performs the action 'saves' on the file '%TEMP%\\temps'.   [Relationships]: <process:keylogger,saves,file:%TEMP%\\temps>. ",
        "semantic_relationship": "[CoT]: The original relationship 'saves' implies that the keylogger is writing data to the file '%TEMP%\\temps'. In system-level terms, this corresponds to a 'Write' operation from a process to a file. [System-level Relationships]: <process:keylogger,Write,file:%TEMP%\\temps>. "
    },
    {
        "phase": "command and control",
        "content": "Following are samples of communication with the command and control server (identifiers have been altered). \nDustySky has two hardcoded domains of command and control servers. It starts by checking if the first one is alive by sending a GET request to TEST.php or index.php, expecting ${}^{\\prime\\prime}{\\mathsf{O K}}^{\\prime\\prime}$ as response. If it does not receive an OK, it will try a second domain.\nRecently, command and control communication changed from HTTP to HTTPS. The digital certificate used in the HTTPS traffic is either self-signed or uses a legitimate Comodo issued certificate. \nThe domain bulk-smtp[.]xyz, which is owned by the attackers, uses the following digital certificate: \nPrior to using the Comodo issued certificate, the attackers used a self-signed certificate, impersonating a TelAviv, Israel based company called EMS. The organizational unity in the certificate is \"Email Markting Sales\" (note the misspelling of \"marketing\"). \nFor another domain, smtp.gq, this self-signed certificate was used:\nDustySky communication uses some or all of the following paths when communicating with its command and control server: \nUpdate.php conn.php geoiploc.php news.htm pass.php passho.php passyah.php ",
        "relationship": "1. [CoT]: DustySky checks if the first hardcoded domain is alive by sending a GET request to TEST.php or index.php, indicating a process-to-socket relationship. [Relationships]: <process:DustySky, sending, socket:TEST.php or index.php>. \n2. [CoT]: DustySky tries a second domain if the first one does not respond, showing another process-to-socket interaction. [Relationships]: <process:DustySky, sending, socket:second domain>. \n3. [CoT]: DustySky uses HTTPS for command and control communication, indicating a process-to-socket relationship. [Relationships]: <process:DustySky, using, socket:HTTPS traffic>. \n4. [CoT]: The domain bulk-smtp[.]xyz uses a digital certificate, showing a process-to-socket relationship. [Relationships]: <process:bulk-smtp[.]xyz, using, socket:digital certificate>. \n5. [CoT]: The attackers used a self-signed certificate impersonating EMS, indicating a process-to-socket relationship. [Relationships]: <process:attackers, using, socket:self-signed certificate>. \n6. [CoT]: DustySky uses various paths when communicating, showing process-to-socket relationships. [Relationships]: <process:DustySky, using, socket:Update.php>, <process:DustySky, using, socket:conn.php>, <process:DustySky, using, socket:geoiploc.php>, <process:DustySky, using, socket:news.htm>, <process:DustySky, using, socket:pass.php>, <process:DustySky, using, socket:passho.php>, <process:DustySky, using, socket:passyah.php>. ",
        "semantic_relationship": "[CoT]: The original relationship describes DustySky sending a GET request to a domain (TEST.php or index.php), which implies a connection attempt to a socket (domain). In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:DustySky,Connect,socket:TEST.php or index.php>. \n[CoT]: The original relationship indicates that the process 'DustySky' is sending data to a socket (second domain). In system-level terms, this corresponds to a 'Send' action from a process to a socket. [System-level Relationships]: <process:DustySky,Send,socket:second domain>. \n[CoT]: The original relationship states that DustySky \"uses\" HTTPS traffic, which implies establishing a connection to a remote socket for command and control communication. In system-level terms, this corresponds to a \"Connect\" relationship between the process and the socket. [System-level Relationships]: <process:DustySky,Connect,socket:HTTPS traffic>. \n[CoT]: The original relationship indicates that the process is \"using\" a socket (digital certificate). In system-level terms, this corresponds to the process establishing a connection to the socket, hence the \"Connect\" relationship. The digital certificate is treated as a socket in this context since it involves a network connection. [System-level Relationships]: <process:bulk-smtp[.]xyz,Connect,socket:digital certificate>. \n[CoT]: The original relationship indicates the attackers are using a self-signed certificate, which implies establishing a connection to a socket (the certificate represents an endpoint). In system-level terms, this maps to a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:attackers,Connect,socket:self-signed certificate>. \n[CoT]: The original relationships indicate that DustySky is using various sockets to communicate. In system-level terms, this corresponds to a process establishing a connection to a socket, hence the 'Connect' relationship. [System-level Relationships]: <process:DustySky,Connect,socket:Update.php>, <process:DustySky,Connect,socket:conn.php>, <process:DustySky,Connect,socket:geoiploc.php>, <process:DustySky,Connect,socket:news.htm>, <process:DustySky,Connect,socket:pass.php>, <process:DustySky,Connect,socket:passho.php>, <process:DustySky,Connect,socket:passyah.php>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the attackers send a malicious email with a link to an archive file (RAR or ZIP compressed), indicating a process (the email client) interacting with a socket (the URL link).   [Original Relationships]: <process:email client,links,socket:URL link>. ",
                "semantic_relationship": "[CoT]: The original relationship \"links\" indicates that the email client process is interacting with the URL link, which represents a network connection. In system-level terms, this interaction corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:email client,Connect,socket:URL link>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that the malicious email has an attached archive file, showing a process (the email client) interacting with a file (the attached archive file).   [Original Relationships]: <process:email client,has,file:attached archive file>. ",
                "semantic_relationship": "[CoT]: The original relationship \"has\" indicates that the email client process is interacting with the attached archive file, which in system-level terms translates to the \"Read\" relationship, as the process is reading the file contents. [System-level Relationships]: <process:email client,Read,file:attached archive file>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text describes that the archive contains an .exe file, another interaction between a process (the email client) and a file (the .exe file).   [Original Relationships]: <process:email client,contains,file:.exe file>. ",
                "semantic_relationship": "[CoT]: The original relationship \"contains\" between a process and a file typically implies that the process is executing the file, which aligns with the system-level relationship \"Execute\" in the Process-to-File category. [System-level Relationships]: <process:email client,Execute,file:.exe file>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the victim clicks the .exe file, indicating a process-to-file relationship where the process is the victim's action and the .exe file is the target file.   [Original Relationships]: <process:victim,clicks,file:.exe>. ",
                "semantic_relationship": "[CoT]: The action \"clicks\" in the original relationship implies that the victim's process is executing the .exe file, which aligns with the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:victim,Execute,file:.exe>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that Microsoft Word files are used with malicious macros, implying that the victim's system (process) executes the Microsoft Word files.   [Original Relationships]: <process:victim,executes,file:Microsoft Word files>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the victim's process executes Microsoft Word files, which directly translates to the system-level relationship \"Execute\" between a process and a file. This aligns with the defined system-level relationships where a process can execute a file. [System-level Relationships]: <process:victim,Execute,file:Microsoft Word files>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text describes that the malware would be hosted on a cloud service (copy.com) or an attacker-controlled server, indicating that the victim's system (process) connects to these hosting locations (socket).   [Original Relationships]: <process:victim,connects,socket:cloud service or server>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (victim) connecting to a socket (cloud service or server). In system-level terms, this maps directly to the 'Connect' relationship between a process and a socket, as it involves establishing a network connection. [System-level Relationships]: <process:victim,Connect,socket:cloud service or server>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the malware is hosted on a cloud service (copy.com), which is a domain name, establishing a process-to-socket relationship where the process is the victim's action and the socket is the domain name.   [Original Relationships]: <process:victim,connects,socket:copy.com>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the victim's process connecting to a socket (domain name), which aligns with the system-level 'Connect' relationship between a process and a socket. The term 'connects' in the original relationship is directly mapped to 'Connect' in the system-level framework. [System-level Relationships]: <process:victim,Connect,socket:copy.com>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that the malware would be hosted on a server controlled by the attackers, which is a domain name or IP address, indicating a process-to-socket relationship where the process is the victim's action and the socket is the server location. [Original Relationships]: <process:victim,connects,socket:server controlled by the attackers>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (victim) connecting to a socket (server controlled by attackers). In system-level terms, this corresponds to a 'Connect' relationship between a process and a socket, as it involves establishing a connection to a remote server. [System-level Relationships]: <process:victim,Connect,socket:server controlled by the attackers>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the User-Agent string of the target's browser is checked when they click the malicious link, indicating that the user agent (a string entity) is checked by the malicious link (a socket entity).   [Original Relationships]: <process:malicious link,check,socket:user agent>. ",
                "semantic_relationship": "[CoT]: The original relationship \"check\" implies that the malicious link is inspecting or reading the user agent string, which aligns with the system-level \"Receive\" relationship between a process and a socket. This indicates the process is receiving data from the socket (user agent string). [System-level Relationships]: <process:malicious link,Receive,socket:user agent>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that if the target is using Windows, DuskySky is served, showing that the malicious link (a process entity) serves the DuskySky (a process entity).   [Original Relationships]: <process:malicious link,serve,process:DuskySky>. ",
                "semantic_relationship": "[CoT]: The term \"serve\" in the original relationship implies that the malicious link process is executing or running the DuskySky process. In system-level terms, this corresponds to the \"Fork\" relationship between processes. [System-level Relationships]: <process:malicious link,Fork,process:DuskySky>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that if the operating system is different than Windows, the target is served a Google, Microsoft, or Yahoo phishing page, indicating that the malicious link (a process entity) serves a Google, Microsoft, or Yahoo phishing page (a process entity).   [Original Relationships]: <process:malicious link,serve,process:phishing page>. ",
                "semantic_relationship": "[CoT]: The original relationship \"serve\" implies that the malicious link process is displaying or loading the phishing page process, which in system-level terms translates to the \"Fork\" relationship between processes. This indicates that the malicious link process is executing the phishing page process to display it. [System-level Relationships]: <process:malicious link,Fork,process:phishing page>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text describes that the source code of the phishing page is made up of a single JavaScript block, which at runtime decodes a single variable into HTML, showing that the JavaScript (a process entity) decodes a single variable (a file entity) into HTML (a file entity).   [Original Relationships]: <process:JavaScript,decode,file:single variable>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (JavaScript) decoding a file (single variable). In system-level terms, this action corresponds to the 'Read' operation, as the process is reading and interpreting the contents of the file to decode it. [System-level Relationships]: <process:JavaScript,Read,file:single variable>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that after the victim fills in and sends the fake login form, they are redirected to a legitimate website, indicating that the fake login form (a process entity) redirects the victim (a user entity) to a legitimate website (a socket entity).   [Original Relationships]: <process:fake login form,redirect,user:victim>. ",
                "semantic_relationship": "[CoT]: The original relationship \"redirect\" indicates that the fake login form changes the user's connection to a legitimate website, which aligns with the system-level \"Connect\" relationship between a process and a socket. This reflects the action of redirecting network traffic to a new destination. [System-level Relationships]: <process:fake login form,Connect,socket:legitimate website>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that the victim was redirected to a news item in the Israeli news website NRG, showing that the legitimate website (a process entity) redirects the victim (a user entity) to a news item (a socket entity).  [Original Relationships]: <process:legitimate website,redirect,user:victim>. ",
                "semantic_relationship": "[CoT]: The term \"redirect\" in the original relationship implies that the legitimate website is sending the victim's browser to a new URL, which corresponds to a \"Connect\" action between the process and the socket representing the new URL. [System-level Relationships]: <process:legitimate website,Connect,socket:news item URL>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the IP address 45.32.13.169 hosts a webpage which is a copy of a legitimate and unrelated software website, indicating a process-to-socket relationship where the process is the webpage hosting process.   [Original Relationships]: <process:webpage,hosts,socket:45.32.13.169>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the webpage \"hosts\" the socket (IP address 45.32.13.169), which implies that the webpage is receiving connections from this socket. In system-level terms, this translates to a \"Receive\" relationship between the process (webpage) and the socket, as the process is accepting connections from the socket. [System-level Relationships]: <process:webpage,Receive,socket:45.32.13.169>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that among the domains is a similar looking one - imazing[.]ga, implying that the webpage is hosted on this domain, indicating a process-to-socket relationship where the process is the webpage hosting process.   [Original Relationships]: <process:webpage,hosts,socket:imazing[.]ga>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the webpage (process) \"hosts\" the domain (socket). In system-level terms, this means the webpage establishes a connection to the domain, which aligns with the \"Connect\" relationship between a process and a socket. This indicates the webpage is connecting to the domain's server. [System-level Relationships]: <process:webpage,Connect,socket:imazing[.]ga>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the fake website offers visitors to download the iMazing software, indicating a process-to-file relationship where the process is the fake website and the file is the malicious version of iMazing software.   [Original Relationships]: <process:fake website,offers file:iMazing software>. ",
                "semantic_relationship": "[CoT]: The original relationship \"offers file\" implies that the fake website is providing access to download the iMazing software file. In system-level terms, this translates to the process (fake website) executing the file (iMazing software) when the visitor downloads it. The \"Execute\" relationship is appropriate here as it represents the action of running or launching the file. [System-level Relationships]: <process:fake website,Execute,file:iMazing software>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes that the malicious version (2f452e90c2f9b914543847ba2b431b9a) is executed, indicating a process-to-file relationship where the process is the execution process.   [Original Relationships]: <process:execution process,executes file:2f452e90c2f9b914543847ba2b431b9a>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process executing a file, which directly maps to the system-level 'Execute' relationship between a process and a file. [System-level Relationships]: <process:execution process,Execute,file:2f452e90c2f9b914543847ba2b431b9a>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that DustySky is dropped as a file named Plugin.exe, indicating a process-to-file relationship where the process is the DustySky process.   [Original Relationships]: <process:DustySky,drops file:Plugin.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship \"drops\" implies that the DustSky process is creating a new file (Plugin.exe) on the system, which aligns with the system-level relationship \"Create\" between a process and a file. [System-level Relationships]: <process:DustySky,Create,file:Plugin.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes that Plugin.exe is executed, indicating a process-to-file relationship where the process is the execution process.   [Original Relationships]: <process:execution process,executes file:Plugin.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that a process (execution process) executes a file (Plugin.exe). In the system-level relationships framework, this corresponds to the \"Execute\" relationship between a process and a file. [System-level Relationships]: <process:execution process,Execute,file:Plugin.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that Plugin.exe immediately starts communicating with its command and control sever using the hardcoded address ns.suppoit[.]xyz, indicating a process-to-socket relationship where the process is Plugin.exe.   [Original Relationships]: <process:Plugin.exe,communicates with,socket:ns.suppoit[.]xyz>. ",
                "semantic_relationship": "[CoT]: The original relationship \"communicates with\" implies that Plugin.exe is establishing a connection to the specified socket (C2 server), which aligns with the system-level relationship \"Connect\" between a process and a socket. This indicates the process is initiating communication with the remote server. [System-level Relationships]: <process:Plugin.exe,Connect,socket:ns.suppoit[.]xyz>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text also mentions that Plugin.exe communicates with another command and control server at supo.mefound[.]com, indicating another process-to-socket relationship where the process is Plugin.exe. [Original Relationships]: <process:Plugin.exe,communicates with,socket:supo.mefound[.]com>. ",
                "semantic_relationship": "[CoT]: The original relationship \"communicates with\" indicates a network connection between the process Plugin.exe and the socket supo.mefound[.]com. In system-level terms, this is best represented as a \"Connect\" relationship, as it describes the process establishing a connection to the remote socket. [System-level Relationships]: <process:Plugin.exe,Connect,socket:supo.mefound[.]com>. "
            },
            {
                "phase": "collection",
                "relationship": "[Description]: The text states that the attackers used DustySky's capabilities to take screenshots, indicating a process-to-file relationship where DustySky is the process and screenshots are the file. [Original Relationships]: <process:DustySky,used,file:screenshots>. ",
                "semantic_relationship": "[CoT]: The original relationship states that DustySky \"used\" screenshots, which implies that the process accessed the file to take screenshots. In system-level terms, this corresponds to a \"Read\" operation since the process is reading the screen capture data from the file. [System-level Relationships]: <process:DustySky,Read,file:screenshots>. "
            },
            {
                "phase": "collection",
                "relationship": "[Description]: The text mentions that attackers took a list of active processes, which is stored as a file, indicating a process-to-file relationship where DustySky is the process and the list of active processes is the file. [Original Relationships]: <process:DustySky,used,file:list of active processes>. ",
                "semantic_relationship": "[CoT]: The original relationship \"used\" implies that the process DustySky accessed the file \"list of active processes\". In system-level terms, this typically translates to a \"Read\" operation since the process is reading the file's contents. [System-level Relationships]: <process:DustySky,Read,file:list of active processes>. "
            },
            {
                "phase": "collection",
                "relationship": "[Description]: The text states that the malware scans the computer for files with certain keywords, indicating a process-to-file relationship where malware is the process and files with keywords are the files. [Original Relationships]: <process:malware,scan,file:files with keywords>. ",
                "semantic_relationship": "[CoT]: The term \"scan\" implies that the malware is reading the contents of the files to check for keywords, which corresponds to the \"Read\" operation in the system-level relationships framework. [System-level Relationships]: <process:malware,Read,file:files with keywords>. "
            },
            {
                "phase": "collection",
                "relationship": "[Description]: The text mentions that the list of keywords is retrieved from the command and control as a text file, indicating a process-to-file relationship where command and control is the process and the text file with keywords is the file. [Original Relationships]: <process:command and control,retrieved,file:text file with keywords>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the command and control process \"retrieved\" the text file with keywords. In system-level terms, this action implies that the process read the file to retrieve the contents, hence the relationship is converted to \"Read\". [System-level Relationships]: <process:command and control,Read,file:text file with keywords>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that the attackers logged in from 96.44.156.201, indicating a process (attackers) interacting with a socket (IP address). [Original Relationships]: <process:attackers,logged in from,socket:96.44.156.201>. ",
                "semantic_relationship": "[CoT]: The original relationship \"logged in from\" implies that the process attackers established a connection to the socket (IP address 96.44.156.201). In system-level terms, this corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:attackers,Connect,socket:96.44.156.201>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the attackers logged in from 5.101.140.118, showing another interaction between the processes (attackers) and the socket (IP address). [Original Relationships]: <process:attackers,logged in from,socket:5.101.140.118>. ",
                "semantic_relationship": "[CoT]: The original relationship \"logged in from\" indicates that the attackers established a connection to the socket (IP address). In system-level terms, this corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:attackers,Connect,socket:5.101.140.118>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The text states that the DustySky dropper extracts the lure document (\"news\") once it is executed, indicating a process-to-file relationship. [Original Relationships]: <process:DustySky dropper,extracts,file:news>. ",
                "semantic_relationship": "[CoT]: The term \"extracts\" in the original relationship implies that the DustySky dropper process is reading data from the file \"news\". In system-level terms, this corresponds to a \"Read\" operation between a process and a file. [System-level Relationships]: <process:DustySky dropper,Read,file:news>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The text mentions that the dropper drops DustySky Core ($^{\\prime\\prime}|0g^{\\prime\\prime}|$) at runtime, indicating another process-to-file relationship. [Original Relationships]: <process:DustySky dropper,drops,file:DustySky Core>. ",
                "semantic_relationship": "[CoT]: The term \"drops\" in the original relationship implies that the dropper process is creating a new file (DustySky Core) at runtime. In system-level terms, this corresponds to a \"Create\" action between a process and a file. [System-level Relationships]: <process:DustySky dropper,Create,file:DustySky Core>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The dropper uses Windows Management Instrumentation11 to extract information about the operating system, indicating a process-to-process relationship. [Original Relationships]: <process:DustySky dropper,uses,process:Windows Management Instrumentation11>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uses\" indicates that the DustySky dropper process is leveraging Windows Management Instrumentation (WMI) to extract information. In system-level terms, this implies the dropper is executing or running the WMI process to perform its actions, hence the \"Fork\" relationship. [System-level Relationships]: <process:DustySky dropper,Fork,process:Windows Management Instrumentation11>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The dropper drops DustySky Core to %T E M P%, indicating a process-to-file relationship. [Original Relationships]: <process:DustySky dropper,drops,file:%T E M P%\\\\DustySky Core>. ",
                "semantic_relationship": "[CoT]: The original relationship \"drops\" implies that the dropper process is writing the DustySky Core file to the specified location, which corresponds to the system-level \"Write\" relationship between a process and a file. [System-level Relationships]: <process:DustySky dropper,Write,file:%T E M P%\\\\DustySky Core>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The text mentions that DustySky Core runs using either cmd or the .NET interface, indicating a process-to-process relationship. [Original Relationships]: <process:.NET interface,runs,process:DustySky Core>. ",
                "semantic_relationship": "[CoT]: The original relationship \"runs\" indicates that the .NET interface is executing the DustySky Core process, which aligns with the system-level \"Fork\" relationship where one process executes another. [System-level Relationships]: <process:.NET interface,Fork,process:DustySky Core>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The text states that a registry entry is created for persistency after computer restart, indicating a process-to-registry relationship. [Original Relationships]: <process:DustySky dropper,creates,reg:registry entry>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the DustySky dropper process creates a registry entry. In system-level terms, creating a registry entry is mapped to the \"Createkey\" relationship between a process and a registry key. [System-level Relationships]: <process:DustySky dropper,Createkey,reg:registry entry>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: DustySky Core is a process that communicates with the command and control server (socket) to upload files. [Original Relationships]: <process:DustySky Core,upload,file:key.php>. ",
                "semantic_relationship": "[CoT]: The original relationship \"upload\" indicates that the process DustySky Core is sending data to the file key.php, which is acting as a socket to communicate with the command and control server. In system-level terms, this \"upload\" action corresponds to the \"Send\" relationship between a process and a socket. [System-level Relationships]: <process:DustySky Core,Send,socket:key.php>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: DustySky Core receives and executes other components (file) from the command and control server. [Original Relationships]: <process:DustySky Core,receive,file:other components>. ",
                "semantic_relationship": "[CoT]: The original relationship \"receive\" implies that DustySky Core reads data from the file received from the command and control server. In system-level terms, this corresponds to a \"Read\" operation between a process and a file. [System-level Relationships]: <process:DustySky Core,Read,file:other components>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: DustySky Core duplicates itself (file) into removable media and network drives. [Original Relationships]: <process:DustySky Core,duplicate,file:self>. ",
                "semantic_relationship": "[CoT]: The original relationship states that DustySky Core duplicates itself (file) into removable media and network drives. Therefore, the action involves writing the process's own file to another location, which maps to the 'Write' relationship between a process and a file in the system-level framework. [System-level Relationships]: <process:DustySky Core,Write,file:self>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware makes sure only a single instance of itself (process DustySky Core) is running. [Original Relationships]: <process:malware,ensure,process:DustySky Core>. ",
                "semantic_relationship": "[CoT]: The original relationship \"ensure\" means the malware enforces the single-instance rule, which typically involves terminating any existing instances of \"DustySky Core\". Therefore, the system-level relationship is \"Exit\" as the malware exits the \"DustySky Core\" process. [System-level Relationships]: <process:malware,Exit,process:DustySky Core>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The keylogging component (process) is extracted by DustySky Core or received from the command and control server. [Original Relationships]: <process:DustySky Core,extract,process:keylogging component>. ",
                "semantic_relationship": "[CoT]: The term \"extract\" in the original relationship implies that the DustySky Core process is injecting code into or reading data from the keylogging component process. In system-level terms, this aligns with the \"Inject\" relationship between processes. [System-level Relationships]: <process:DustySky Core,Inject,process:keylogging component>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The keylogging component logs data (file) to a log file. [Original Relationships]: <process:keylogging component,log,file:log file>. ",
                "semantic_relationship": "[CoT]: The original relationship \"log\" implies that the keylogging component is writing data to the log file, which corresponds to the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:keylogging component,Write,file:log file>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The keylogging log file (file) is uploaded to the server via a POST request to URL key.php. [Original Relationships]: <process:DustySky Core,upload,file:key.php>. ",
                "semantic_relationship": "[CoT]: The original relationship \"upload\" indicates that the process DustySky Core is writing data to the file key.php, which corresponds to the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:DustySky Core,Write,file:key.php>. "
            },
            {
                "phase": "collection",
                "relationship": "[Description]: The text states that the keylogger saves logs to a file path '%TEMP%\\temps', indicating a process-to-file relationship where the process 'keylogger' performs the action 'saves' on the file '%TEMP%\\temps'.   [Original Relationships]: <process:keylogger,saves,file:%TEMP%\\temps>. ",
                "semantic_relationship": "[CoT]: The original relationship 'saves' implies that the keylogger is writing data to the file '%TEMP%\\temps'. In system-level terms, this corresponds to a 'Write' operation from a process to a file. [System-level Relationships]: <process:keylogger,Write,file:%TEMP%\\temps>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: DustySky checks if the first hardcoded domain is alive by sending a GET request to TEST.php or index.php, indicating a process-to-socket relationship. [Original Relationships]: <process:DustySky, sending, socket:TEST.php or index.php>. ",
                "semantic_relationship": "[CoT]: The original relationship describes DustySky sending a GET request to a domain (TEST.php or index.php), which implies a connection attempt to a socket (domain). In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:DustySky,Connect,socket:TEST.php or index.php>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: DustySky tries a second domain if the first one does not respond, showing another process-to-socket interaction. [Original Relationships]: <process:DustySky, sending, socket:second domain>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the process 'DustySky' is sending data to a socket (second domain). In system-level terms, this corresponds to a 'Send' action from a process to a socket. [System-level Relationships]: <process:DustySky,Send,socket:second domain>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: DustySky uses HTTPS for command and control communication, indicating a process-to-socket relationship. [Original Relationships]: <process:DustySky, using, socket:HTTPS traffic>. ",
                "semantic_relationship": "[CoT]: The original relationship states that DustySky \"uses\" HTTPS traffic, which implies establishing a connection to a remote socket for command and control communication. In system-level terms, this corresponds to a \"Connect\" relationship between the process and the socket. [System-level Relationships]: <process:DustySky,Connect,socket:HTTPS traffic>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The domain bulk-smtp[.]xyz uses a digital certificate, showing a process-to-socket relationship. [Original Relationships]: <process:bulk-smtp[.]xyz, using, socket:digital certificate>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the process is \"using\" a socket (digital certificate). In system-level terms, this corresponds to the process establishing a connection to the socket, hence the \"Connect\" relationship. The digital certificate is treated as a socket in this context since it involves a network connection. [System-level Relationships]: <process:bulk-smtp[.]xyz,Connect,socket:digital certificate>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The attackers used a self-signed certificate impersonating EMS, indicating a process-to-socket relationship. [Original Relationships]: <process:attackers, using, socket:self-signed certificate>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates the attackers are using a self-signed certificate, which implies establishing a connection to a socket (the certificate represents an endpoint). In system-level terms, this maps to a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:attackers,Connect,socket:self-signed certificate>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: DustySky uses various paths when communicating, showing process-to-socket relationships. [Original Relationships]: <process:DustySky, using, socket:Update.php>, <process:DustySky, using, socket:conn.php>, <process:DustySky, using, socket:geoiploc.php>, <process:DustySky, using, socket:news.htm>, <process:DustySky, using, socket:pass.php>, <process:DustySky, using, socket:passho.php>, <process:DustySky, using, socket:passyah.php>. ",
                "semantic_relationship": "[CoT]: The original relationships indicate that DustySky is using various sockets to communicate. In system-level terms, this corresponds to a process establishing a connection to a socket, hence the 'Connect' relationship. [System-level Relationships]: <process:DustySky,Connect,socket:Update.php>, <process:DustySky,Connect,socket:conn.php>, <process:DustySky,Connect,socket:geoiploc.php>, <process:DustySky,Connect,socket:news.htm>, <process:DustySky,Connect,socket:pass.php>, <process:DustySky,Connect,socket:passho.php>, <process:DustySky,Connect,socket:passyah.php>. "
            }
        ]
    }
]