[
    {
        "phase": "initial access",
        "content": "The \"njRAT\" is a robust remote access trojan that once it reaches and infects the end-point, allows the attacker to have full control over the Victim system. With this access, the attacker can start scanning other systems in the victim network to perform lateral movement. \nWe will start this section by performing analysis on the following \"njRAT\" sample: \nFilename: Authorization.exe MD5: 1d3baedd747f6f9bf92c81eb9f63b34b \nThe \"Authorization.exe\" njRAT malware was embedded and dropped in the victim system by the following file: \"Authorization form may - 2013 - 115444.scr\" (MD5:   \n63781fe1932e612c6c29225d25515111). \nThe next section (Indicators & Mitigation Strategies), will provide information about other variants of the malware obtained. ",
        "relationship": "1. [CoT]: The text states that \"Authorization.exe\" was dropped by \"Authorization form may - 2013 - 115444.scr\", indicating a process-to-file relationship where the first process drops the second process.   [Relationships]: <process:Authorization form may - 2013 - 115444.scr, drops, process:Authorization.exe>. ",
        "semantic_relationship": "[CoT]: The term \"drops\" in the original relationship implies that the first process created the second process file. In system-level terms, this corresponds to a \"Create\" action between two processes. [System-level Relationships]: <process:Authorization form may - 2013 - 115444.scr,Create,process:Authorization.exe>. "
    },
    {
        "phase": "execution",
        "content": "The \"Authorization.exe\" malware sample was created with version V.0.5 of this RAT. The njRAT application was developed with VB.NET (Visual Basic .NET). The \"Authorization.exe\" malware has keylogger functionality. It stores the logged keystrokes in the following file: \"[CWD]\\.tmp\". When the malware is dropped by the \"Authorization form may - 2013 - 115444.scr\" carrier file, the logged keystrokes are stored in: \"C:\\Extracted\\.tmp\". \nThe IP address used by the Command & Control (C2) node appears to be under an IP range owned by: \"Palestinian Internet Services, P. O. BOX 5111 Gaza City, Palestine\". \nVariants of this malware have been observed by the community since at least 2012. The malware appears to be known by the community as: njRAT, MSIL/Bladabindi, and Backdoor.LV. \nWhen the \"Authorization.exe\" malware is executed it: \nCreates a copy of itself in the following locations:   \n%APPDATA%\\msnco.exe   \nC:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe \nTries to open the following file: [CWD]\\ Authorization.exe.config \nEntrenches in the system for persistence in the following registry locations: \nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Ru n\\b6554e5bcfef391ff7a7ffda58092e10   \nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\R un\\b6554e5bcfef391ff7a7ffda58092e10 \nMakes the following modifications to the registry to bypass the Windows Firewall: \nKey: HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe   \nValue: [%APPDATA%]\\msnco.exe:\\*:Enabled:msnco.exe \nBeacons to the following C2 node over TCP port 1177: \"217.66.231.245\" \nThe attacker tries to make sure the malware will run in the system by making the second copy into the above mentioned directory (C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe) \nThis causes the malware to execute again when the system is rebooted and re-starts the infection in the system. Once the system is infected again, it will beacon to the C2 node. \nThe attacker tries to trick the user by using different icons for the malware. Various samples were observed with MS Word and PDF icons. The following is a screenshot of how the file will look like to a normal user: \nWhen the system is configured to show file extensions, the EXE extension is now revealed:",
        "relationship": "1. [CoT]: The text states that the \"Authorization.exe\" malware was created with a specific version of the RAT, indicating the developer's tool created the file. [Relationships]: <process:Authorization.exe,was created with,process:RAT>. \n2. [CoT]: The njRAT application was developed with VB.NET, making it the development tool that created the file. [Relationships]: <process:njRAT,was developed with,process:VB.NET>. \n3. [CoT]: The \"Authorization.exe\" malware stores logged keystrokes in a specific file, .tmp, within the [CWD] directory. [Relationships]: <process:Authorization.exe,stores,file:[CWD]\\.tmp>. \n4. [CoT]: When dropped by the carrier file, the malware stores keystrokes in a specific file path. [Relationships]: <process:Authorization.exe,stores,file:C:\\Extracted\\.tmp>. \n5. [CoT]: The malware uses an IP address belonging to a specific IP range owned by Palestinian Internet Services. [Relationships]: <process:Authorization.exe,uses,socket:IP range owned by Palestinian Internet Services>. \n6. [CoT]: The malware is known by various names in the community, including njRAT. [Relationships]: <process:community,knowns,process:njRAT>. \n7. [CoT]: The malware is known by various names in the community, including MSIL/Bladabindi. [Relationships]: <process:community,knowns,process:MSIL/Bladabindi>. \n8. [CoT]: The malware is known by various names in the community, including Backdoor.LV. [Relationships]: <process:community,knowns,process:Backdoor.LV>. \n9. [CoT]: The malware creates a copy of itself in a specific file path. [Relationships]: <process:Authorization.exe,creates,file:%APPDATA%\\msnco.exe>. \n10. [CoT]: The malware creates a copy of itself in a specific file path. [Relationships]: <process:Authorization.exe,creates,file:C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe>. \n11. [CoT]: The malware tries to open a specific file. [Relationships]: <process:Authorization.exe,tries to open,file:[CWD]\\ Authorization.exe.config>. \n12. [CoT]: The malware entrenches in the system for persistence by modifying registry keys. [Relationships]: <process:Authorization.exe,entrenches,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Ru n\\b6554e5bcfef391ff7a7ffda58092e10>. \n13. [CoT]: The malware entrenches in the system for persistence by modifying registry keys. [Relationships]: <process:Authorization.exe,entrenches,reg:HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\R un\\b6554e5bcfef391ff7a7ffda58092e10>. \n14. [CoT]: The malware makes modifications to the registry to bypass the Windows Firewall. [Relationships]: <process:Authorization.exe,makes,reg:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe>. \n15. [CoT]: The malware makes modifications to the registry to bypass the Windows Firewall. [Relationships]: <process:msnco.exe,modifies,reg:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe>. \n16. [CoT]: The malware beacons to a specific C2 node and port combination. [Relationships]: <process:Authorization.exe,beacons,socket:217.66.231.245:1177>. \n17. [CoT]: The attacker makes a copy of the malware in a specific directory to ensure persistence. [Relationships]: <process:attacker,tries to make sure,process:Authorization.exe>. \n18. [CoT]: The attacker makes a copy of the malware in a specific directory to ensure persistence. [Relationships]: <process:attacker,tries to make sure,file:C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe>. \n19. [CoT]: The malware executes again when the system is rebooted, restarting the infection. [Relationships]: <process:Authorization.exe,executes,process:",
        "semantic_relationship": "[CoT]: The original relationship states that \"Authorization.exe\" was created with RAT, which implies that the RAT process spawned the creation of Authorization.exe. In system-level terms, this is best represented as a \"Fork\" relationship between the two processes. [System-level Relationships]: <process:Authorization.exe,Fork,process:RAT>. \n[CoT]: The original relationship \"was developed with\" implies that the njRAT process used VB.NET as its development environment, which aligns with the system-level relationship \"Fork\" as it indicates the creation of another process or file. [System-level Relationships]: <process:njRAT,Fork,process:VB.NET>. \n[CoT]: The original relationship states that Authorization.exe \"stores\" logged keystrokes in a file. In system-level terms, this action corresponds to writing data (keystrokes) to a file, hence the relationship is converted to \"Write\". [System-level Relationships]: <process:Authorization.exe,Write,file:[CWD]\\.tmp>. \n[CoT]: The original relationship \"stores\" implies that the process is writing data to a file, which corresponds to the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:Authorization.exe,Write,file:C:\\Extracted\\.tmp>. \n[CoT]: The original relationship \"uses\" between a process and a socket implies that the process is establishing a connection to the socket (IP range in this case). In system-level terms, this corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:Authorization.exe,Connect,socket:IP range owned by Palestinian Internet Services>. \n[CoT]: The original relationship \"knowns\" implies that the malware community is aware of or associates with njRAT. In system-level terms, this is best represented as \"Fork\" between the process:community and process:njRAT. [System-level Relationships]: <process:community,Fork,process:njRAT>. \n[CoT]: The original relationship \"knowns\" implies that the community is aware of the malware's name. In system-level terms, this awareness is best represented as \"Fork\" between the process (community) and the process (MSIL/Bladabindi). The Fork relationship indicates that the community has learned about the malware's identity. [System-level Relationships]: <process:community,Fork,process:MSIL/Bladabindi>. \n[CoT]: The original relationship \"knowns\" implies that the community process is aware of the Backdoor.LV process, which typically indicates interaction or communication between the two processes. In system-level terms, this is most accurately represented as a \"FoF\" (Fork) relationship, where one process spawns or creates another. [System-level Relationships]: <process:community,FoF,process:Backdoor.LV>. \n[CoT]: The original relationship states that the process \"Authorization.exe\" creates a file \"%APPDATA%\\msnco.exe\". In system-level terms, this corresponds to the \"Create\" action between a process and a file. [System-level Relationships]: <process:Authorization.exe,Create,file:%APPDATA%\\msnco.exe>. \n[CoT]: The original relationship states that the process \"Authorization.exe\" creates a copy of itself, which is represented as writing data to a new file. Therefore, the system-level relationship is \"Write\" from the process to the file. [System-level Relationships]: <process:Authorization.exe,Write,file:C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe>. \n[CoT]: The original relationship states that the process \"Authorization.exe\" tries to open a file \"[CWD]\\ Authorization.exe.config\". In system-level terms, this action corresponds to a \"Read\" operation, as the process is attempting to access the file's contents. [System-level Relationships]: <process:Authorization.exe,Read,file:[CWD]\\ Authorization.exe.config>. \n[CoT]: The original relationship describes the malware modifying registry keys, which corresponds to the system-level 'Writekey' action as it involves writing to a registry key for persistence. [System-level Relationships]: <process:Authorization.exe,Writekey,HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\b6554e5bcfef391ff7a7ffda58092e10>. \n[CoT]: The original relationship describes the malware modifying registry keys, which corresponds to the system-level relationship 'Writekey' as it involves writing to a registry key for persistence. [System-level Relationships]: <process:Authorization.exe,Writekey,reg:HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\b6554e5bcfef391ff7a7ffda58092e10>. \n[CoT]: The original relationship states that the process \"Authorization.exe\" makes modifications to the registry, which involves writing to the registry key. In system-level terms, this corresponds to a \"Writekey\" relationship between the process and the registry key. [System-level Relationships]: <process:Authorization.exe,Writekey,reg:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe>. \n[CoT]: The original relationship states that the process 'msnco.exe' modifies the registry key 'HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplications\\List\\[%APPDATA%]\\msnco.exe'. This modification involves adding or removing the registry key, which aligns with the system-level relationship 'Createkey' as it changes the registry structure. [System-level Relationships]: <process:msnco.exe,Createkey,reg:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplications\\List\\[%APPDATA%]\\msnco.exe>. \n[CoT]: The original relationship \"beacons\" indicates that the process Authorization.exe is establishing a connection to a remote socket (C2 node). In system-level terms, this corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:Authorization.exe,Connect,socket:217.66.231.245:1177>. \n[CoT]: The attacker is trying to ensure persistence by copying the malware, which involves creating a new file (Authorization.exe). Therefore, the system-level relationship is 'Create' between the attacker process and the file Authorization.exe. [System-level Relationships]: <process:attacker,Create,file:Authorization.exe>. \n[CoT]: The attacker is attempting to ensure persistence by creating a copy of the malware in the Startup directory, which is a common technique for persistence on Windows systems. Therefore, the system-level relationship is 'Create' as the attacker process is creating a new file in the filesystem. [System-level Relationships]: <process:attacker,Create,file:C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe>. \n[CoT]: The original relationship states that the malware executes again when the system is rebooted. In system-level terms, this corresponds to a Process-to-Process relationship where one process (Authorization.exe) executes another process (itself). The correct system-level relationship is \"Fork\". [System-level Relationships]: <process:Authorization.exe,Fork,process:Authorization.exe> [Description]: The malware modifies the system configuration to ensure it runs at every system startup. [Original Relationships]: <process:Authorization.exe,Writekey,reg:\\SYSTEM\\Run\\Authorization.exe> [System-level Relationships]: <process:Authorization.exe,Writekey,reg:\\SYSTEM\\Run\\Authorization.exe>"
    },
    {
        "phase": "exfiltration",
        "content": "When the malware connects to the C2 node, it will send information about the victim system, malware version, open windows, etc. The following is the network traffic observed: \nThe following table provides information of some of the fields observed in the network traffic: \nInformation sent by the attacker on opened windows in the system could inform him/her of his malware being analyzed and allowed to connect to the C2 node. For example, if Wireshark, Filemon, Regmon, and IDA are opened in the system when the analyst executes the malware, this will quickly let the attacker know that someone is performing reverse engineering of his malicious code.\nThe following WHOIS information was found related to the C2 node (21+7.16860.02.3615.22.4405).",
        "relationship": "1. [CoT]: The text states that the malware connects to the C2 node (21+7.16860.02.3615.22.4405) to send information about the victim system, which is a process-to-socket relationship. [Relationships]: <process:malware,connect,socket:21+7.16860.02.3615.22.4405>. \n2. [CoT]: The text mentions that the attacker can observe open windows in the system via network traffic, indicating a process-to-socket relationship where the attacker passes information about open windows to the attacker via the network. [Relationships]: <process:attacker,send,process:opened windows>. \n3. [CoT]: The text lists tools like Wireshark, Filemon, Regmon, and IDA that might be opened in the system during analysis, showing a process-to-process relationship where the analyst executes the malware. [Relationships]: <process:analyst,executes,process:malware>. ",
        "semantic_relationship": "[CoT]: The original relationship describes the malware connecting to a socket (C2 node), which directly maps to the system-level 'Connect' relationship between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:21+7.16860.02.3615.22.4405>. \n[CoT]: The original relationship describes the attacker sending information about open windows to the attacker via the network. In system-level terms, this corresponds to a Process-to-Socket \"Send\" relationship, as the process is sending data to a socket for network communication. [System-level Relationships]: <process:attacker,Send,socket:network traffic>. \n[CoT]: The original relationship \"executes\" indicates that the analyst is running or launching the malware process. In system-level terms, this corresponds to the \"Fork\" relationship between processes. [System-level Relationships]: <process:analyst,Fork,process:malware>. "
    },
    {
        "phase": "command and control",
        "content": "The  \"Authorization.exe\" variant in this report appears to have been available at some point through the following URL: \"hxxp://bongdacongdong.vn/authorization.exe\". The domain currently resolves to the following IP address: \"112.213.89.144\", but at some point, the domain was associated with the following IP address: \"31.170.165.90\". \nThe following information was found at Virustotal for \"31.170.165.90\": ",
        "relationship": "1. [CoT]: The text mentions that the domain \"bongdacongdong.vn\" resolved to the IP address \"31.170.165.90\" at some point, indicating a relationship between the domain and the IP address.   [Relationships]: <process:bongdacongdong.vn, resolves to, socket:31.170.165.90>. \n2. [CoT]: The text states that the domain \"bongdacongdong.vn\" was associated with the IP address \"31.170.165.90\" at some point, indicating a relationship between the domain and the IP address.   [Relationships]: <process:bongdacongdong.vn, associated with, socket:31.170.165.90>. \n3. [CoT]: The text mentions that the domain \"bongdacongdong.vn\" currently resolves to the IP address \"112.213.89.144\", indicating a relationship between the domain and the IP address.   [Relationships]: <process:bongdacongdong.vn, resolves to, socket:112.213.89.144>. \n4. [CoT]: The text describes that the domain \"hxxp://bongdacongdong.vn/authorization.exe\" was the URL where the \"Authorization.exe\" variant was available, indicating a relationship between the domain and the file.   [Relationships]: <process:hxxp://bongdacongdong.vn/authorization.exe, available from, file:Authorization.exe>. ",
        "semantic_relationship": "[CoT]: The original relationship \"resolves to\" indicates that the domain \"bongdacongdong.vn\" established a connection to the IP address \"31.170.165.90\". In system-level terms, this corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:bongdacongdong.vn,Connect,socket:31.170.165.90>. \n[CoT]: The original relationship states that the domain \"bongdacongdong.vn\" was associated with the IP address \"31.170.165.90\". In system-level terms, this association implies that the domain (represented as a process) established a connection to the IP address (represented as a socket). Therefore, the correct system-level relationship is \"Connect\" between the process and the socket. [System-level Relationships]: <process:bongdacongdong.vn,Connect,socket:31.170.165.90>. \n[CoT]: The original relationship \"resolves to\" indicates that the domain \"bongdacongdong.vn\" is resolving to the IP address \"112.213.89.144\". In system-level terms, this resolution process involves establishing a connection to a DNS server to retrieve the IP address associated with the domain. Therefore, the appropriate system-level relationship is \"Connect\" between the process and the socket. [System-level Relationships]: <process:bongdacongdong.vn,Connect,socket:112.213.89.144>. \n[CoT]: The original relationship \"available from\" indicates that the domain provides access to the file \"Authorization.exe\". In system-level terms, this corresponds to a Download relationship between the network resource (domain) and the file. [System-level Relationships]: <process:hxxp://bongdacongdong.vn/authorization.exe,Download,file:Authorization.exe>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that \"Authorization.exe\" was dropped by \"Authorization form may - 2013 - 115444.scr\", indicating a process-to-file relationship where the first process drops the second process.   [Original Relationships]: <process:Authorization form may - 2013 - 115444.scr, drops, process:Authorization.exe>. ",
                "semantic_relationship": "[CoT]: The term \"drops\" in the original relationship implies that the first process created the second process file. In system-level terms, this corresponds to a \"Create\" action between two processes. [System-level Relationships]: <process:Authorization form may - 2013 - 115444.scr,Create,process:Authorization.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the \"Authorization.exe\" malware was created with a specific version of the RAT, indicating the developer's tool created the file. [Original Relationships]: <process:Authorization.exe,was created with,process:RAT>. ",
                "semantic_relationship": "[CoT]: The original relationship states that \"Authorization.exe\" was created with RAT, which implies that the RAT process spawned the creation of Authorization.exe. In system-level terms, this is best represented as a \"Fork\" relationship between the two processes. [System-level Relationships]: <process:Authorization.exe,Fork,process:RAT>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The njRAT application was developed with VB.NET, making it the development tool that created the file. [Original Relationships]: <process:njRAT,was developed with,process:VB.NET>. ",
                "semantic_relationship": "[CoT]: The original relationship \"was developed with\" implies that the njRAT process used VB.NET as its development environment, which aligns with the system-level relationship \"Fork\" as it indicates the creation of another process or file. [System-level Relationships]: <process:njRAT,Fork,process:VB.NET>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The \"Authorization.exe\" malware stores logged keystrokes in a specific file, .tmp, within the [CWD] directory. [Original Relationships]: <process:Authorization.exe,stores,file:[CWD]\\.tmp>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Authorization.exe \"stores\" logged keystrokes in a file. In system-level terms, this action corresponds to writing data (keystrokes) to a file, hence the relationship is converted to \"Write\". [System-level Relationships]: <process:Authorization.exe,Write,file:[CWD]\\.tmp>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: When dropped by the carrier file, the malware stores keystrokes in a specific file path. [Original Relationships]: <process:Authorization.exe,stores,file:C:\\Extracted\\.tmp>. ",
                "semantic_relationship": "[CoT]: The original relationship \"stores\" implies that the process is writing data to a file, which corresponds to the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:Authorization.exe,Write,file:C:\\Extracted\\.tmp>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware uses an IP address belonging to a specific IP range owned by Palestinian Internet Services. [Original Relationships]: <process:Authorization.exe,uses,socket:IP range owned by Palestinian Internet Services>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uses\" between a process and a socket implies that the process is establishing a connection to the socket (IP range in this case). In system-level terms, this corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:Authorization.exe,Connect,socket:IP range owned by Palestinian Internet Services>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware is known by various names in the community, including njRAT. [Original Relationships]: <process:community,knowns,process:njRAT>. ",
                "semantic_relationship": "[CoT]: The original relationship \"knowns\" implies that the malware community is aware of or associates with njRAT. In system-level terms, this is best represented as \"Fork\" between the process:community and process:njRAT. [System-level Relationships]: <process:community,Fork,process:njRAT>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware is known by various names in the community, including MSIL/Bladabindi. [Original Relationships]: <process:community,knowns,process:MSIL/Bladabindi>. ",
                "semantic_relationship": "[CoT]: The original relationship \"knowns\" implies that the community is aware of the malware's name. In system-level terms, this awareness is best represented as \"Fork\" between the process (community) and the process (MSIL/Bladabindi). The Fork relationship indicates that the community has learned about the malware's identity. [System-level Relationships]: <process:community,Fork,process:MSIL/Bladabindi>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware is known by various names in the community, including Backdoor.LV. [Original Relationships]: <process:community,knowns,process:Backdoor.LV>. ",
                "semantic_relationship": "[CoT]: The original relationship \"knowns\" implies that the community process is aware of the Backdoor.LV process, which typically indicates interaction or communication between the two processes. In system-level terms, this is most accurately represented as a \"FoF\" (Fork) relationship, where one process spawns or creates another. [System-level Relationships]: <process:community,FoF,process:Backdoor.LV>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware creates a copy of itself in a specific file path. [Original Relationships]: <process:Authorization.exe,creates,file:%APPDATA%\\msnco.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process \"Authorization.exe\" creates a file \"%APPDATA%\\msnco.exe\". In system-level terms, this corresponds to the \"Create\" action between a process and a file. [System-level Relationships]: <process:Authorization.exe,Create,file:%APPDATA%\\msnco.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware creates a copy of itself in a specific file path. [Original Relationships]: <process:Authorization.exe,creates,file:C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process \"Authorization.exe\" creates a copy of itself, which is represented as writing data to a new file. Therefore, the system-level relationship is \"Write\" from the process to the file. [System-level Relationships]: <process:Authorization.exe,Write,file:C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware tries to open a specific file. [Original Relationships]: <process:Authorization.exe,tries to open,file:[CWD]\\ Authorization.exe.config>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process \"Authorization.exe\" tries to open a file \"[CWD]\\ Authorization.exe.config\". In system-level terms, this action corresponds to a \"Read\" operation, as the process is attempting to access the file's contents. [System-level Relationships]: <process:Authorization.exe,Read,file:[CWD]\\ Authorization.exe.config>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware entrenches in the system for persistence by modifying registry keys. [Original Relationships]: <process:Authorization.exe,entrenches,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Ru n\\b6554e5bcfef391ff7a7ffda58092e10>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the malware modifying registry keys, which corresponds to the system-level 'Writekey' action as it involves writing to a registry key for persistence. [System-level Relationships]: <process:Authorization.exe,Writekey,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\b6554e5bcfef391ff7a7ffda58092e10>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware entrenches in the system for persistence by modifying registry keys. [Original Relationships]: <process:Authorization.exe,entrenches,reg:HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\R un\\b6554e5bcfef391ff7a7ffda58092e10>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the malware modifying registry keys, which corresponds to the system-level relationship 'Writekey' as it involves writing to a registry key for persistence. [System-level Relationships]: <process:Authorization.exe,Writekey,reg:HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\\b6554e5bcfef391ff7a7ffda58092e10>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware makes modifications to the registry to bypass the Windows Firewall. [Original Relationships]: <process:Authorization.exe,makes,reg:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process \"Authorization.exe\" makes modifications to the registry, which involves writing to the registry key. In system-level terms, this corresponds to a \"Writekey\" relationship between the process and the registry key. [System-level Relationships]: <process:Authorization.exe,Writekey,reg:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware makes modifications to the registry to bypass the Windows Firewall. [Original Relationships]: <process:msnco.exe,modifies,reg:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process 'msnco.exe' modifies the registry key 'HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplications\\List\\[%APPDATA%]\\msnco.exe'. This modification involves adding or removing the registry key, which aligns with the system-level relationship 'Createkey' as it changes the registry structure. [System-level Relationships]: <process:msnco.exe,Createkey,reg:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAccess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplications\\List\\[%APPDATA%]\\msnco.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware beacons to a specific C2 node and port combination. [Original Relationships]: <process:Authorization.exe,beacons,socket:217.66.231.245:1177>. ",
                "semantic_relationship": "[CoT]: The original relationship \"beacons\" indicates that the process Authorization.exe is establishing a connection to a remote socket (C2 node). In system-level terms, this corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:Authorization.exe,Connect,socket:217.66.231.245:1177>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The attacker makes a copy of the malware in a specific directory to ensure persistence. [Original Relationships]: <process:attacker,tries to make sure,process:Authorization.exe>. ",
                "semantic_relationship": "[CoT]: The attacker is trying to ensure persistence by copying the malware, which involves creating a new file (Authorization.exe). Therefore, the system-level relationship is 'Create' between the attacker process and the file Authorization.exe. [System-level Relationships]: <process:attacker,Create,file:Authorization.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The attacker makes a copy of the malware in a specific directory to ensure persistence. [Original Relationships]: <process:attacker,tries to make sure,file:C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe>. ",
                "semantic_relationship": "[CoT]: The attacker is attempting to ensure persistence by creating a copy of the malware in the Startup directory, which is a common technique for persistence on Windows systems. Therefore, the system-level relationship is 'Create' as the attacker process is creating a new file in the filesystem. [System-level Relationships]: <process:attacker,Create,file:C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The malware executes again when the system is rebooted, restarting the infection. [Original Relationships]: <process:Authorization.exe,executes,process:",
                "semantic_relationship": "[CoT]: The original relationship states that the malware executes again when the system is rebooted. In system-level terms, this corresponds to a Process-to-Process relationship where one process (Authorization.exe) executes another process (itself). The correct system-level relationship is \"Fork\". [System-level Relationships]: <process:Authorization.exe,Fork,process:Authorization.exe> [Description]: The malware modifies the system configuration to ensure it runs at every system startup. [Original Relationships]: <process:Authorization.exe,Writekey,reg:\\SYSTEM\\Run\\Authorization.exe> [System-level Relationships]: <process:Authorization.exe,Writekey,reg:\\SYSTEM\\Run\\Authorization.exe>"
            },
            {
                "phase": "exfiltration",
                "relationship": "[Description]: The text states that the malware connects to the C2 node (21+7.16860.02.3615.22.4405) to send information about the victim system, which is a process-to-socket relationship. [Original Relationships]: <process:malware,connect,socket:21+7.16860.02.3615.22.4405>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the malware connecting to a socket (C2 node), which directly maps to the system-level 'Connect' relationship between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:21+7.16860.02.3615.22.4405>. "
            },
            {
                "phase": "exfiltration",
                "relationship": "[Description]: The text mentions that the attacker can observe open windows in the system via network traffic, indicating a process-to-socket relationship where the attacker passes information about open windows to the attacker via the network. [Original Relationships]: <process:attacker,send,process:opened windows>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the attacker sending information about open windows to the attacker via the network. In system-level terms, this corresponds to a Process-to-Socket \"Send\" relationship, as the process is sending data to a socket for network communication. [System-level Relationships]: <process:attacker,Send,socket:network traffic>. "
            },
            {
                "phase": "exfiltration",
                "relationship": "[Description]: The text lists tools like Wireshark, Filemon, Regmon, and IDA that might be opened in the system during analysis, showing a process-to-process relationship where the analyst executes the malware. [Original Relationships]: <process:analyst,executes,process:malware>. ",
                "semantic_relationship": "[CoT]: The original relationship \"executes\" indicates that the analyst is running or launching the malware process. In system-level terms, this corresponds to the \"Fork\" relationship between processes. [System-level Relationships]: <process:analyst,Fork,process:malware>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that the domain \"bongdacongdong.vn\" resolved to the IP address \"31.170.165.90\" at some point, indicating a relationship between the domain and the IP address.   [Original Relationships]: <process:bongdacongdong.vn, resolves to, socket:31.170.165.90>. ",
                "semantic_relationship": "[CoT]: The original relationship \"resolves to\" indicates that the domain \"bongdacongdong.vn\" established a connection to the IP address \"31.170.165.90\". In system-level terms, this corresponds to a \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:bongdacongdong.vn,Connect,socket:31.170.165.90>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the domain \"bongdacongdong.vn\" was associated with the IP address \"31.170.165.90\" at some point, indicating a relationship between the domain and the IP address.   [Original Relationships]: <process:bongdacongdong.vn, associated with, socket:31.170.165.90>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the domain \"bongdacongdong.vn\" was associated with the IP address \"31.170.165.90\". In system-level terms, this association implies that the domain (represented as a process) established a connection to the IP address (represented as a socket). Therefore, the correct system-level relationship is \"Connect\" between the process and the socket. [System-level Relationships]: <process:bongdacongdong.vn,Connect,socket:31.170.165.90>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that the domain \"bongdacongdong.vn\" currently resolves to the IP address \"112.213.89.144\", indicating a relationship between the domain and the IP address.   [Original Relationships]: <process:bongdacongdong.vn, resolves to, socket:112.213.89.144>. ",
                "semantic_relationship": "[CoT]: The original relationship \"resolves to\" indicates that the domain \"bongdacongdong.vn\" is resolving to the IP address \"112.213.89.144\". In system-level terms, this resolution process involves establishing a connection to a DNS server to retrieve the IP address associated with the domain. Therefore, the appropriate system-level relationship is \"Connect\" between the process and the socket. [System-level Relationships]: <process:bongdacongdong.vn,Connect,socket:112.213.89.144>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes that the domain \"hxxp://bongdacongdong.vn/authorization.exe\" was the URL where the \"Authorization.exe\" variant was available, indicating a relationship between the domain and the file.   [Original Relationships]: <process:hxxp://bongdacongdong.vn/authorization.exe, available from, file:Authorization.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship \"available from\" indicates that the domain provides access to the file \"Authorization.exe\". In system-level terms, this corresponds to a Download relationship between the network resource (domain) and the file. [System-level Relationships]: <process:hxxp://bongdacongdong.vn/authorization.exe,Download,file:Authorization.exe>. "
            }
        ]
    }
]