[
    {
        "phase": "initial access",
        "content": "Over the past few months, a number of decoy documents have been used. One of them was a fake TrueType font updater for the Roboto Slab regular font. This choice of font seems a bit odd since it does not support a lot of East-Asian languages. \nWhen executed, this binary decrypts its resource (XOR with a 128-byte, hardcoded key) and decompresses the decrypted data (LZMA). The legitimate RobotoSlab-Regular.ttf (SHA1:912895e6bb9e05af3a1e58a1da417e992a71a324) file is written into the %temp% folder and run via Win32 API function ShellExecute. \nThe shellcode decrypted from the resource is executed. After its execution, the fake font updater drops another application whose sole purpose is to delete the dropper. This \"eraser\" application is dropped as %temp%\\[0-9].tmp.exe. \nThe shellcode is a custom PE loader. It recreates an executable in memory: it decrypts all the sections and computes the necessary relocations and other offsets. The shellcode retrieves three Windows API functions: VirtualAlloc, RtlMoveMemory and RtlZeroMemory. \nThe RtlZeroMemory function is heavily used to zero-out fields in the PE header. Relying on automatic memory dumping will not work since the MZ/PE headers are broken. \nThe shellcode calls the entry-point function of the decrypted PE and then the DLLEntry export function. ",
        "relationship": "1. [CoT]: The text states that the binary decrypts its resource (XOR with a 128-byte, hardcoded key) and decompresses the decrypted data (LZMA), indicating a process-to-file relationship where the binary decrypts a resource file. [Relationships]: <process:binary,decrypts,file:resource (XOR with a 128-byte, hardcoded key)>. \n2. [CoT]: The text mentions that the legitimate RobotoSlab-Regular.ttf file is written into the %temp% folder by the binary, which is later run via the Win32 API function ShellExecute, showing a process-to-file relationship in the context of execution. [Relationships]: <process:binary,writes,file:%temp%\\RobotoSlab-Regular.ttf>. \n3. [CoT]: The text describes that the shellcode is executed after the decryption of the resource, indicating a process-to-file relationship where the binary decrypts and executes the shellcode file. [Relationships]: <process:binary,executes,file:shellcode>. \n4. [CoT]: The text states that the shellcode drops another application named %temp%\\[0-9].tmp.exe, showing a process-to-file relationship where the shellcode drops a file. [Relationships]: <process:shellcode,drops,file:%temp%\\[0-9].tmp.exe>. \n5. [CoT]: The text mentions that the shellcode retrieves three Windows API functions: VirtualAlloc, RtlMoveMemory, and RtlZeroMemory, indicating a process-to-process relationship where the shellcode retrieves functions from the Windows API. [Relationships]: <process:shellcode,retrieves,process:Windows API functions: VirtualAlloc, RtlMoveMemory and RtlZeroMemory>. \n6. [CoT]: The text describes that the shellcode calls the entry-point function of the decrypted PE, showing a process-to-file relationship where the shellcode executes the decrypted PE file. [Relationships]: <process:shellcode,calls,file:decrypted PE>. \n7. [CoT]: The text mentions that the shellcode then calls the DLLEntry export function, indicating a process-to-file relationship where the shellcode executes the DLLEntry function within the decrypted PE. [Relationships]: <process:shellcode,calls,file:DLLEntry export function>. ",
        "semantic_relationship": "[CoT]: The original relationship describes a process (binary) decrypting a resource file using a hardcoded key. In system-level terms, this action corresponds to the 'Read' operation on the file, as the binary is reading the encrypted data to perform the decryption. The 'Write' operation is not involved as the binary is not modifying the resource file's content but rather performing a cryptographic operation on it. [System-level Relationships]: <process:binary,Read,file:resource (XOR with a 128-byte, hardcoded key)>. \n[CoT]: The original relationship describes a process writing to a file, which directly corresponds to the system-level 'Write' relationship between a process and a file. The action of writing data to a file is a clear example of Process-to-File:Write in the system-level framework. [System-level Relationships]: <process:binary,Write,file:%temp%\\RobotoSlab-Regular.ttf>. \n[CoT]: The original relationship states that the binary \"executes\" the shellcode file, which directly corresponds to the system-level \"Execute\" relationship between a process and a file. [System-level Relationships]: <process:binary,Execute,file:shellcode>. \n[CoT]: The term \"drops\" in the original relationship implies that the shellcode creates a new file on the system. In system-level terms, this corresponds to a \"Create\" action between a process and a file. [System-level Relationships]: <process:shellcode,Create,file:%temp%\\[0-9].tmp.exe>. \n[CoT]: The original relationship states that the shellcode \"retrieves\" functions from the Windows API. In system-level terms, this action corresponds to the shellcode loading the Windows API functions into its own process memory space, which is best represented by the \"Loadlibrary\" relationship in the Process-to-Process category. [System-level Relationships]: <process:shellcode,Loadlibrary,process:Windows API functions: VirtualAlloc, RtlMoveMemory and RtlZeroMemory>. \n[CoT]: The original relationship \"calls\" indicates that the shellcode is executing the decrypted PE file, which aligns with the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:shellcode,Execute,file:decrypted PE>. \n[CoT]: The original relationship \"calls\" indicates that the shellcode is executing the DLLEntry export function, which aligns with the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:shellcode,Execute,file:DLLEntry export function>. "
    },
    {
        "phase": "persistence",
        "content": "This executable decrypts its resource using the AES algorithm with CBC mode via the Windows API. The size of the hardcoded key is 256 bits. After decryption, the data are decompressed (LZMA algorithm). \nIf the process is running with administrator privileges, then the malware achieves persistence by creating a service, else the classic Windows \"Run\" registry key is used (HKCU\\SOFTWARE\\Microsoft\\ Windows\\CurrentVersion\\Run;DeviceAssociationService;rastlsc.exe). \nIf the dropper is executed with administrator privileges, then it tries to write the following files in the C:\\Program Files\\Symantec\\Symantec Endpoint Protection\\12.1.671.4971.104a\\ DeviceAssociationService\\ folder else it writes them in the %APPDATA%\\Symantec\\Symantec Endpoint Protection\\12.1.671.4971.104a\\DeviceAssociationService\\ folder: \n•\t rastlsc.exe (SHA1:2616da1697f7c764ee7fb558887a6a3279861fac, copy of legitimate Symantec Network Access Control application, dot1xtra.exe)   \n•\t SyLog.bin (SHA1:5689448b4b6260ec9c35f129df8b8f2622c66a45, encrypted backdoor)   \n•\t rastls.dll (SHA1:82e579bd49d69845133c9aa8585f8bd26736437b,malicious DLL sideloaded by rastlsc.exe) \nThe path changes from sample to sample but the pattern is similar. Depending on its privileges, the malware drops the files in %ProgramFiles% or %appdata%. We've also seen: \n•\t \\Symantec\\CNG Key Isolation\\ \n•\t \\Symantec\\Connected User Experiences and Telemetry\\ \n•\t \\Symantec\\DevQuery Background Discovery Broker Tasks\\ \nThese paths are used by various Symantec products. \nAfter achieving persistence and dropping the executable, the legitimate Symantec executable, rastlsc.exe, is executed using CreateProcessW. \nWe've also seen another version ({BB7BDEC9-B59D-492E-A4AF-4C7B1C9E646B}.dll), which executes rastlsc.exe with the parameter krv. Its meaning is discussed below. ",
        "relationship": "1. [CoT]: The text states that the executable decrypts its resource using the AES algorithm, indicating a process-to-file relationship where the process decrypts a resource file. [Relationships]: <process:executable,decrypts,file:resource:AES algorithm>. \n2. [CoT]: The text mentions that after decryption, the data are decompressed using the LZMA algorithm, showing a process-to-file relationship where the process decompresses the decrypted data file. [Relationships]: <process:executable,decompresses,file:resource:LZMA algorithm>. \n3. [CoT]: The malware achieves persistence by creating a service, indicating a process-to-file relationship where the process creates a registry key (HKCU\\SOFTWARE\\Microsoft\\ Windows\\CurrentVersion\\Run;DeviceAssociationService;rastlsc.exe). [Relationships]: <process:malware,creates,reg:HKCU\\SOFTWARE\\Microsoft\\ Windows\\CurrentVersion\\Run;DeviceAssociationService;rastlsc.exe>. \n4. [CoT]: The dropper writes several files to specific folders, indicating process-to-file relationships where the process writes files (rastlsc.exe, SyLog.bin, and rastls.dll). [Relationships]: <process:dropper,writes,file:rastlsc.exe>, <process:dropper,writes,file:SyLog.bin>, <process:dropper,writes,file:rastls.dll>. \n5. [CoT]: The malware drops the files in %ProgramFiles% or %appdata%, indicating a process-to-file relationship where the process drops files in specific folders. [Relationships]: <process:malware,drops,file:files in %ProgramFiles% or %appdata%>. \n6. [CoT]: The legitimate Symantec executable, rastlsc.exe, is executed by the malware, indicating a process-to-process relationship where the malware executes the executable. [Relationships]: <process:malware,executes,process:rastlsc.exe>. \n7. [CoT]: Another version of a DLL executes rastlsc.exe with a parameter, indicating a process-to-process relationship where the DLL executes the executable. [Relationships]: <process:{BB7BDEC9-B59D-492E-A4AF-4C7B1C9E646B}.dll,executes,process:rastlsc.exe>. ",
        "semantic_relationship": "[CoT]: The original relationship describes the executable decrypting a resource file using the AES algorithm. In system-level terms, this action corresponds to a Read operation on the resource file, as the process is reading the encrypted data from the file to decrypt it. The AES algorithm is a detail of the encryption method, but the core action is the process reading the file's contents. [System-level Relationships]: <process:executable,Read,file:resource>. \n[CoT]: The original relationship states that the process \"decompresses\" the file using the LZMA algorithm. In system-level terms, this action corresponds to the process reading the compressed data from the file and writing the decompressed output to a new file (as decompression requires both reading and writing). Therefore, the system-level relationship is \"Write\" from the process to the output file. [System-level Relationships]: <process:executable,Write,file:resource:LZMA algorithm output>. \n[CoT]: The original relationship describes the malware creating a registry key to achieve persistence. In system-level terms, creating a registry key is mapped to the 'Createkey' action, as it involves adding a new key to the registry. The 'reg' prefix indicates that the action affects a registry entity. [System-level Relationships]: <process:malware,Createkey,reg:HKCU\\SOFTWARE\\Microsoft\\ Windows\\CurrentVersion\\Run;DeviceAssociationService;rastlsc.exe>. \n[CoT]: The original relationships describe the dropper writing files, which corresponds to the system-level \"Write\" relationship between a process and a file. The action of writing files directly maps to the Process-to-File:Write system-level relationship. [System-level Relationships]: <process:dropper,Write,file:rastlsc.exe>, <process:dropper,Write,file:SyLog.bin>, <process:dropper,Write,file:rastls.dll>. \n[CoT]: The original relationship \"drops\" implies that the malware is creating new files in the specified directories, which aligns with the system-level relationship \"Create\" between a process and a file. [System-level Relationships]: <process:malware,Create,file:files in %ProgramFiles% or %appdata%>. \n[CoT]: The original relationship states that the malware executes the executable rastlsc.exe. In system-level terms, this corresponds to the \"Fork\" relationship between processes, as one process is directly causing another process to start. [System-level Relationships]: <process:malware,Fork,process:rastlsc.exe>. \n[CoT]: The original relationship describes a DLL executing an executable, which directly maps to the system-level 'Fork' relationship between processes. This indicates that the DLL is causing the rastlsc.exe process to start or run. [System-level Relationships]: <process:{BB7BDEC9-B59D-492E-A4AF-4C7B1C9E646B}.dll,Fork,process:rastlsc.exe>. "
    },
    {
        "phase": "execution",
        "content": "As mentioned earlier, the legitimate executable rastlsc.exe is dropped and executed. \nThis executable imports the rastls.dll file, which in this case contains the malicious payload. \nThe internal name of this dll is {7032F494-0562-4422-9C39-14230E095C52}.dll but we've seen other versions like {5248F13C-85F0-42DF-860D-1723EEAA4F90}.dll. All exported functions lead to the execution of the same function. \nThis export tries to read the SyLog.bin file located inside the same folder. Other versions tried to open the file OUTLFLTR.DAT. If that file exists, it is decrypted using AES in CBC mode with a hardcoded, 256-bit key and then decompressed (LZMA compression). \nThe McUtil.dll variant uses a different technique. At first glance, it looks as if like the main function does nothing malicious, but in fact it replaces the .text section of the legitimate mcoemcpy.exe, a side-loaded binary. It generates shellcode whose purpose is to call the function reading the encrypted stage-two  shellcode in the mcscentr.adf file. \nThe following pseudocode is used to create the shellcode: \nThe result is the following assembly listing: ",
        "relationship": "1. [CoT]: The text states that 'the legitimate executable rastlsc.exe is dropped and executed', indicating that the rastlsc.exe process drops and executes itself.   [Relationships]: <process:rastlsc.exe,drops and executes,self>. \n2. [CoT]: The text mentions that 'This executable imports the rastls.dll file', showing that the rastlsc.exe process imports the rastls.dll file.   [Relationships]: <process:rastlsc.exe,imports,file:rastls.dll>. \n3. [CoT]: The text describes that 'This export tries to read the SyLog.bin file', indicating that the rastls.dll process tries to read the SyLog.bin file.   [Relationships]: <process:rastls.dll,tries to read,file:SyLog.bin>. \n4. [CoT]: The text states that 'Other versions tried to open the file OUTLFLTR.DAT', showing that the rastls.dll process (or other versions) tried to open the OUTLFLTR.DAT file.   [Relationships]: <process:rastls.dll,tried to open,file:OUTLFLTR.DAT>. \n5. [CoT]: The text mentions that 'it replaces the .text section of the legitimate mcoemcpy.exe', indicating that the McUtil.dll process replaces the .text section of the mcoemcpy.exe file.   [Relationships]: <process:McUtil.dll,replaces,file:mcoemcpy.exe>. \n6. [CoT]: The text describes that 'it generates shellcode whose purpose is to call the function', showing that the McUtil.dll process generates shellcode that calls the function.   [Relationships]: <process:McUtil.dll,generates,shellcode>. \n7. [CoT]: The text states that 'whose purpose is to call the function reading the encrypted stage-two', indicating that the shellcode calls the function reading the encrypted stage-two.   [Relationships]: <process:shellcode,calls,file:encrypted stage-two>. \n8. [CoT]: The text mentions that 'the function reading the encrypted stage-two shellcode in the mcscentr.adf file', showing that the mcscentr.adf file contains the encrypted stage-two shellcode.   [Relationships]: <process:mcscentr.adf,contains,file:encrypted stage-two shellcode>. ",
        "semantic_relationship": "[CoT]: The term 'drops and executes' in the original relationship implies that the process rastlsc.exe is both creating a new process and executing it. In system-level terms, this is best represented as a 'Fork' relationship, where a parent process (rastlsc.exe) creates and executes a child process (also rastlsc.exe). [System-level Relationships]: <process:rastlsc.exe,Fork,process:rastlsc.exe>. \n[CoT]: The original relationship indicates that the process 'rastlsc.exe' imports the DLL file 'rastls.dll'. In system-level terms, this corresponds to the 'Loadlibrary' relationship between a process and a file. [System-level Relationships]: <process:rastlsc.exe,Loadlibrary,file:rastls.dll>. \n[CoT]: The original relationship indicates that the process 'rastls.dll' tries to read the file 'SyLog.bin'. In system-level terms, this corresponds to the 'Read' action between a process and a file. [System-level Relationships]: <process:rastls.dll,Read,file:SyLog.bin>. \n[CoT]: The original relationship indicates that the process 'rastls.dll' tried to open the file 'OUTLFLTR.DAT'. In system-level terms, this action corresponds to a 'Read' operation, as the process is attempting to access the contents of the file. [System-level Relationships]: <process:rastls.dll,Read,file:OUTLFLTR.DAT>. \n[CoT]: The original relationship states that McUtil.dll \"replaces\" the .text section of mcoemcpy.exe. In system-level terms, replacing a section of an executable file typically involves writing to that section, hence the relationship is converted to \"Write\". This aligns with the Process-to-File action where a process modifies the contents of a file. [System-level Relationships]: <process:McUtil.dll,Write,file:mcoemcpy.exe>. \n[CoT]: The original relationship states that the process 'generates' shellcode. In system-level terms, this action corresponds to the process writing data (shellcode) to memory, hence the 'Write' relationship. The shellcode is being created or modified by the process [McUtil.dll], which aligns with the 'Generate' action in the original relationship. [System-level Relationships]: <process:McUtil.dll,Write,shellcode>. \n[CoT]: The original relationship 'calls' indicates that the shellcode is executing a function that reads the file 'encrypted stage-two'. In system-level terms, this corresponds to a 'Read' operation from the process to the file. [System-level Relationships]: <process:shellcode,Read,file:encrypted stage-two>. \n[CoT]: The original relationship states that the process 'mcscentr.adf' contains the 'encrypted stage-two shellcode' file. In system-level terms, this implies that the process is loading or executing the file, which aligns with the 'Loadlibrary' relationship in the framework. Therefore, 'contains' is converted to 'Loadlibrary'. [System-level Relationships]: <process:mcscentr.adf,Loadlibrary,file:encrypted stage-two shellcode>. "
    },
    {
        "phase": "execution",
        "content": "The shellcode decrypts and loads the library {E1E4CBED-5690-4749-819D-24FB660DF55F}.dll.   \nThe library retrieves its resource and tries to start the service \"DeviceAssociationService\".   \nThe decrypted data also contains shellcode. The latter decrypts the final layer: the backdoor. \nThe variant {92BA1818-0119-4F79-874E-E3BF79C355B8}.dll checks whether rastlsc.exe was executed with krv as the first parameter. If so, then a job is created and rastlsc.exe is executed again, but without the parameter. ",
        "relationship": "1. [CoT]: The text states \"The shellcode decrypts and loads the library {E1E4CBED-5690-4749-819D-24FB660DF55F}.dll\", indicating that the shellcode process performs the action \"decrypts and loads\" on the library file.   [Relationships]: <process:shellcode,decrypts and loads,file:{E1E4CBED-5690-4749-819D-24FB660DF55F}.dll>. \n2. [CoT]: The text states \"The library retrieves its resource and tries to start the service \"DeviceAssociationService\"\", indicating that the library process performs the action \"tries to start\" on the service process.   [Relationships]: <process:{E1E4CBED-5690-4749-819D-24FB660DF55F}.dll,tries to start,process:DeviceAssociationService>. \n3. [CoT]: The text states \"The decrypted data also contains shellcode. The latter decrypts the final layer: the backdoor\", indicating that the shellcode process performs the action \"decrypts\" on the backdoor file.   [Relationships]: <process:shellcode,decrypts,file:backdoor>. \n4. [CoT]: The text states \"The variant {92BA1818-0119-4F79-874E-E3BF79C355B8}.dll checks whether rastlsc.exe was executed with krv as the first parameter\", indicating that the DLL process performs the action \"checks\" on the exe process.   [Relationships]: <process:{92BA1818-0119-4F79-874E-E3BF79C355B8}.dll,checks,process:rastlsc.exe>. \n5. [CoT]: The text states \"If so, then a job is created and rastlsc.exe is executed again, but without the parameter\", indicating that the DLL process performs the action \"executes\" on the exe process.   [Relationships]: <process:{92BA1818-0119-4F79-874E-E3BF79C355B8}.dll,executes,process:rastlsc.exe>. ",
        "semantic_relationship": "[CoT]: The action \"decrypts and loads\" implies two steps: first, the shellcode decrypts the library file, which falls under the \"Decrypt\" relationship between a process and a file. Second, the shellcode loads the library file, which corresponds to the \"Loadlibrary\" relationship between a process and a file. [System-level Relationships]: <process:shellcode,Decrypt,file:{E1E4CBED-5690-4749-819D-24FB660DF55F}.dll>, <process:shellcode,Loadlibrary,file:{E1E4CBED-5690-4749-819D-24FB660DF55F}.dll>. \n[CoT]: The action \"tries to start\" implies that the library process is attempting to launch or initiate the \"DeviceAssociationService\" process. In system-level terms, this corresponds to the \"Fork\" relationship between processes. [System-level Relationships]: <process:{E1E4CBED-5690-4749-819D-24FB660DF55F}.dll,Fork,process:DeviceAssociationService>. \n[CoT]: The original relationship describes the shellcode process decrypting the backdoor file. In system-level terms, this action corresponds to the \"Write\" operation, as the shellcode is modifying the contents of the backdoor file by decrypting it. [System-level Relationships]: <process:shellcode,Write,file:backdoor>. \n[CoT]: The action \"checks\" implies that the DLL process is inspecting or reading data from the rastlsc.exe process. In system-level terms, this corresponds to a \"Inject\" relationship, where one process injects data into another process. [System-level Relationships]: <process:{92BA1818-0119-4F79-874E-E3BF79C355B8}.dll,Inject,process:rastlsc.exe>. \n[CoT]: The original relationship states that the DLL process \"executes\" the EXE process. In system-level terms, this corresponds to the \"Fork\" relationship between processes, as one process is directly causing another process to start. [System-level Relationships]: <process:{92BA1818-0119-4F79-874E-E3BF79C355B8}.dll,Fork,process:rastlsc.exe>. "
    },
    {
        "phase": "execution",
        "content": "The malware retrieves the first 10 bytes of the username (UTF-16), XORs it with the 3-letter UTF-16 mutex_encoding_str string, and encodes it in hex. The result is used as a mutex name. For instance, for a user whose name starts with abc and the key being vwx, the following mutex will be created: \\Sessions\\1\\BaseNamedObjects\\170015001b. \nThe backdoor includes a PE loader that loads the library HTTPProv.dll in memory, calls its entrypoint and then calls the export function named CreateInstance. ",
        "relationship": "1. [CoT]: The text states that the malware retrieves the first 10 bytes of the username (UTF-16), indicating a process-to-file interaction where the malware process retrieves data from the username file. [Relationships]: <process:malware,retrieves,file:username (UTF-16)>. \n2. [CoT]: The text mentions that the malware XORs the retrieved username bytes with a mutex_encoding_str string, showing a process-to-file interaction where the malware performs operations on the username file data. [Relationships]: <process:malware,XORS,file:username (UTF-16)>. \n3. [CoT]: The text describes encoding the XOR result into hex, indicating a process-to-file interaction where the malware processes the XOR output data. [Relationships]: <process:malware,encodes,file:hex result>. \n4. [CoT]: The text states that a mutex is created with a specific name, showing a process-to-file interaction where the malware process creates a mutex file entity. [Relationships]: <process:malware,creates,file:mutex \\Sessions\\1\\BaseNamedObjects\\170015001b>. \n5. [CoT]: The text mentions that the backdoor loads the library HTTPProv.dll, indicating a process-to-file interaction where the backdoor process loads the DLL file. [Relationships]: <process:backdoor,loads,file:HTTPProv.dll>. \n6. [CoT]: The text states that the backdoor calls the entrypoint of HTTPProv.dll, showing a process-to-file interaction where the backdoor process calls a specific function in the DLL file. [Relationships]: <process:backdoor,calls,file:HTTPProv.dll entrypoint>. \n7. [CoT]: The text mentions that the backdoor calls the export function CreateInstance, indicating a process-to-file interaction where the backdoor process calls a specific function in the DLL file. [Relationships]: <process:backdoor,calls,file:CreateInstance export function>. ",
        "semantic_relationship": "[CoT]: The original relationship describes the malware retrieving data from the username file, which implies a read operation on the file. Therefore, the system-level relationship is mapped to 'Read' between the malware process and the username file. [System-level Relationships]: <process:malware,Read,file:username (UTF-16)>. \n[CoT]: The operation 'XORS' implies that the malware is modifying the contents of the 'username (UTF-16)' file by performing a bitwise XOR operation on it. In system-level terms, this modifies the file's data, hence the relationship is mapped to 'Write'. [System-level Relationships]: <process:malware,Write,file:username (UTF-16)>. \n[CoT]: The original relationship \"encodes\" implies that the malware is writing the XOR result data to a file in hex format. Therefore, the system-level relationship is \"Write\" from the process to the file. [System-level Relationships]: <process:malware,Write,file:hex result>. \n[CoT]: The original relationship describes a process creating a file (mutex), which directly maps to the system-level 'Create' relationship between a process and a file. The action of creating a mutex is treated as a regular file creation operation in the system context. [System-level Relationships]: <process:malware,Create,file:mutex \\Sessions\\1\\BaseNamedObjects\\170015001b>. \n[CoT]: The original relationship describes a process loading a DLL file, which directly maps to the system-level relationship 'Loadlibrary' in the Process-to-File category. This indicates that the backdoor process is loading the library HTTPProv.dll into its memory space. [System-level Relationships]: <process:backdoor,Loadlibrary,file:HTTPProv.dll>. \n[CoT]: The original relationship states that the backdoor process \"calls\" the entrypoint of the HTTPProv.dll file. In system-level terms, this interaction is best represented as an \"Execute\" relationship, as the process is invoking or running the function within the DLL file. [System-level Relationships]: <process:backdoor,Execute,file:HTTPProv.dll entrypoint>. \n[CoT]: The original relationship \"calls\" indicates that the backdoor process is executing the CreateInstance export function in the DLL file. In system-level terms, this corresponds to the \"Execute\" relationship between a process and a file. [System-level Relationships]: <process:backdoor,Execute,file:CreateInstance export function>. "
    },
    {
        "phase": "command and control",
        "content": "The backdoor uses a classic TCP communication protocol over port 25123. In order to retrieve the server IP address, the backdoor first creates a particular DNS query. \nThe malware chooses between one of the three domains from the configuration and adds a custom sub-domain generated using two values. The first value is the computer name up to a length of 16 bytes. The second value is the 4-byte version ID. The following Python 2 code implements the encoding algorithm : \nFor instance, if the computer name is random-pc and the version ID is 0x0a841523 then the following domain could be created: \nniggmhggmeggmkggmfggmdggidggngggmjgg.ijhlokga.dwarduong[.]com \nThe following regular expression could be used to flag a C&C server for this backdoor: \n[ghijklmnopabcdef]{4-60}\\.[ghijklmnopabcdef]{8}\\.[a-z]+\\.[a-z]+ \nIf an IP address is resolved for this particular domain, then the malware tries to establish a connection on TCP port 25123. Each sample has three different domain names it can use to find its C&C server. \nAll communication is encrypted using RC4 and compressed with LZMA. It is possible to decrypt the traffic because the key is prepended to the packets. The format is: \n[RC4 key (4 bytes)][encrypted data] \nEach byte of the key is generated using the rand function. Once the packet is decrypted and decompressed, the data follow the format: \n[dw:unknown][dw:unknown][dw:command number][dw:size of data][dw:unknown] [dw:data] \nThe first time the client connects to the server, a UUID is returned and used as a session ID. The latter is stored in the registry key as binary data: HKCU\\SOFTWARE\\Classes\\ AppXc52346ec40fb4061ad96be0e6cb7d16a\\DefaultIcon \nAs mentioned earlier, the backdoor also contains a library called HTTPprov. This library is an alternative way, as a backup, to communicate with the server as a backup. This DLL sends a POST request over the HTTP protocol to communicate. It also supports HTTPS and the usage of a SOCKS5, SOCKS4a or SOCKS4 proxy. The library is statically linked with libcurl. \nOnce its initialization is done, the following registry key is created to instruct the backdoor to use HTTP in future communication with the C&C server: HKCU\\SOFTWARE\\Classes\\ CLSID{E3517E26-8E93-458D-A6DF-8030BC80528B}. \nA generic user agent is used: Mozilla/4.0 (compatible; MSIE 8.0; Windows NT 6.0;   \nTrident/4.0). \nThe most distinctive characteristic of this library is the custom URI encoding algorithm. The resource part of the URI is created using the following pseudocode: \nNOTE: For clarity, the length-checking part has been removed from the snippet. \nFrom this generated string, two numbers are computed based on the custom checksum to obtain a URI: \nBy adding the URI generator of the HTTPprov library, the following URL could be generated: \nhXXp://niggmhggmeggmkggmfggmdggidggngggmjgg.ijhlokga.aisicoin[.]com/ 13/139756-Ses-Ufali-L ",
        "relationship": "1. [CoT]: The text states that the backdoor creates a particular DNS query to retrieve the server IP address, indicating a process-to-socket relationship where the backdoor process creates the DNS query.   [Relationships]: <process:backdoor,creates,socket:DNS query>. \n2. [CoT]: The malware generates a custom sub-domain by encoding the computer name and version ID, indicating a process-to-socket relationship where the malware process creates the domain.   [Relationships]: <process:malware,creates,socket:domain>. \n3. [CoT]: The malware tries to establish a connection to the C&C server on TCP port 25123, indicating a process-to-socket relationship where the malware process connects to the server socket.   [Relationships]: <process:malware,connects,socket:C&C server:25123>. \n4. [CoT]: The backdoor communicates with the C&C server using RC4 encryption, indicating a process-to-socket relationship where the backdoor process communicates with the server socket.   [Relationships]: <process:backdoor,communicates,socket:C&C server>. \n5. [CoT]: The HTTPprov library sends a POST request over the HTTP protocol, indicating a process-to-socket relationship where the library process sends to the HTTP socket.   [Relationships]: <process:HTTPprov,sends,socket:HTTP protocol>. \n6. [CoT]: The HTTPprov library supports the usage of SOCKS proxies, indicating a process-to-socket relationship where the library process uses the SOCKS socket.   [Relationships]: <process:HTTPprov,uses,socket:SOCKS proxy>. \n7. [CoT]: The backdoor creates a registry key to instruct future communication with the C&C server, indicating a process-to-registry relationship where the backdoor process creates the registry key.   [Relationships]: <process:backdoor,creates,reg:HKCU\\SOFTWARE\\Classes\\ AppXc52346ec40fb4061ad96be0e6cb7d16a\\DefaultIcon>. \n8. [CoT]: The HTTPprov library creates a registry key to instruct the backdoor to use HTTP in future communication, indicating a process-to-registry relationship where the library process creates the registry key.   [Relationships]: <process:HTTPprov,creates,reg:HKCU\\SOFTWARE\\Classes\\ CLSID{E3517E26-8E93-458D-A6DF-8030BC80528B}>. \n9. [CoT]: The HTTPprov library sends data using a URL generated by its URI generator, indicating a process-to-socket relationship where the library process sends to the URL socket.   [Relationships]: <process:HTTPprov,sends,socket:URL>. ",
        "semantic_relationship": "[CoT]: The original relationship states that the backdoor process \"creates\" a DNS query, which in system-level terms translates to the process establishing a connection to a socket (in this case, the DNS query represents the socket). The action of creating a network connection is mapped to the \"Connect\" relationship in the system-level framework. [System-level Relationships]: <process:backdoor,Connect,socket:DNS query>. \n[CoT]: The original relationship states that the malware process \"creates\" a socket (domain). In system-level terms, this action corresponds to a process establishing a connection to a socket, which is represented as \"Connect\" in the Process-to-Socket relationship framework. The malware is generating a custom sub-domain, which implies it must connect to a server or socket to do so. [System-level Relationships]: <process:malware,Connect,socket:domain>. \n[CoT]: The original relationship describes a process (malware) connecting to a socket (C&C server on port 25123). In the system-level relationships framework, this corresponds to the 'Connect' relationship between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:C&C server:25123>. \n[CoT]: The original relationship \"communicates\" indicates a network connection between the backdoor process and the C&C server. In system-level terms, this is best represented as a \"Connect\" relationship between the process and the socket. [System-level Relationships]: <process:backdoor,Connect,socket:C&C server>. \n[CoT]: The original relationship indicates that the HTTPprov library process is sending data to a socket, which corresponds to the system-level relationship 'Send' between a process and a socket. [System-level Relationships]: <process:HTTPprov,Send,socket:HTTP protocol>. \n[CoT]: The original relationship \"uses\" between the process and socket indicates that the HTTPprov library is establishing a connection to a SOCKS proxy, which aligns with the system-level relationship \"Connect\" as it involves initiating a network connection. [System-level Relationships]: <process:HTTPprov,Connect,socket:SOCKS proxy>. \n[CoT]: The original relationship describes the backdoor process creating a registry key, which aligns with the system-level 'Createkey' relationship between a process and a registry key. [System-level Relationships]: <process:backdoor,Createkey,reg:HKCU\\SOFTWARE\\Classes\\ AppXc52346ec40fb4061ad96be0e6cb7d16a\\DefaultIcon>. \n[CoT]: The original relationship describes the HTTPprov library creating a registry key, which aligns with the system-level 'Createkey' relationship in the Process-to-Registry category. This indicates the process is writing to the registry to modify settings for future communication. [System-level Relationships]: <process:HTTPprov,Createkey,reg:HKCU\\SOFTWARE\\Classes\\ CLSID{E3517E26-8E93-458D-A6DF-8030BC80528B}>. \n[CoT]: The original relationship indicates that the HTTPprov process is sending data to a socket (URL). In system-level terms, this corresponds to a Process-to-Socket \"Send\" relationship, as the process is transmitting data to a network endpoint. [System-level Relationships]: <process:HTTPprov,Send,socket:URL>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the binary decrypts its resource (XOR with a 128-byte, hardcoded key) and decompresses the decrypted data (LZMA), indicating a process-to-file relationship where the binary decrypts a resource file. [Original Relationships]: <process:binary,decrypts,file:resource (XOR with a 128-byte, hardcoded key)>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (binary) decrypting a resource file using a hardcoded key. In system-level terms, this action corresponds to the 'Read' operation on the file, as the binary is reading the encrypted data to perform the decryption. The 'Write' operation is not involved as the binary is not modifying the resource file's content but rather performing a cryptographic operation on it. [System-level Relationships]: <process:binary,Read,file:resource (XOR with a 128-byte, hardcoded key)>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that the legitimate RobotoSlab-Regular.ttf file is written into the %temp% folder by the binary, which is later run via the Win32 API function ShellExecute, showing a process-to-file relationship in the context of execution. [Original Relationships]: <process:binary,writes,file:%temp%\\RobotoSlab-Regular.ttf>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process writing to a file, which directly corresponds to the system-level 'Write' relationship between a process and a file. The action of writing data to a file is a clear example of Process-to-File:Write in the system-level framework. [System-level Relationships]: <process:binary,Write,file:%temp%\\RobotoSlab-Regular.ttf>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text describes that the shellcode is executed after the decryption of the resource, indicating a process-to-file relationship where the binary decrypts and executes the shellcode file. [Original Relationships]: <process:binary,executes,file:shellcode>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the binary \"executes\" the shellcode file, which directly corresponds to the system-level \"Execute\" relationship between a process and a file. [System-level Relationships]: <process:binary,Execute,file:shellcode>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the shellcode drops another application named %temp%\\[0-9].tmp.exe, showing a process-to-file relationship where the shellcode drops a file. [Original Relationships]: <process:shellcode,drops,file:%temp%\\[0-9].tmp.exe>. ",
                "semantic_relationship": "[CoT]: The term \"drops\" in the original relationship implies that the shellcode creates a new file on the system. In system-level terms, this corresponds to a \"Create\" action between a process and a file. [System-level Relationships]: <process:shellcode,Create,file:%temp%\\[0-9].tmp.exe>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that the shellcode retrieves three Windows API functions: VirtualAlloc, RtlMoveMemory, and RtlZeroMemory, indicating a process-to-process relationship where the shellcode retrieves functions from the Windows API. [Original Relationships]: <process:shellcode,retrieves,process:Windows API functions: VirtualAlloc, RtlMoveMemory and RtlZeroMemory>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the shellcode \"retrieves\" functions from the Windows API. In system-level terms, this action corresponds to the shellcode loading the Windows API functions into its own process memory space, which is best represented by the \"Loadlibrary\" relationship in the Process-to-Process category. [System-level Relationships]: <process:shellcode,Loadlibrary,file:Windows API functions: VirtualAlloc, RtlMoveMemory and RtlZeroMemory>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text describes that the shellcode calls the entry-point function of the decrypted PE, showing a process-to-file relationship where the shellcode executes the decrypted PE file. [Original Relationships]: <process:shellcode,calls,file:decrypted PE>. ",
                "semantic_relationship": "[CoT]: The original relationship \"calls\" indicates that the shellcode is executing the decrypted PE file, which aligns with the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:shellcode,Execute,file:decrypted PE>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that the shellcode then calls the DLLEntry export function, indicating a process-to-file relationship where the shellcode executes the DLLEntry function within the decrypted PE. [Original Relationships]: <process:shellcode,calls,file:DLLEntry export function>. ",
                "semantic_relationship": "[CoT]: The original relationship \"calls\" indicates that the shellcode is executing the DLLEntry export function, which aligns with the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:shellcode,Execute,file:DLLEntry export function>. "
            },
            {
                "phase": "persistence",
                "relationship": "[Description]: The text states that the executable decrypts its resource using the AES algorithm, indicating a process-to-file relationship where the process decrypts a resource file. [Original Relationships]: <process:executable,decrypts,file:resource:AES algorithm>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the executable decrypting a resource file using the AES algorithm. In system-level terms, this action corresponds to a Read operation on the resource file, as the process is reading the encrypted data from the file to decrypt it. The AES algorithm is a detail of the encryption method, but the core action is the process reading the file's contents. [System-level Relationships]: <process:executable,Read,file:resource>. "
            },
            {
                "phase": "persistence",
                "relationship": "[Description]: The text mentions that after decryption, the data are decompressed using the LZMA algorithm, showing a process-to-file relationship where the process decompresses the decrypted data file. [Original Relationships]: <process:executable,decompresses,file:resource:LZMA algorithm>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process \"decompresses\" the file using the LZMA algorithm. In system-level terms, this action corresponds to the process reading the compressed data from the file and writing the decompressed output to a new file (as decompression requires both reading and writing). Therefore, the system-level relationship is \"Write\" from the process to the output file. [System-level Relationships]: <process:executable,Write,file:resource:LZMA algorithm output>. "
            },
            {
                "phase": "persistence",
                "relationship": "[Description]: The malware achieves persistence by creating a service, indicating a process-to-file relationship where the process creates a registry key (HKCU\\SOFTWARE\\Microsoft\\ Windows\\CurrentVersion\\Run;DeviceAssociationService;rastlsc.exe). [Original Relationships]: <process:malware,creates,reg:HKCU\\SOFTWARE\\Microsoft\\ Windows\\CurrentVersion\\Run;DeviceAssociationService;rastlsc.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the malware creating a registry key to achieve persistence. In system-level terms, creating a registry key is mapped to the 'Createkey' action, as it involves adding a new key to the registry. The 'reg' prefix indicates that the action affects a registry entity. [System-level Relationships]: <process:malware,Createkey,reg:HKCU\\SOFTWARE\\Microsoft\\ Windows\\CurrentVersion\\Run;DeviceAssociationService;rastlsc.exe>. "
            },
            {
                "phase": "persistence",
                "relationship": "[Description]: The dropper writes several files to specific folders, indicating process-to-file relationships where the process writes files (rastlsc.exe, SyLog.bin, and rastls.dll). [Original Relationships]: <process:dropper,writes,file:rastlsc.exe>, <process:dropper,writes,file:SyLog.bin>, <process:dropper,writes,file:rastls.dll>. ",
                "semantic_relationship": "[CoT]: The original relationships describe the dropper writing files, which corresponds to the system-level \"Write\" relationship between a process and a file. The action of writing files directly maps to the Process-to-File:Write system-level relationship. [System-level Relationships]: <process:dropper,Write,file:rastlsc.exe>, <process:dropper,Write,file:SyLog.bin>, <process:dropper,Write,file:rastls.dll>. "
            },
            {
                "phase": "persistence",
                "relationship": "[Description]: The malware drops the files in %ProgramFiles% or %appdata%, indicating a process-to-file relationship where the process drops files in specific folders. [Original Relationships]: <process:malware,drops,file:files in %ProgramFiles% or %appdata%>. ",
                "semantic_relationship": "[CoT]: The original relationship \"drops\" implies that the malware is creating new files in the specified directories, which aligns with the system-level relationship \"Create\" between a process and a file. [System-level Relationships]: <process:malware,Create,file:files in %ProgramFiles% or %appdata%>. "
            },
            {
                "phase": "persistence",
                "relationship": "[Description]: The legitimate Symantec executable, rastlsc.exe, is executed by the malware, indicating a process-to-process relationship where the malware executes the executable. [Original Relationships]: <process:malware,executes,process:rastlsc.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the malware executes the executable rastlsc.exe. In system-level terms, this corresponds to the \"Fork\" relationship between processes, as one process is directly causing another process to start. [System-level Relationships]: <process:malware,Fork,process:rastlsc.exe>. "
            },
            {
                "phase": "persistence",
                "relationship": "[Description]: Another version of a DLL executes rastlsc.exe with a parameter, indicating a process-to-process relationship where the DLL executes the executable. [Original Relationships]: <process:{BB7BDEC9-B59D-492E-A4AF-4C7B1C9E646B}.dll,executes,process:rastlsc.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a DLL executing an executable, which directly maps to the system-level 'Fork' relationship between processes. This indicates that the DLL is causing the rastlsc.exe process to start or run. [System-level Relationships]: <process:{BB7BDEC9-B59D-492E-A4AF-4C7B1C9E646B}.dll,Fork,process:rastlsc.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that 'the legitimate executable rastlsc.exe is dropped and executed', indicating that the rastlsc.exe process drops and executes itself.   [Original Relationships]: <process:rastlsc.exe,drops and executes,self>. ",
                "semantic_relationship": "[CoT]: The term 'drops and executes' in the original relationship implies that the process rastlsc.exe is both creating a new process and executing it. In system-level terms, this is best represented as a 'Fork' relationship, where a parent process (rastlsc.exe) creates and executes a child process (also rastlsc.exe). [System-level Relationships]: <process:rastlsc.exe,Fork,process:rastlsc.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that 'This executable imports the rastls.dll file', showing that the rastlsc.exe process imports the rastls.dll file.   [Original Relationships]: <process:rastlsc.exe,imports,file:rastls.dll>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the process 'rastlsc.exe' imports the DLL file 'rastls.dll'. In system-level terms, this corresponds to the 'Loadlibrary' relationship between a process and a file. [System-level Relationships]: <process:rastlsc.exe,Loadlibrary,file:rastls.dll>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes that 'This export tries to read the SyLog.bin file', indicating that the rastls.dll process tries to read the SyLog.bin file.   [Original Relationships]: <process:rastls.dll,tries to read,file:SyLog.bin>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the process 'rastls.dll' tries to read the file 'SyLog.bin'. In system-level terms, this corresponds to the 'Read' action between a process and a file. [System-level Relationships]: <process:rastls.dll,Read,file:SyLog.bin>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that 'Other versions tried to open the file OUTLFLTR.DAT', showing that the rastls.dll process (or other versions) tried to open the OUTLFLTR.DAT file.   [Original Relationships]: <process:rastls.dll,tried to open,file:OUTLFLTR.DAT>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the process 'rastls.dll' tried to open the file 'OUTLFLTR.DAT'. In system-level terms, this action corresponds to a 'Read' operation, as the process is attempting to access the contents of the file. [System-level Relationships]: <process:rastls.dll,Read,file:OUTLFLTR.DAT>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that 'it replaces the .text section of the legitimate mcoemcpy.exe', indicating that the McUtil.dll process replaces the .text section of the mcoemcpy.exe file.   [Original Relationships]: <process:McUtil.dll,replaces,file:mcoemcpy.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that McUtil.dll \"replaces\" the .text section of mcoemcpy.exe. In system-level terms, replacing a section of an executable file typically involves writing to that section, hence the relationship is converted to \"Write\". This aligns with the Process-to-File action where a process modifies the contents of a file. [System-level Relationships]: <process:McUtil.dll,Write,file:mcoemcpy.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes that 'it generates shellcode whose purpose is to call the function', showing that the McUtil.dll process generates shellcode that calls the function.   [Original Relationships]: <process:McUtil.dll,generates,shellcode>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process 'generates' shellcode. In system-level terms, this action corresponds to the process writing data (shellcode) to memory, hence the 'Write' relationship. The shellcode is being created or modified by the process [McUtil.dll], which aligns with the 'Generate' action in the original relationship. [System-level Relationships]: <process:McUtil.dll,Write,file:shellcode>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that 'whose purpose is to call the function reading the encrypted stage-two', indicating that the shellcode calls the function reading the encrypted stage-two.   [Original Relationships]: <process:shellcode,calls,file:encrypted stage-two>. ",
                "semantic_relationship": "[CoT]: The original relationship 'calls' indicates that the shellcode is executing a function that reads the file 'encrypted stage-two'. In system-level terms, this corresponds to a 'Read' operation from the process to the file. [System-level Relationships]: <process:shellcode,Read,file:encrypted stage-two>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that 'the function reading the encrypted stage-two shellcode in the mcscentr.adf file', showing that the mcscentr.adf file contains the encrypted stage-two shellcode.   [Original Relationships]: <process:mcscentr.adf,contains,file:encrypted stage-two shellcode>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process 'mcscentr.adf' contains the 'encrypted stage-two shellcode' file. In system-level terms, this implies that the process is loading or executing the file, which aligns with the 'Loadlibrary' relationship in the framework. Therefore, 'contains' is converted to 'Loadlibrary'. [System-level Relationships]: <process:mcscentr.adf,Loadlibrary,file:encrypted stage-two shellcode>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states \"The shellcode decrypts and loads the library {E1E4CBED-5690-4749-819D-24FB660DF55F}.dll\", indicating that the shellcode process performs the action \"decrypts and loads\" on the library file.   [Original Relationships]: <process:shellcode,decrypts and loads,file:{E1E4CBED-5690-4749-819D-24FB660DF55F}.dll>. ",
                "semantic_relationship": "[CoT]: The action \"decrypts and loads\" implies two steps: first, the shellcode decrypts the library file, which falls under the \"Decrypt\" relationship between a process and a file. Second, the shellcode loads the library file, which corresponds to the \"Loadlibrary\" relationship between a process and a file. [System-level Relationships]: <process:shellcode,Decrypt,file:{E1E4CBED-5690-4749-819D-24FB660DF55F}.dll>, <process:shellcode,Loadlibrary,file:{E1E4CBED-5690-4749-819D-24FB660DF55F}.dll>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states \"The library retrieves its resource and tries to start the service \"DeviceAssociationService\"\", indicating that the library process performs the action \"tries to start\" on the service process.   [Original Relationships]: <process:{E1E4CBED-5690-4749-819D-24FB660DF55F}.dll,tries to start,process:DeviceAssociationService>. ",
                "semantic_relationship": "[CoT]: The action \"tries to start\" implies that the library process is attempting to launch or initiate the \"DeviceAssociationService\" process. In system-level terms, this corresponds to the \"Fork\" relationship between processes. [System-level Relationships]: <process:{E1E4CBED-5690-4749-819D-24FB660DF55F}.dll,Fork,process:DeviceAssociationService>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states \"The decrypted data also contains shellcode. The latter decrypts the final layer: the backdoor\", indicating that the shellcode process performs the action \"decrypts\" on the backdoor file.   [Original Relationships]: <process:shellcode,decrypts,file:backdoor>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the shellcode process decrypting the backdoor file. In system-level terms, this action corresponds to the \"Write\" operation, as the shellcode is modifying the contents of the backdoor file by decrypting it. [System-level Relationships]: <process:shellcode,Write,file:backdoor>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states \"The variant {92BA1818-0119-4F79-874E-E3BF79C355B8}.dll checks whether rastlsc.exe was executed with krv as the first parameter\", indicating that the DLL process performs the action \"checks\" on the exe process.   [Original Relationships]: <process:{92BA1818-0119-4F79-874E-E3BF79C355B8}.dll,checks,process:rastlsc.exe>. ",
                "semantic_relationship": "[CoT]: The action \"checks\" implies that the DLL process is inspecting or reading data from the rastlsc.exe process. In system-level terms, this corresponds to a \"Inject\" relationship, where one process injects data into another process. [System-level Relationships]: <process:{92BA1818-0119-4F79-874E-E3BF79C355B8}.dll,Inject,process:rastlsc.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states \"If so, then a job is created and rastlsc.exe is executed again, but without the parameter\", indicating that the DLL process performs the action \"executes\" on the exe process.   [Original Relationships]: <process:{92BA1818-0119-4F79-874E-E3BF79C355B8}.dll,executes,process:rastlsc.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the DLL process \"executes\" the EXE process. In system-level terms, this corresponds to the \"Fork\" relationship between processes, as one process is directly causing another process to start. [System-level Relationships]: <process:{92BA1818-0119-4F79-874E-E3BF79C355B8}.dll,Fork,process:rastlsc.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the malware retrieves the first 10 bytes of the username (UTF-16), indicating a process-to-file interaction where the malware process retrieves data from the username file. [Original Relationships]: <process:malware,retrieves,file:username (UTF-16)>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the malware retrieving data from the username file, which implies a read operation on the file. Therefore, the system-level relationship is mapped to 'Read' between the malware process and the username file. [System-level Relationships]: <process:malware,Read,file:username (UTF-16)>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that the malware XORs the retrieved username bytes with a mutex_encoding_str string, showing a process-to-file interaction where the malware performs operations on the username file data. [Original Relationships]: <process:malware,XORS,file:username (UTF-16)>. ",
                "semantic_relationship": "[CoT]: The operation 'XORS' implies that the malware is modifying the contents of the 'username (UTF-16)' file by performing a bitwise XOR operation on it. In system-level terms, this modifies the file's data, hence the relationship is mapped to 'Write'. [System-level Relationships]: <process:malware,Write,file:username (UTF-16)>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes encoding the XOR result into hex, indicating a process-to-file interaction where the malware processes the XOR output data. [Original Relationships]: <process:malware,encodes,file:hex result>. ",
                "semantic_relationship": "[CoT]: The original relationship \"encodes\" implies that the malware is writing the XOR result data to a file in hex format. Therefore, the system-level relationship is \"Write\" from the process to the file. [System-level Relationships]: <process:malware,Write,file:hex result>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that a mutex is created with a specific name, showing a process-to-file interaction where the malware process creates a mutex file entity. [Original Relationships]: <process:malware,creates,file:mutex \\Sessions\\1\\BaseNamedObjects\\170015001b>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process creating a file (mutex), which directly maps to the system-level 'Create' relationship between a process and a file. The action of creating a mutex is treated as a regular file creation operation in the system context. [System-level Relationships]: <process:malware,Create,file:mutex \\Sessions\\1\\BaseNamedObjects\\170015001b>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that the backdoor loads the library HTTPProv.dll, indicating a process-to-file interaction where the backdoor process loads the DLL file. [Original Relationships]: <process:backdoor,loads,file:HTTPProv.dll>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process loading a DLL file, which directly maps to the system-level relationship 'Loadlibrary' in the Process-to-File category. This indicates that the backdoor process is loading the library HTTPProv.dll into its memory space. [System-level Relationships]: <process:backdoor,Loadlibrary,file:HTTPProv.dll>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the backdoor calls the entrypoint of HTTPProv.dll, showing a process-to-file interaction where the backdoor process calls a specific function in the DLL file. [Original Relationships]: <process:backdoor,calls,file:HTTPProv.dll entrypoint>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the backdoor process \"calls\" the entrypoint of the HTTPProv.dll file. In system-level terms, this interaction is best represented as an \"Execute\" relationship, as the process is invoking or running the function within the DLL file. [System-level Relationships]: <process:backdoor,Execute,file:HTTPProv.dll entrypoint>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that the backdoor calls the export function CreateInstance, indicating a process-to-file interaction where the backdoor process calls a specific function in the DLL file. [Original Relationships]: <process:backdoor,calls,file:CreateInstance export function>. ",
                "semantic_relationship": "[CoT]: The original relationship \"calls\" indicates that the backdoor process is executing the CreateInstance export function in the DLL file. In system-level terms, this corresponds to the \"Execute\" relationship between a process and a file. [System-level Relationships]: <process:backdoor,Execute,file:CreateInstance export function>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the backdoor creates a particular DNS query to retrieve the server IP address, indicating a process-to-socket relationship where the backdoor process creates the DNS query.   [Original Relationships]: <process:backdoor,creates,socket:DNS query>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the backdoor process \"creates\" a DNS query, which in system-level terms translates to the process establishing a connection to a socket (in this case, the DNS query represents the socket). The action of creating a network connection is mapped to the \"Connect\" relationship in the system-level framework. [System-level Relationships]: <process:backdoor,Connect,socket:DNS query>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware generates a custom sub-domain by encoding the computer name and version ID, indicating a process-to-socket relationship where the malware process creates the domain.   [Original Relationships]: <process:malware,creates,socket:domain>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the malware process \"creates\" a socket (domain). In system-level terms, this action corresponds to a process establishing a connection to a socket, which is represented as \"Connect\" in the Process-to-Socket relationship framework. The malware is generating a custom sub-domain, which implies it must connect to a server or socket to do so. [System-level Relationships]: <process:malware,Connect,socket:domain>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware tries to establish a connection to the C&C server on TCP port 25123, indicating a process-to-socket relationship where the malware process connects to the server socket.   [Original Relationships]: <process:malware,connects,socket:C&C server:25123>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (malware) connecting to a socket (C&C server on port 25123). In the system-level relationships framework, this corresponds to the 'Connect' relationship between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:C&C server:25123>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The backdoor communicates with the C&C server using RC4 encryption, indicating a process-to-socket relationship where the backdoor process communicates with the server socket.   [Original Relationships]: <process:backdoor,communicates,socket:C&C server>. ",
                "semantic_relationship": "[CoT]: The original relationship \"communicates\" indicates a network connection between the backdoor process and the C&C server. In system-level terms, this is best represented as a \"Connect\" relationship between the process and the socket. [System-level Relationships]: <process:backdoor,Connect,socket:C&C server>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The HTTPprov library sends a POST request over the HTTP protocol, indicating a process-to-socket relationship where the library process sends to the HTTP socket.   [Original Relationships]: <process:HTTPprov,sends,socket:HTTP protocol>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the HTTPprov library process is sending data to a socket, which corresponds to the system-level relationship 'Send' between a process and a socket. [System-level Relationships]: <process:HTTPprov,Send,socket:HTTP protocol>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The HTTPprov library supports the usage of SOCKS proxies, indicating a process-to-socket relationship where the library process uses the SOCKS socket.   [Original Relationships]: <process:HTTPprov,uses,socket:SOCKS proxy>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uses\" between the process and socket indicates that the HTTPprov library is establishing a connection to a SOCKS proxy, which aligns with the system-level relationship \"Connect\" as it involves initiating a network connection. [System-level Relationships]: <process:HTTPprov,Connect,socket:SOCKS proxy>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The backdoor creates a registry key to instruct future communication with the C&C server, indicating a process-to-registry relationship where the backdoor process creates the registry key.   [Original Relationships]: <process:backdoor,creates,reg:HKCU\\SOFTWARE\\Classes\\ AppXc52346ec40fb4061ad96be0e6cb7d16a\\DefaultIcon>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the backdoor process creating a registry key, which aligns with the system-level 'Createkey' relationship between a process and a registry key. [System-level Relationships]: <process:backdoor,Createkey,reg:HKCU\\SOFTWARE\\Classes\\ AppXc52346ec40fb4061ad96be0e6cb7d16a\\DefaultIcon>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The HTTPprov library creates a registry key to instruct the backdoor to use HTTP in future communication, indicating a process-to-registry relationship where the library process creates the registry key.   [Original Relationships]: <process:HTTPprov,creates,reg:HKCU\\SOFTWARE\\Classes\\ CLSID{E3517E26-8E93-458D-A6DF-8030BC80528B}>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the HTTPprov library creating a registry key, which aligns with the system-level 'Createkey' relationship in the Process-to-Registry category. This indicates the process is writing to the registry to modify settings for future communication. [System-level Relationships]: <process:HTTPprov,Createkey,reg:HKCU\\SOFTWARE\\Classes\\ CLSID{E3517E26-8E93-458D-A6DF-8030BC80528B}>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The HTTPprov library sends data using a URL generated by its URI generator, indicating a process-to-socket relationship where the library process sends to the URL socket.   [Original Relationships]: <process:HTTPprov,sends,socket:URL>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the HTTPprov process is sending data to a socket (URL). In system-level terms, this corresponds to a Process-to-Socket \"Send\" relationship, as the process is transmitting data to a network endpoint. [System-level Relationships]: <process:HTTPprov,Send,socket:URL>. "
            }
        ]
    }
]