[
    {
        "level": 0,
        "content": "Real-Time Anti-Phishing: Essential Defense Against Evolving Cyber Threats"
    },
    {
        "level": 3,
        "content": "Phishing remains one of the most prevalent cybersecurity threats worldwide, posing risks such as financial loss, data theft, reputational harm, and malware deployment. As phishing tactics grow more sophisticated, attackers are also expanding their targets across various platforms and services. The use of AI has further refined these techniques, making phishing attempts more deceptive and harder to detect. Attackers increasingly use personalized messages and convincing fake websites to evade traditional security measures, making detection more difficult for security teams."
    },
    {
        "level": 3,
        "content": "Organizations must strengthen their defenses to keep pace with the rapidly evolving threat landscape. While traditional defenses like email filters and blacklists can block known threats, they are less effective against emerging and AI-driven phishing attacks. Real-time anti-phishing (RTAP) solutions help address this challenge by using AI and machine learning to identify and mitigate both large-scale phishing campaigns and highly targeted spear-phishing attacks as they occur."
    },
    {
        "level": 3,
        "content": "According to the 2024 Verizon DBIR report, the median time for a user to fall prey to a phishing email is less than 60 seconds.[1]"
    },
    {
        "level": 1,
        "content": "Data-Driven Insights: A Closer Look at Recent Phishing Trends"
    },
    {
        "level": 3,
        "content": "Over the past several weeks, threat data gathered by FortiGuard Labs reveals critical insights into the nature of phishing campaigns and the primary targets. These insights provide a snapshot of how cybercriminals are evolving their tactics to reach unsuspecting users."
    },
    {
        "level": 3,
        "content": "1. Facebook is a Consistent Target: Our recent monitoring of phishing attacks has shown Facebook to a top target for phishing emails. Its widespread use and abundant personal information associated with accounts make it appealing to cybercriminals seeking to steal login credentials or exploit user data. Many phishing websites attempt to deceive users by claiming their account has been disabled or requires verification."
    },
    {
        "level": 3,
        "content": "2. Roblox Targeting: In mid-February, a spike in phishing attempts targeted Roblox, a popular gaming platform among younger users. Phishing emails appeared disguised as account alerts or prize notifications, prompting victims to click on malicious links or provide sensitive or personal details."
    },
    {
        "level": 3,
        "content": "3. Broad Targeting the End of January: The final days of January saw a broad range of platforms targeted by phishing attempts. These included:"
    },
    {
        "level": 3,
        "content": "oTelegram:A widely used and encrypted messaging app.oIonos:A Germany-based email, hosting, and cloud services provider.oCoinbase:A popular cryptocurrency exchange.oPayPal:A worldwide used online payment system.oLazada:An e-commerce platform operating primarily in Southeast Asia.oiTrust:A cryptocurrency platform.oVkontakte:A Russian social media platform."
    },
    {
        "level": 1,
        "content": "AI-powered Real-Time Anti-Phishing from FortiGuard Labs"
    },
    {
        "level": 3,
        "content": "FortiGuard Labs provides an advanced RTAP service as part of our FortiSandbox Advanced AI Subscription Bundle. This service provides comprehensive and proactive protection against phishing emails and other cyber threats."
    },
    {
        "level": 3,
        "content": "The RTAP solution built into FortiSandbox uses a variety of techniques to identify and block phishing emails, including:"
    },
    {
        "level": 3,
        "content": "Machine learning.Machine learning algorithms are used to identify patterns in phishing emails that are not easily detected by traditional techniques \nURL reputation.This technique checks the reputation of a URL embedded in an email against a list of known phishing URLs. \nContent analysis.RTAP analyzes email content for keywords or phrases commonly used in phishing emails."
    },
    {
        "level": 3,
        "content": "RTAP from FortiGuard Labs ensures that even previously unseen and unknown phishing attempts—which may not be recognized by traditional security systems—are detected and blocked."
    },
    {
        "level": 1,
        "content": "Employee Awareness: A Strategic Tool Against Phishing"
    },
    {
        "level": 3,
        "content": "Human error remains one of the primary reasons phishing attacks succeed, making employee awareness and education essential for defense. Training staff to recognize and report phishing attempts can significantly reduce an organization’s risk. A well-informed workforce serves as the first line of defense against today’s increasingly sophisticated phishing tactics. The 2024 Verizon DBIR highlights this challenge, revealing that 68% of all breaches involved a non-malicious human factor—either through social engineering or unintentional mistakes.[1]"
    },
    {
        "level": 3,
        "content": "Fortinet’sFortiPhishandFortiSATempower organizations to strengthen their human firewall. FortiPhish provides phishing simulation and awareness training, while FortiSAT provides critical security awareness training to create a cyber-aware workforce. Implementing these proactive training tools will enhance employee awareness, bolster technical defenses, and reduce the risk of successful phishing attacks."
    },
    {
        "level": 1,
        "content": "Staying Ahead of Evolving Phishing Threats"
    },
    {
        "level": 3,
        "content": "As phishing attacks grow more sophisticated, real-time, adaptive cybersecurity solutions are crucial for effective defense. FortiGuard’s advanced anti-phishing capabilities, powered by AI and machine learning, provide continuous protection by detecting and neutralizing new phishing techniques as they emerge. With RTAP’s real-time threat response, FortiGuard helps businesses and individuals safeguard their digital environments to reduce risk and stay ahead of cybercriminals."
    },
    {
        "level": 1,
        "content": "IOCs"
    },
    {
        "level": 3,
        "content": "[facebook]case-id-10012125556[.]vercel[.]apppolicy-violation-10002321704[.]github[.]io"
    },
    {
        "level": 3,
        "content": "[roblox]robux-generator---cpa[.]firebaseapp[.]comrbxodi[.]blogspot[.]com"
    },
    {
        "level": 3,
        "content": "[telegram]www[.]telegramtgtg[.]comwww[.]91gsh[.]com"
    },
    {
        "level": 3,
        "content": "[ionos]67a34b6bfc0d210a820d0cf5--brilliant-mermaid-bad0bd[.]netlify[.]appgworldhomes[.]com/ionos-ag/ionos-es/login/login[.]php"
    },
    {
        "level": 3,
        "content": "[coinbase]000414-coinbase[.]comcoinbsphnnumbe[.]gitbook[.]io/us"
    },
    {
        "level": 3,
        "content": "[paypal]paypalloginonline[.]blogspot[.]comniemalssoeder[.]de/c/index/myaccount"
    },
    {
        "level": 3,
        "content": "[vkontakte]uncloabatles[.]ru/votes/7838610vim[.]vimeo18[.]ru/votes/3818905"
    },
    {
        "level": 3,
        "content": "[1]https://www.verizon.com/business/resources/infographics/2024-dbir-infographic.pdf"
    }
]