[
    {
        "title": "Foreword",
        "content": "DustySky (called \"NeD Worm\" by its developer) is a multi-stage malware in use since May 2015. It is in use by the Molerats (aka Gaza cybergang), a politically motivated group whose main objective, we believe, is intelligence gathering.  Operating since 2012, the group's activity has been reported by Norman 1, Kaspersky2,3, FireEye4, and PwC5. \nThis report revolves around a campaign that includes a new malware developed by a member of the group or on behalf of the group. Based on dozens of known attacks and the vast infrastructure in use - we estimate that a wave of targeted malicious email messages has been sent on a weekly basis. \nThese attacks are targeted, but not spear-phished. I.e., malicious email messages are sent to selected targets rather than random mass distribution, but are not tailored specifically to each and every target. Dozens of targets may receive the exact same message. The email message and the lure document are written in Hebrew, Arabic or English - depending on the target audience. \nTargeted sectors include governmental and diplomatic institutions, including embassies; companies from the aerospace and defence Industries; financial institutions; journalists; software developers. \nThe attackers have been targeting software developers in general, using a fake website pretending to be a legitimate iOS management software, and linking to it in an online freelancing marketplace. \nMost targets are from the Middle East: Israel, Egypt, Saudi Arabia, United Arab Emirates and Iraq. The United States and countries in Europe are targeted as well. "
    },
    {
        "title": "Delivery",
        "content": "The attackers would usually send a malicious email message that either links to an archive file (RAR or ZIP compressed) or has one attached to it.  Below are malicious email messages that have been sent to multiple targets on September and December 2015. \n The link may include these parameters: \n Id - the ID of the current wave of malicious email messages, composed of a plaintext word, a plus sign, and a number. For example: Rand+281   \n token1 - same as id, but Base64 encoded   \n token2 - Base64 encoded email address of the target to which the malicious message was sent.   \n C - the word Click or openexe \nThe following regular expression matches the structure of malicious links: \\/[A-Za-z]+\\.php\\?((?:id|token1|token2|C)=[A-Za-z0-9\\/=+%]\\*={0,2}&?){4}.\nFor example:   \nspynews.otzo[.]com/20151104/Update.php?id=>redacted>&token1 $=$ >redacted>&token2 $\\asymp$ >redacted>&C=Cli   \nck \nThe archive contains an .exe file, sometimes disguised as a Microsoft Word file, a video, or another file format, using the corresponding icon. For example: "
    },
    {
        "title": "Lure content and sender identity",
        "content": "If the victim extracts the archive and clicks the .exe file, the lure document or video are presented while the computer is being infected with DustySky. \nIn recent samples the group used Microsoft Word files embed with a malicious macro, which would infect the victim if enabled. Note, that these infection methods rely on social engineering - convincing the victim to open the file (and enabling content if it is disabled) - and not on software vulnerabilities. \nThe subject line of the malicious email message, as well as the name and content of the lure document, are usually related to recent events in diplomacy, defense, and politics. Sometimes lure topics are gossip or sex related and might even include a pornographic video. In recent samples, fake invoices and a copy of the public Google privacy policy were used. \nThe content of the lure document is always copied from a public news item or other web content, and is never an original composition of the attackers. \nThe \"from\" field in malicious messages is usually set to be related to the lure document, such as \"Latest Israel news\", \"Israeli Hot Stories\", \"Israel Defense Forces\", \"تاسايسلل تاراملإا زكرم\" (impersonates the Emirates Policy Center organization6). \nWhen linked from the malicious message, the malware would be hosted either on a cloud service (many times in copy.com, a legitimate file hosting service), or on a server controlled by the attackers. "
    },
    {
        "title": "Phishing",
        "content": "When the malware is hosted on a server controlled by the attackers, the User-Agent string of the target's browser is checked when they click the malicious link. If the target is using Windows, DuskySky is served. If the operating system is different than Windows, the target is served a Google, Microsoft, or Yahoo phishing page: \nThe source code of the phishing page is made up of a single JavaScript block, which at runtime decodes a single variable into HTML: \nAfter the victim fills in and sends the fake login form, they are redirected to a legitimate website. For example, in one case the victim was redirected to a news item7 in the Israeli news website NRG. Only the news item was old (from one year prior to the attack) and unrelated to the original subject of the malicious email message. It was probably used in previous attacks, and the attackers did not care enough or forgot to change it to a relevant one. "
    },
    {
        "title": "Attacks against software developers",
        "content": "IP address 45.32.13.169 and all the domains that are pointing to it8 host a webpage which is a copy of a legitimate and unrelated software website - iMazing, an iOS management software. \nAmong the domains is a similar looking one - imazing[.]ga. \nThe source code of the fake website reveals that it was copied from the legitimate source on 22 October 2015: \nThe fake website, similarly to the legitimate one, offers visitors to download the iMazing software. However, the version on the fake website is bundled with DustySky malware. Upon execution of the malicious version (2f452e90c2f9b914543847ba2b431b9a) the legitimate iMazing is installed, while in the background DustySky is dropped as a file named Plugin.exe (1d9612a869ad929bd4dd16131ddb133a), and executed: \nPlugin.exe immediately starts communicating with its command and control sever using the hardcoded address ns.suppoit[.]xyz and supo.mefound[.]com, both also pointing to above mentioned 45.32.13.169. \nInterestingly, we found the fake domain imazing[.]ga mentioned in a job posting9 in the freelancers marketplace website freelancer.com. In the posting, the attackers claim they are looking for someone to build \"an application like that this website [sic]\" and entice the viewer to \"download application and take an overlook [sic]\" from imazing[.]ga and \"Let me know if any idea is missing or...\". \nThis behavior deviates from the attackers' usual pattern of sending malicious email to selected (albeit many) individuals. It is unclear to us why they would go after random infections, but we can imagine various reasons, such as access to computers which would be used as proxies for attacks, or access to licenses for software owned by the victims. "
    },
    {
        "title": "Post infection",
        "content": "This section describes the actions performed by the attackers on infected computers we have investigated. \nAfter infecting the computer, the attackers used both the capabilities of DustySky, and those of public hacking tools they had subsequently downloaded to the computer. \nThey took screenshots and a list of active processes in the computer, and sent them to their command and control severs. They used BrowserPasswordDump10, a public and free-to-use tool that recovers passwords saved in browsers. Below is the log file (empty in this case) that we recovered after the attackers had deleted it: \nThe malware would also scan the computer for files that contain certain keywords. The list of keywords, in base64 format, is retrieved from the command and control as a text file. For example: \nBelow are the encoded strings from the above image, decoded and translated: These words teach us what the attackers are after: personal documents; credentials, certificates and private keys; information pertaining to homeland security."
    },
    {
        "title": "Abusing breached email account",
        "content": "In one case, the attackers used stolen email credentials and logged in from 96.44.156.201, potentially their proxy or VPN endpoint. They also logged in from 5.101.140.118 , an IP address that belongs to a proxy service called privatetunnel.com (in previous incidents, emails were sent from a nearby address - 5.101.140.114). "
    },
    {
        "title": "Malware analysis",
        "content": "DustySky (called NeD by its developer) is a multi-stage malware written in .NET. This chapter reviews its functionality and main features. The sample analyzed is f589827c4cf94662544066b80bfda6ab from late August 2015. It is composed of a DustySky dropper, DustySky core, and the DustySky keylogging component. "
    },
    {
        "title": "DustySky dropper",
        "content": "The DustySky dropper tries to evade running in a virtual machine. Once sure the computer is not a VM, it extracts, runs and adds persistency to DustySky Core. It extracts basic information about the operating system and checks for the existence of an Antivirus. It also extracts and opens the lure document. \nThe dropper's resources are two components that are dropped at run time. One is the lure document (internally called \"news\"), which is presented to the victim once the dropper is executed. The other is DustySky Core, a Trojan backdoor, (internally called ${}^{\\prime\\prime}|0g^{\\prime\\prime}|$ ). \nThe dropper uses the following function to obfuscate the name of functions and other parts of the malware (In later versions, SmartAssembly 6.9.0.114 .NET obfuscator was used): \npublic static string ?31?(string P31?) int length $=$ 231?.Length; char[]  array $=$ new char[length]: for (int ${\\textbf{i}}={\\boldsymbol{\\theta}}$ i $\\prec$ array.Length; $\\mathrm{i}{+}+$ 1 char C $=$ 231?[i]; byte b $=$ (byte)((int)c ^ length - i); byte b2 $=$ (byte)((int)(c >> 8)  i); array[i] $=$ (char)((int)b2 << 81(int)b); return string.Intern(new string(array)): \nSo, for example, the following string: \nRegistrykey registryKey $=$ Registry.CurrentUser.OpenSubKey(\"sOFTWARE\\VMicrosoft\\\\Windows\\CurrentVersion\\\\Run\", true); Is encoded as: RegistryKey registryKey $\\r=$ Registry.CurrentUser0pensuby(331(\\~8)A), true); \nFor VM evasion the dropper checks whether there is a DLL that indicate that the malware is running in a virtual machine (vboxmrxnp.dll and vmbusres.dll which indicate vitualbox and vmGuestlib.dll which indicates vmware). \nIf the dropper is indeed running in a virtual machine, it will open the lure document and stop its activity: \nif (File.Exists(Environment.GetFolderPath(Environment.SpecialFolder.System) + \"\\\\zvmGuestLib.dll\")) File.WriteAllBytes(tempPath $^+$ \"\\\\News.doc\", Resources.News); Process.Start(tempPath $^+$ return; Application.Exit(); return; (File.Exists(Environment.GetEnvironmentVariable(\"windir\") $^+$ 1 File.WriteAllBytes(tempPath $^+$ \"\\\\News.doc\", Resources.News); Process.Start(tempPath $^+$ return; Application.Exit(); return; \nThe dropper uses Windows Management Instrumentation11 to extract information about the operating system and whether an antivirus is active. \nDustySky Core is dropped to $\\%T E M P\\%$ and runs using either cmd or the .NET interface. \nnew Process   \n{ StartInfo $=$ new ProcessStartInfo { WindowStyle $=$ ProcessWindowStyle.Hidden, FileName $\\rightleftharpoons$ \"cmd.exe\", Arguments $=$ tempPath, text2, exe   \n}.Start();   \nThread.Sleep(4000) ;   \nApplication.Exit();   \nreturn;   \nProcess.Start(tempPath $^+$ text2 $^+$   \nApplication.Exit();   \nreturn; \nA registry entry is created for persistency after computer restart: "
    },
    {
        "title": "DustySky core",
        "content": "DustySky Core is a Trojan backdoor and the main component of the malware. It communicates with the command and control server, exfiltrates collected data, information and files, and receives and executes commands.  It has the following capabilities: \nCollecting information about the OS version, running processes and installed software.   \n Searching for removable media and network drives, and duplicating itself into them.   \n Extracting other components (such as the keylogging component) or receiving them from the command and control server, and running or removing them. Evading virtual machines. Turning the computer off or restarting it. Making sure only a single instance of the malware is running. \nThe keylogging log file is uploaded to the server every 50 seconds. The files are uploaded via a POST request to a URL that ends with key.php. "
    },
    {
        "title": "DustySky keylogging component",
        "content": "One of the components contained in DustySky core is a keylogger (for example   \n15be036680c41f97dfac9201a7c51cfc). When ordered by the command and control server, the keylogger is extracted and executed. Keylogging logs are saved to %TEMP%\\temps . "
    },
    {
        "title": "pdb analysis",
        "content": "pdb strings in DustySky sample were structured as follows: \nb:\\World-2015\\IL\\Working Tools\\2015-12-27 NeD Ver 9 Rand - 192.169.6.199\\NeD Worm\\obj\\x86\\Release\\MusicLogs.pdb \npdb strings from 23 samples are presented in \"Appendix B - Indicators\". In the table below we present a breakdown of folders and file names comprising the pdb strings, to reflect the ongoing development cycle of DustySky since its first release in May 2015. "
    },
    {
        "title": "Traffic examples",
        "content": "Following are samples of communication with the command and control server (identifiers have been altered). \nDustySky has two hardcoded domains of command and control servers. It starts by checking if the first one is alive by sending a GET request to TEST.php or index.php, expecting ${}^{\\prime\\prime}{\\mathsf{O K}}^{\\prime\\prime}$ as response. If it does not receive an OK, it will try a second domain. \nIPAddress iPAddress = array2[i];   \nbyte[] byte_ = SendRequest.smethod_0(Classl1.webclient_0, StringConnect.smethod_0(\"https://\", iPAddress, \"/TEST.php   \nstring string_6 = Delegate95.smethod_0(Delegate141.smethod_0(), byte_);   \nif (strcmp.smethod_o(string_6, \"ok\")) Class11.ho = Class11.EviluRL1; Classl1.url = Delegate98.smethod_0(\"https://\", Delegate105.smethod_0(iPAddress)); goto IL_8F7;\nRecently, command and control communication changed from HTTP to HTTPS. The digital certificate used in the HTTPS traffic is either self-signed or uses a legitimate Comodo issued certificate. \nThe domain bulk-smtp[.]xyz, which is owned by the attackers, uses the following digital certificate: \nPrior to using the Comodo issued certificate, the attackers used a self-signed certificate, impersonating a TelAviv, Israel based company called EMS. The organizational unity in the certificate is \"Email Markting Sales\" (note the misspelling of \"marketing\"). \nFor another domain, smtp.gq, this self-signed certificate was used:\nDustySky communication uses some or all of the following paths when communicating with its command and control server: \nUpdate.php conn.php geoiploc.php news.htm pass.php passho.php passyah.php "
    }
]