[
    {
        "phase": "initial access",
        "content": "During this investigation, Talos could not find any email or social media posts that were somehow linked to the Micropsia implants. However, we found the implants and compressed files containing the implants. This follows the same pattern that we described in our 2017 post about this actor. It is highly likely that the threat actor has continued to use the email vector to deliver their lures and implants. ",
        "relationship": "[Relationships]: None."
    },
    {
        "phase": "execution",
        "content": "One of these timers is responsible for extracting the decoy document and saving it to the %TEMP% folder and then displaying it via ShellExecute: \nloc_6D9030:  \npush 1  \npush θ  \npush θ  \npush offset Parameters :  \npush [ebp+lpDirectory] ; lpDirectorypush offset Parameters ;  \n1ea eax, [ebp+var_20]  \nmov edx, 3  \ncall sub_40ACB0  \nmov eax, [ebp+var_20]  \ncall sub_40A9C0  \npush eax ;lpFile  \npush offset aOpen_0 ; lpoperationpush θ ; hwnd  \ncall shell32_ShellExecuteW  \nxor eax, eax  \npop edx  \n[pop ecx  \npop ecx  \nmov fs:[eax], edx  \njmp short 1oc_6D90BB\nDecoy document extracted and displayed to the target. \nNow, if the implant is started with the \"-start\" command-line switch, it will skip the process for dropping and displaying the decoy document and jump straight to its RAT functionalities. ",
        "relationship": "1. [Relationships]: <process:shell32_ShellExecuteW,display,file:%TEMP% folder>. \n2. [Relationships]: <process:implant,skip,process:process for dropping and displaying the decoy document>. "
    },
    {
        "phase": "persistence",
        "content": "Another timer is used to establish persistence for the implant on the endpoint. \nHere, the implant will establish persistence by obtaining its current command line, which is then used to create a shortcut for itself in the %TEMP% directory. The shortcut to run the implant contains the \"-start\" switch (used to skip the displaying of the decoy document). This shortcut is then moved over to the currently logged-in user's Startup folder to complete persistence across reboots and re-logins. ",
        "relationship": "1. [Relationships]: <process:implant,obtain,file:current command line>. \n2. [Relationships]: <process:implant,create,file:%TEMP% directory shortcut>. \n3. [Relationships]: <process:implant,move,file:Startup folder shortcut>. "
    },
    {
        "phase": "collection",
        "content": "The remaining two timers will gather preliminary system information and activate the RAT capabilities of the implant. \nThe sequence of actions followed for gathering system information from the endpoint are as follows: \n1. Generate a pc ID for the infected endpoint. Save this value into a data file, such as: \"%APPDATA%\\dsfjj45k.tmp\" \n2. Gather the Computername and username from ENV. Concatenate the computername, username and pcid into format: <COMPNAME>_<username>_<pcid> \n3. Gather installed AV information from the endpoint via \"winmgmts:\\\\localhost\\root\\SecurityCenter2\" using query \"SELECT \\* FROM AntiVirusProduct\". From the AV information obtained, record the DisplayName. \n4. Get OS information specifically the installed product name. \n5. Get the current implant's command line and record it. \nAll this data gathered from the system is individually base64-encoded and assigned to HTTP form query variables with the following name-value pairs: \nvcqmxylcv= base64 encoded <COMPNAME>_<username>_<pcid> vcnwaapcv= base64 encoded AV Name list.   \nvcllgracv= base64 encoded OS version string.   \nvcwjlxycv= base64 encoded implant command line.   \nvccodwfcv= base64 encoded hardcoded flag. \nThe data is then sent to the implant's C2 server via an HTTP POST request, which is fairly standard in Micropsia implants. ",
        "relationship": "1. [Relationships]: <process:Generate,save,file:%APPDATA%\\dsfjj45k.tmp>. \n2. [Relationships]: <process:implant,gather,reg:ENV>. \n3. [Relationships]: <process:implant,concatenate,file:%APPDATA%\\dsfjj45k.tmp>. \n4. [Relationships]: <process:implant,gather,reg:winmgmts:\\\\localhost\\root\\SecurityCenter2>. \n5. [Relationships]: <process:implant,record,file:implant command line>. \n6. [Relationships]: <process:implant,assign,file:HTTP form query variables>. \n7. [Relationships]: <process:implant,send,socket:implant's C2 server>. "
    },
    {
        "phase": "command and control",
        "content": "Once the preliminary information has been sent, the implant now begins its remote access trojan (RAT) activity and waits for command codes from the C2 server. \nThe implant now uses two additional HTTP form variables to transmit the output of the commands executed on the endpoint: \nvcgqjdlrcv = hardcoded value 0.   \nmugnaq = base64 encoded screenshot or command output. \nThe C2 issues distinct command codes to the implant to carry out various actions on the infected endpoint. \nThe commands follow the format: ;<cmd_code>;<base64_encoded_supporting_data> \nThe above example would run the ipconfig command on the endpoint. \nThe command codes accepted by the implant are listed here: \nWe have observed implants using two distinct URLs to instrument communications with the C2, one for exfiltration of screenshots and the other for all the other RAT commands. \nFor example one of the implants used a distinct URL for screenshots: \nhxxp[s]://deangelomcnay[.]news/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/ZCgbo9EVhYMA8PX While another URL was used for all other commands: \nhxxp[s]://deangelomcnay[.]news/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/bu5EmpJE7DUfzZD ",
        "relationship": "1. [Relationships]: <process:implant,uses,socket:http[s]://deangelomcnay[.]news/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/ZCgbo9EVhYMA8PX>. \n2. [Relationships]: <process:implant,uses,socket:http[s]://deangelomcnay[.]news/qWIlIdKf2buIH0k/GbrHoIfRqtE69hH/bu5EmpJE7DUfzZD>. "
    }
]