[
    {
        "phase": "execution",
        "content": "QBot PowerShell analysis\nWhen run for the first time, the script creates a new registry key entry in the same path, saving the date of execution. It then verifies upon execution if the creation date key of this registry key is older than 4 hours.\nBased on the outcome, it will either: (1) retrieve the base64-encoded Qbot payload from the Windows Registry, decode it, save it on the file system and execute it.\nOR (2) Fetch the QBot payload remotely using one of the active C2 IPs using theInvoke-WebRequestPowerShell module:\nThe PS script contains built-in logic to execute various types of payloads including batch and Visual Basic files.\nThe encoded QBot DLL that was stored in the registry, was dropped in the directory%APPDATA%\\Roaming\\Microsoft\\Fdopitcu. The unsigned DLL, with descriptorCancel Autoplay 2was executed usingregsvr32.exe\nUpon execution of this second-stage DLL, various registry keys were created inHKCU\\Software\\Microsoft\\Yerqbqokc.In addition, a new instance of explorer.exe (32-bit) was started and injected into.\nThe registry keys contain eight-character long hex strings for which we believe is part of the malware's encryptedconfig.",
        "relationship": "1. [Relationships]: <process:QBot PowerShell,creates,reg:registry key>. \n2. [Relationships]: <process:QBot PowerShell,verifies,reg:registry key>. \n3. [Relationships]: <process:QBot PowerShell,retrieve,file:%APPDATA%\\Roaming\\Microsoft\\Fdopitcu>. \n4. [Relationships]: <process:QBot PowerShell,fetch,socket:C2 IPs>. \n5. [Relationships]: <process:QBot PowerShell,execute,file:payloads>. \n6. [Relationships]: <process:regsvr32.exe,executes,file:unsigned DLL>. \n7. [Relationships]: <process:QBot PowerShell,creates,reg:HKCU\\Software\\Microsoft\\Yerqbqokc>. \n8. [Relationships]: <process:QBot PowerShell,starts,process:explorer.exe>. \n9. [Relationships]: <process:QBot PowerShell,injects,process:explorer.exe>. "
    },
    {
        "phase": "privilege escalation",
        "content": "Thirty minutes after gaining initial access, the threat actors ran an executable file on the beachhead to exploit CVE-2020-1472, Zerologon.\nThe executable was named \"cool.exe\" :\nThree milliseconds after theZerologonexploit, an event 4742 \"A computer account was changed.\" was generated on the targeted Domain Controller.\nAs explained in a detailed blog fromCrowdStrike, the ZeroLogon CVE relies on the AES-CFB8 algorithm used with a zero IV :\nAs we can see on the network captures, a brute-force attack was performed in order to spoof the identity of the domain controller :\nAfter the end of the brute force traffic, we can see a single instance where a the exploit has completed successfully.\nAfter being successfully authenticated, the DC password was set:\nThe PasswordLastSet field is equal to the TimeCreated field, meaning that the password of the domain controller was successfully updated.We can also see that the SubjectUserName is ANONYMOUS LOGON.\nA connection was performed from thebeachheadto the Domain Controller using the DC account.After authenticating to the DC with the DC account, the threat actors dumped the Domain Admin hash, and then reset the DC password in order to unbreak the Active Directory Domain.\nThe explorer shell was also restarted by the threat actor:",
        "relationship": "1. [Relationships]: <process:executable file,ran,process:beachhead>. \n2. [Relationships]: <process:threat actors,changed,process:computer account>. \n3. [Relationships]: <process:threat actors,performed,process:brute-force attack>. \n4. [Relationships]: <process:threat actors,authenticated,process:DC>. \n5. [Relationships]: <process:threat actors,dumped,process:Domain Admin hash>. \n6. [Relationships]: <process:threat actors,reset,process:DC password>. \n7. [Relationships]: <process:threat actors,restarted,process:explorer shell>. "
    },
    {
        "phase": "defense evasion",
        "content": "Upon execution of the initial DLL, QBot uses process hollowing to start a suspended instance of explorer.exe (32-bit) and then injects itself into this process.\nThe injected explorer.exe process was used to spawn and inject into additional instances of explorer.exe (32-bit). An example event can be seen below. Source PID 10492 belonging to QBot, injected a DLL into PID 4072 which we discovered was part of Cobalt Strike C2 communication.\nOver-Pass-the-Hash from Beachhead\nThe threat actor obtained the NTLM hash value of the administrator account through the Zerologon exploit and used over-pass-the-hashto request a TGT from the domain controller.We have seen the use of over-pass-the-hash several times before. For example, ourCobalt Strike Defender Guidecovers detection of this technique in more detail.\nSoon after, a TGT for the administrator account was requested:",
        "relationship": "[Relationships]: n/a"
    },
    {
        "phase": "discovery",
        "content": "QBot initially starts a number of processes to collect information about the affected system. This is part of the \"SYSTEM INFO\" bot request, as described in a recent article fromSecureList.\nLater, more discovery commands were executed via the Cobalt Strike beacon, which gathered information about the active directory environment.\nADFind(renamed in find.exe) used to enumerate computers\nOn the Domain Controller, the threat actors gathered information about the installed security software through WMI:\nPing was used to verify machines were online",
        "relationship": "1. [Relationships]: <process:QBot,starts,process:processes>. \n2. [Relationships]: <process:Cobalt Strike beacon,executes,process:discovery commands>. \n3. [Relationships]: <process:ADFind,enumerates,process:computers>. \n4. [Relationships]: <process:threat actors,gathered,process:information about the installed security software through WMI>. \n5. [Relationships]: <process:Ping,verifies,process:machines were online>. "
    },
    {
        "phase": "lateral movement",
        "content": "On the first Domain Controller, a Cobalt Strike service was installed:\nMultiple services were installed by Cobalt Strike across the environment, here are a few examples:\nCobalt Strikefirst callsOpenSCManagerWto create the service remotely, then starts it withStartServiceAfunction:\nRDP/interactive Logins\nVarious commands were executed to enable the RDP service on various hosts:\nIncrease the max RDP connections allowed, in this case a arbitrarily large number.\nThe threat actor then established interactive administrative RDP sessions and pivoted to different hosts in the network.",
        "relationship": "1. [Relationships]: <process:Cobalt Strike,calls,process:OpenSCManagerW>. \n2. [Relationships]: <process:Cobalt Strike,starts,process:StartServiceA>. \n3. [Relationships]: <process:threat actor,establishes,socket:interactive RDP sessions>. "
    },
    {
        "phase": "command and control",
        "content": "QBot details – 24.229.150.54 // 41.228.22.180\nHere is the initial access DLL (Qbot) information fromTria.ge\nCobalt Strike details – 5.255.98[.]144\nThis Cobalt Strike server was added to ourThreat Feedon 2021-11-16.",
        "relationship": "[Relationships]: None."
    },
    {
        "phase": "exfiltration",
        "content": "While the threat actors were active in the environment, we received 3 different alerts stating that someone had opened canary documents from the IP address 91.193.182[.]165. These alerts tell us that data was indeed exfiltrated from the environment.\nThe threat actors were most interested in files concerning financial statements, ransomware reports, and salary data.\nThe C2 channel was encrypted and multiple connections were established with the internal file server. No other traffic was observed for possible exfiltration leading us to the conclusion that the command and control channel was used for the exfiltration.\nAt 17:35 UTC, the Cobalt Strike Beacon was deployed on the File Server.\nAccording to the number of connections to the C2 from the File Server per minute, we can conclude that exfiltration was done between 17:52 UTC and 18:00 UTC.\nSpike in traffic from file share server to Cobalt Strike command and control server.",
        "relationship": "1. [Relationships]: <process:threat actors,opened,file:canary documents>. \n2. [Relationships]: <process:threat actors,exfiltrated,socket:91.193.182[.]165>. \n3. [Relationships]: <process:threat actors,established,socket:internal file server>. \n4. [Relationships]: <process:Cobalt Strike Beacon,deployed,process:File Server>. \n5. [Relationships]: <process:File Server,exfiltrated,socket:C2>. \n6. [Relationships]: <process:file share server,send,socket:Cobalt Strike command and control server>. "
    }
]