[
    {
        "phase": "initial access",
        "content": "Initial delivery was via email with a link to the Bazar/Kegtap backdoor loader. We downloaded and ran Document-Preview.exe, which connected to 5.182.210[.]145 over 443/https.",
        "relationship": "1. [CoT]: The text states that the user downloaded and ran Document-Preview.exe, indicating a process-to-file relationship. [Relationships]: <process:user,downloaded and ran,file:Document-Preview.exe>. \n2. [CoT]: The text mentions that Document-Preview.exe connected to 5.182.210[.]145, indicating a process-to-socket relationship. [Relationships]: <process:Document-Preview.exe,connected to,socket:5.182.210[.]145>. ",
        "semantic_relationship": "[CoT]: The original relationship \"downloaded and ran\" implies two actions: downloading the file (which is a network activity) and executing the file (which involves the process running the file). Since the focus here is on the system-level relationships between the process and the file, the \"ran\" part is mapped to the \"Execute\" relationship in the Process-to-File category. The \"downloaded\" part is not included as it occurs at the network level and is outside the scope of system-level interactions between process and file. [System-level Relationships]: <process:user,Execute,file:Document-Preview.exe>. \n[CoT]: The original relationship \"connected to\" between a process and a socket indicates a network connection establishment, which maps to the system-level relationship \"Connect\" in the Process-to-Socket category. [System-level Relationships]: <process:Document-Preview.exe,Connect,socket:5.182.210[.]145>. "
    },
    {
        "phase": "execution",
        "content": "Service execution was used several times to execute scripts and executables during lateral movement.\nWMI was used as well in an attempt to execute dlls laterally.\nThe threat actors also performed process injection.",
        "relationship": "1. [CoT]: The text mentions that WMI was used to execute dlls, indicating a process-to-process relationship where WMI (a process) executes dll (another process).   [Relationships]: <process:WMI,execute,process:dll>. \n2. [CoT]: The text states that threat actors performed process injection, which is a process-to-process relationship where threat actors (process) perform actions on other processes.   [Relationships]: <process:threat actors,perform,process:process injection>. ",
        "semantic_relationship": "[CoT]: The original relationship describes WMI executing DLL, which directly maps to the system-level 'Fork' relationship between processes. This is a clear case of one process launching or running another, fitting the Process-to-Process:Execute pattern. [System-level Relationships]: <process:WMI,Fork,process:dll>. \n[CoT]: The original relationship describes threat actors performing process injection, which is a action taken by one process on another process. In system-level terms, this corresponds to the \"Inject\" relationship between processes. [System-level Relationships]: <process:threat actors,Inject,process:process injection>. "
    },
    {
        "phase": "defense evasion",
        "content": "Disabling Windows Defender.",
        "relationship": "1. [CoT]: The text states that the attacker disables Windows Defender, which is a process entity, using reg. [Relationships]: <process:reg,disables,process:Windows Defender>. ",
        "semantic_relationship": "[CoT]: The original relationship states that reg disables Windows Defender, which implies the termination of the Windows Defender process. In system-level terms, this corresponds to a Process-to-Process \"Exit\" relationship, where one process causes another process to exit. [System-level Relationships]: <process:reg,Exit,process:Windows Defender>. "
    },
    {
        "phase": "discovery",
        "content": "Day 1\nAdFind and adf.bat were dropped and run minutes after Document-Preview.exe was executed. We've seen adf.bat numerous times and you can read more about ithere. The batch file outputs information into the following text files.\nNltest was used to check for Domain trusts\nNet was used to show Domain Admins\nPing was used to test if systems were up in the environment\nBreak down of the process tree of activity from the Bazar loader on day 1.\nDay 2\nAfind was run again, and then the threat actor attempted toKerberoastusingRubeus.\nAfter a few false starts during lateral movement failures, the threat actors performed some additional local system recon.\nWMI was used to check for the current AntiVirus on numerous systems",
        "relationship": "1. [CoT]: AdFind was dropped and run after Document-Preview.exe was executed, indicating a process-to-process relationship where Document-Preview.exe drops AdFind.   [Relationships]: <process:Document-Preview.exe, drops, process:AdFind>. \n2. [CoT]: adf.bat was dropped and run after Document-Preview.exe was executed, indicating a process-to-process relationship where Document-Preview.exe drops adf.bat.   [Relationships]: <process:Document-Preview.exe, drops, process:adf.bat>. \n3. [CoT]: The batch file adf.bat outputs information into text files, indicating a process-to-file relationship where adf.bat outputs information into text files.   [Relationships]: <process:adf.bat, outputs, file:text files>. \n4. [CoT]: Nltest was used to check for Domain trusts, indicating a process-to-process relationship where the threat actor uses Nltest.   [Relationships]: <process:threat actor, uses, process:Nltest>. \n5. [CoT]: Net was used to show Domain Admins, indicating a process-to-process relationship where the threat actor uses Net.   [Relationships]: <process:threat actor, uses, process:Net>. \n6. [CoT]: Ping was used to test if systems were up in the environment, indicating a process-to-process relationship where the threat actor uses Ping.   [Relationships]: <process:threat actor, uses, process:Ping>. \n7. [CoT]: The threat actor performed local system recon using WMI, indicating a process-to-process relationship where the threat actor uses WMI.   [Relationships]: <process:threat actor, uses, process:WMI>. \n8. [CoT]: The threat actors used Rubeus to Kerberoast, indicating a process-to-process relationship where the threat actors use Rubeus.   [Relationships]: <process:threat actors, uses, process:Rubeus>. ",
        "semantic_relationship": "[CoT]: The term \"drops\" in the original relationship implies that Document-Preview.exe creates AdFind as a child process, which aligns with the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:Document-Preview.exe, Fork, process:AdFind>. \n[CoT]: The term \"drops\" in the original relationship implies that Document-Preview.exe is creating a new process (adf.bat) on the system. In system-level terms, this action corresponds to a \"Fork\" operation where one process creates another. [System-level Relationships]: <process:Document-Preview.exe, Fork, process:adf.bat>. \n[CoT]: The original relationship states that adf.bat \"outputs\" information into text files. In system-level terms, this action corresponds to a process writing data to a file, hence the \"Write\" relationship. [System-level Relationships]: <process:adf.bat,Write,file:text files>. \n[CoT]: The original relationship \"uses\" implies that the threat actor executed the Nltest process to check for Domain trusts. In system-level terms, this translates to an \"Fork\" relationship between the threat actor's process and the Nltest process. [System-level Relationships]: <process:threat actor, Fork, process:Nltest>. \n[CoT]: The original relationship \"uses\" between two processes typically implies that one process is spawning or fork another process. In the context of \"Net\" being used to show Domain Admins, this suggests that the threat actor is executing the \"Net\" process to perform some action, which aligns with the system-level relationship \"Fork\". [System-level Relationships]: <process:threat actor, Fork, process:Net>. \n[CoT]: The original relationship \"uses\" is too generic. In the context of system-level relationships, when a threat actor runs a process like Ping to test system uptime, the correct mapping is \"Fork\", as the threat actor's process is executing another process (Ping). This reflects the actual system behavior where one process spawns another. [System-level Relationships]: <process:threat actor, Fork, process:Ping>. \n[CoT]: The threat actor uses WMI to perform local system recon, which implies that the threat actor's process is spawning or fork a new process to WMI. In system-level terms, this is best represented as a 'Fork' relationship between the two processes. [System-level Relationships]: <process:threat actor,Fork,process:WMI>. \n[CoT]: The original relationship \"uses\" implies that the threat actors are executing the Rubeus process to perform Kerberoasting activities. In system-level terms, this translates to an \"Fork\" relationship between the two processes. [System-level Relationships]: <process:threat actors, Fork, process:Rubeus>. "
    },
    {
        "phase": "lateral movement",
        "content": "On day 1 the threat actors checked a domain controller for MS17-010 before continuing with more discovery. The system was not vulnerable to MS17-010\nLateral movement began around 28 hours after initial entry, using SMB to drop a Cobalt Strike Beacon on a domain controller. From there, the threat actor used WMIC to execute the beacon.\nThis payload did not appear to run successfully, as shortly after the threat actors dropped an additional payload on the beachhead host, and then executed a service on the DC, after no command and control traffic was apparent.\nThe decoded Powershell.\nFollowing this, the treat actors copied and executed a Cobalt Strike beacon executable and initiated it via a service on the domain controller.\nAt this point, C2 connections appear on the domain controller connecting tomartahzz[.]com –88.119.171[.]75 over 443/https.\nBackup systems were targeted for lateral movement using the SMB exe executed around one hour after the first lateral movement execution from the beachhead host.\nThe threat actor was having issues running beacons on numerous systems, and on at least one of the systems, they mounted the drive remotely.",
        "relationship": "1. [CoT]: The text states \"The system was not vulnerable to MS17-010,\" which implies the system was checked for vulnerability to MS17-010. [Relationships]: <process:threat actors, checked, process:MS17-010>. \n2. [CoT]: The text explicitly mentions \"using SMB to drop a Cobalt Strike Beacon,\" indicating a process-to-file relationship. [Relationships]: <process:lateral movement, used, process:SMB>. \n3. [CoT]: The text describes \"the threat actor used WMIC to execute the beacon,\" showing a process-to-process relationship. [Relationships]: <process:threat actor, used, process:WMIC>. \n4. [CoT]: The text states \"the threat actors dropped an additional payload on the beachhead host,\" indicating a process-to-file relationship. [Relationships]: <process:threat actors, dropped, file:additional payload>. \n5. [CoT]: The text mentions \"executed a service on the DC,\" showing a process-to-process relationship. [Relationships]: <process:threat actors, executed, process:service>. \n6. [CoT]: The text describes \"copied and executed a Cobalt Strike beacon executable,\" indicating a process-to-file relationship. [Relationships]: <process:threat actors, copied, file:Cobalt Strike beacon executable>. \n7. [CoT]: The text states \"initiated it via a service on the domain controller,\" showing a process-to-process relationship. [Relationships]: <process:threat actors, initiated, process:service>. \n8. [CoT]: The text explicitly mentions \"C2 connections appear on the domain controller connecting to martahzz[.]com –88.119.171[.]75 over 443/https,\" indicating a process-to-socket relationship. [Relationships]: <process:domain controller, connected to, socket:martahzz[.]com –88.119.171[.]75:443>. ",
        "semantic_relationship": "[CoT]: The original relationship \"checked\" implies that the threat actors evaluated or tested the system for vulnerability to MS17-010. In system-level terms, this action corresponds to \"Fork\" the process MS17-010 to test its vulnerability. [System-level Relationships]: <process:threat actors,Fork,process:MS17-010>. \n[CoT]: The original relationship \"used\" implies that the lateral movement process executed the SMB process, which aligns with the system-level \"Fork\" relationship between processes. [System-level Relationships]: <process:lateral movement,Fork,process:SMB>. \n[CoT]: The original relationship \"used\" implies that the threat actor executed the WMIC process, which aligns with the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:threat actor, Fork, process:WMIC>. \n[CoT]: The term \"dropped\" in the original relationship implies that the threat actors created a new file (the additional payload) on the system, which aligns with the system-level relationship \"Create\" between a process and a file. [System-level Relationships]: <process:threat actors,Create,file:additional payload>. \n[CoT]: The original relationship indicates that the threat actors executed a service, which in system-level terms translates to a Process-to-Process \"Fork\" relationship, as one process is directly causing another process to start. [System-level Relationships]: <process:threat actors, Fork, process:service>. \n[CoT]: The original relationship \"copied\" implies that the threat actors wrote the Cobalt Strike beacon executable to disk, which corresponds to the system-level \"Write\" relationship between a process and a file. [System-level Relationships]: <process:threat actors,Write,file:Cobalt Strike beacon executable>. \n[CoT]: The original relationship \"initiated\" between two processes typically corresponds to the system-level relationship \"Fork\" in the Process-to-Process category, as it indicates the creation of a new process by an existing process. [System-level Relationships]: <process:threat actors, Fork, process:service>. \n[CoT]: The original relationship describes a process (domain controller) establishing a connection to a socket (martahzz[.]com –88.119.171[.]75:443). In the system-level framework, this maps to the \"Connect\" relationship between a process and a socket, as it involves initiating a network connection. [System-level Relationships]: <process:domain controller,Connect,socket:martahzz[.]com –88.119.171[.]75:443>. "
    },
    {
        "phase": "command and control",
        "content": "Bazar:\n5.182.210.145|443\nCertificate [ec:4c:07:b8:3b:6a:a0:bf:60:36:b7:f4:92:9e:83:81:0f:96:46:b0]\nNot Before2020/09/21 05:24:24 UTC\nNot After2021/09/21 05:24:24 UTC\nIssuer OrgGlobal Security\nSubject Commonexample.com\nSubject OrgGlobal Security\nPublic AlgorithmrsaEncryption\nJA3: 72a589da586844d7f0818ce684948eea\nJA3s: e35df3e00ca4ef31d42b34bebaa2f86e\nCobalt strike:\n88.119.171.75|443\nCertificate [ee:92:91:6b:7e:31:85:22:65:eb:16:11:c4:8f:0a:75:c9:05:1d:4b]\nNot Before2020/09/29 08:18:03 UTC\nNot After2021/09/29 08:18:03 UTC\nIssuer Orglol\nSubject Commonmartahzz.com\nSubject Orglol\nPublic AlgorithmrsaEncryption\nJA3 : a0e9f5d64349fb13191bc781f81f42e1\nJA3s: ae4edc6faf64d08308082ad26be60767\n107.173.58.183|443\nCertificate [e2:13:2c:a4:29:ae:f3:fa:35:1f:e1:5b:2c:25:76:57:37:5b:dc:35]\nNot Before2020/09/22 14:34:11 UTC\nNot After2021/09/22 14:34:11 UTC\nIssuer Orglol\nSubject Commonnomadfunclub.com\nSubject Orglol\nPublic AlgorithmrsaEncryption\nJA3: a0e9f5d64349fb13191bc781f81f42e1\nJA3s: ae4edc6faf64d08308082ad26be60767",
        "relationship": "1. [CoT]: The text states that Bazar is listening on the IP:Port combination 5.182.210.145:443, indicating a socket entity. [Relationships]: <process:Bazar,listen,socket:5.182.210.145:443>. \n2. [CoT]: The text mentions that Cobalt strike is connecting to the IP:Port combination 88.119.171.75:443, indicating a socket entity. [Relationships]: <process:Cobalt strike,connect,socket:88.119.171.75:443>. \n3. [CoT]: The text states that Bazar is connecting to the IP:Port combination 107.173.58.183:443, indicating a socket entity. [Relationships]: <process:Bazar,connect,socket:107.173.58.183:443>. \n4. [CoT]: The text mentions that Cobalt strike is connecting to the IP:Port combination 107.173.58.183:443, indicating a socket entity. [Relationships]: <process:Cobalt strike,connect,socket:107.173.58.183:443>. ",
        "semantic_relationship": "[CoT]: The original relationship indicates that the process Bazar is listening on a socket, which in system-level terms translates to a 'Connect' relationship between the process and the socket. This is because the act of listening on a socket implies establishing a connection to it. [System-level Relationships]: <process:Bazar,Connect,socket:5.182.210.145:443>. \n[CoT]: The original relationship describes a process (Cobalt strike) connecting to a socket (IP:Port combination). In the system-level framework, this maps directly to the 'Connect' relationship between a process and a socket. [System-level Relationships]: <process:Cobalt strike,Connect,socket:88.119.171.75:443>. \n[CoT]: The original relationship describes Bazar establishing a connection to a socket (IP:Port combination). In the system-level framework, this corresponds to the 'Connect' relationship between a process and a socket. [System-level Relationships]: <process:Bazar,Connect,socket:107.173.58.183:443>. \n[CoT]: The original relationship describes a process (Cobalt strike) connecting to a socket (IP:Port combination). In the system-level framework, this directly maps to the 'Connect' relationship between a process and a socket. [System-level Relationships]: <process:Cobalt strike,Connect,socket:107.173.58.183:443>. "
    },
    {
        "phase": "exfiltration",
        "content": "Domain discovery (AdFind and Rubeus outputs) exfiltrated by vsftpd to 45.141.84[.]120.",
        "relationship": "1. [CoT]: The text states that \"AdFind and Rubeus outputs exfiltrated by vsftpd to 45.141.84[.]120,\" which indicates that vsftpd is exfiltrating data to the IP address 45.141.84[.]120 via unspecified protocols. [Relationships]: <process:vsftpd,exfiltrated,socket:45.141.84[.]120>. ",
        "semantic_relationship": "[CoT]: The original relationship states that vsftpd \"exfiltrated\" data to the IP address 45.141.84[.]120. In system-level terms, this action corresponds to data being sent from a process to a socket, hence the \"Send\" relationship. Exfiltration typically involves transmitting data over a network, which aligns with the Process-to-Socket \"Send\" relationship in the system-level framework. [System-level Relationships]: <process:vsftpd,Send,socket:45.141.84[.]120>. "
    },
    {
        "phase": "impact",
        "content": "SMB was used to transfer the Ryuk executables. Then, RDP connections were made from the first compromised DC, and then, ransomware executed throughout the environment, starting with the Backup servers. On the backup server, prior to execution, the threat actors pulled up thewbadminmsc console.\nCommands ran prior to ransom execution:\nThe threat actors asked for more than $6 million but were willing to negotiate.\nEnjoy our report? Please consider donating $1 or more to the project usingPatreon. Thank you for your support!\nWe also have PCAPs, files, memory images, Kape and Redline packages availablehere.",
        "relationship": "1. [CoT]: The text states \"SMB was used to transfer the Ryuk executables,\" indicating that the SMB protocol was used to transfer the Ryuk executables file. [Relationships]: <process:SMB, used, file:Ryuk executables>. \n2. [CoT]: The text mentions \"RDP connections were made from the first compromised DC,\" showing that the system made RDP connections as processes. The domain 'compromised DC' is treated as a process entity. [Relationships]: <process:system, made, socket:RDP connections from the first compromised DC>. \n3. [CoT]: The text states \"ransomware executed throughout the environment, starting with the Backup servers,\" indicating that the ransomware process executed on the Backup servers system. [Relationships]: <process:ransomware, executed, process:Backup servers>. \n4. [CoT]: The text describes \"the threat actors pulled up thewbadminmsc console\" before execution, showing that the threat actors process interacted with thewbadminmsc console process. [Relationships]: <process:threat actors, pulled up, process:thewbadminmsc console>. ",
        "semantic_relationship": "[CoT]: The original relationship states that SMB \"was used to transfer\" the Ryuk executables file. In system-level terms, this implies that the SMB process wrote the Ryuk executables file to a destination, which aligns with the \"Write\" relationship in the Process-to-File category. [System-level Relationships]: <process:SMB,Write,file:Ryuk executables>. \n[CoT]: The original relationship describes the system process making RDP connections, which in system-level terms translates to a Process-to-Socket 'Connect' relationship, as the process is establishing a connection to a remote socket (RDP). [System-level Relationships]: <process:system,Connect,socket:RDP connections from the first compromised DC>. \n[CoT]: The original relationship indicates that the ransomware process executed on the Backup servers system, which directly translates to the system-level relationship 'Fork' between two processes. [System-level Relationships]: <process:ransomware,Fork,process:Backup servers>. \n[CoT]: The original relationship \"pulled up\" indicates that the threat actors process initiated or spawned thethewbadminmsc console process. In system-level terms, this corresponds to a \"Fork\" relationship where one process creates another. [System-level Relationships]: <process:threat actors,Fork,process:thewbadminmsc console>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the user downloaded and ran Document-Preview.exe, indicating a process-to-file relationship. [Original Relationships]: <process:user,downloaded and ran,file:Document-Preview.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship \"downloaded and ran\" implies two actions: downloading the file (which is a network activity) and executing the file (which involves the process running the file). Since the focus here is on the system-level relationships between the process and the file, the \"ran\" part is mapped to the \"Execute\" relationship in the Process-to-File category. The \"downloaded\" part is not included as it occurs at the network level and is outside the scope of system-level interactions between process and file. [System-level Relationships]: <process:user,Execute,file:Document-Preview.exe>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that Document-Preview.exe connected to 5.182.210[.]145, indicating a process-to-socket relationship. [Original Relationships]: <process:Document-Preview.exe,connected to,socket:5.182.210[.]145>. ",
                "semantic_relationship": "[CoT]: The original relationship \"connected to\" between a process and a socket indicates a network connection establishment, which maps to the system-level relationship \"Connect\" in the Process-to-Socket category. [System-level Relationships]: <process:Document-Preview.exe,Connect,socket:5.182.210[.]145>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that WMI was used to execute dlls, indicating a process-to-process relationship where WMI (a process) executes dll (another process).   [Original Relationships]: <process:WMI,execute,process:dll>. ",
                "semantic_relationship": "[CoT]: The original relationship describes WMI executing DLL, which directly maps to the system-level 'Fork' relationship between processes. This is a clear case of one process launching or running another, fitting the Process-to-Process:Execute pattern. [System-level Relationships]: <process:WMI,Fork,process:dll>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that threat actors performed process injection, which is a process-to-process relationship where threat actors (process) perform actions on other processes.   [Original Relationships]: <process:threat actors,perform,process:process injection>. ",
                "semantic_relationship": "[CoT]: The original relationship describes threat actors performing process injection, which is a action taken by one process on another process. In system-level terms, this corresponds to the \"Inject\" relationship between processes. [System-level Relationships]: <process:threat actors,Inject,process:process injection>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The text states that the attacker disables Windows Defender, which is a process entity, using reg. [Original Relationships]: <process:reg,disables,process:Windows Defender>. ",
                "semantic_relationship": "[CoT]: The original relationship states that reg disables Windows Defender, which implies the termination of the Windows Defender process. In system-level terms, this corresponds to a Process-to-Process \"Exit\" relationship, where one process causes another process to exit. [System-level Relationships]: <process:reg,Exit,process:Windows Defender>. "
            },
            {
                "phase": "discovery",
                "relationship": "[Description]: AdFind was dropped and run after Document-Preview.exe was executed, indicating a process-to-process relationship where Document-Preview.exe drops AdFind.   [Original Relationships]: <process:Document-Preview.exe, drops, process:AdFind>. ",
                "semantic_relationship": "[CoT]: The term \"drops\" in the original relationship implies that Document-Preview.exe creates AdFind as a child process, which aligns with the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:Document-Preview.exe, Fork, process:AdFind>. "
            },
            {
                "phase": "discovery",
                "relationship": "[Description]: adf.bat was dropped and run after Document-Preview.exe was executed, indicating a process-to-process relationship where Document-Preview.exe drops adf.bat.   [Original Relationships]: <process:Document-Preview.exe, drops, process:adf.bat>. ",
                "semantic_relationship": "[CoT]: The term \"drops\" in the original relationship implies that Document-Preview.exe is creating a new process (adf.bat) on the system. In system-level terms, this action corresponds to a \"Fork\" operation where one process creates another. [System-level Relationships]: <process:Document-Preview.exe, Fork, process:adf.bat>. "
            },
            {
                "phase": "discovery",
                "relationship": "[Description]: The batch file adf.bat outputs information into text files, indicating a process-to-file relationship where adf.bat outputs information into text files.   [Original Relationships]: <process:adf.bat, outputs, file:text files>. ",
                "semantic_relationship": "[CoT]: The original relationship states that adf.bat \"outputs\" information into text files. In system-level terms, this action corresponds to a process writing data to a file, hence the \"Write\" relationship. [System-level Relationships]: <process:adf.bat,Write,file:text files>. "
            },
            {
                "phase": "discovery",
                "relationship": "[Description]: Nltest was used to check for Domain trusts, indicating a process-to-process relationship where the threat actor uses Nltest.   [Original Relationships]: <process:threat actor, uses, process:Nltest>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uses\" implies that the threat actor executed the Nltest process to check for Domain trusts. In system-level terms, this translates to an \"Fork\" relationship between the threat actor's process and the Nltest process. [System-level Relationships]: <process:threat actor, Fork, process:Nltest>. "
            },
            {
                "phase": "discovery",
                "relationship": "[Description]: Net was used to show Domain Admins, indicating a process-to-process relationship where the threat actor uses Net.   [Original Relationships]: <process:threat actor, uses, process:Net>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uses\" between two processes typically implies that one process is spawning or fork another process. In the context of \"Net\" being used to show Domain Admins, this suggests that the threat actor is executing the \"Net\" process to perform some action, which aligns with the system-level relationship \"Fork\". [System-level Relationships]: <process:threat actor, Fork, process:Net>. "
            },
            {
                "phase": "discovery",
                "relationship": "[Description]: Ping was used to test if systems were up in the environment, indicating a process-to-process relationship where the threat actor uses Ping.   [Original Relationships]: <process:threat actor, uses, process:Ping>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uses\" is too generic. In the context of system-level relationships, when a threat actor runs a process like Ping to test system uptime, the correct mapping is \"Fork\", as the threat actor's process is executing another process (Ping). This reflects the actual system behavior where one process spawns another. [System-level Relationships]: <process:threat actor, Fork, process:Ping>. "
            },
            {
                "phase": "discovery",
                "relationship": "[Description]: The threat actor performed local system recon using WMI, indicating a process-to-process relationship where the threat actor uses WMI.   [Original Relationships]: <process:threat actor, uses, process:WMI>. ",
                "semantic_relationship": "[CoT]: The threat actor uses WMI to perform local system recon, which implies that the threat actor's process is spawning or fork a new process to WMI. In system-level terms, this is best represented as a 'Fork' relationship between the two processes. [System-level Relationships]: <process:threat actor,Fork,process:WMI>. "
            },
            {
                "phase": "discovery",
                "relationship": "[Description]: The threat actors used Rubeus to Kerberoast, indicating a process-to-process relationship where the threat actors use Rubeus.   [Original Relationships]: <process:threat actors, uses, process:Rubeus>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uses\" implies that the threat actors are executing the Rubeus process to perform Kerberoasting activities. In system-level terms, this translates to an \"Fork\" relationship between the two processes. [System-level Relationships]: <process:threat actors, Fork, process:Rubeus>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text states \"The system was not vulnerable to MS17-010,\" which implies the system was checked for vulnerability to MS17-010. [Original Relationships]: <process:threat actors, checked, process:MS17-010>. ",
                "semantic_relationship": "[CoT]: The original relationship \"checked\" implies that the threat actors evaluated or tested the system for vulnerability to MS17-010. In system-level terms, this action corresponds to \"Fork\" the process MS17-010 to test its vulnerability. [System-level Relationships]: <process:threat actors,Fork,process:MS17-010>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text explicitly mentions \"using SMB to drop a Cobalt Strike Beacon,\" indicating a process-to-file relationship. [Original Relationships]: <process:lateral movement, used, process:SMB>. ",
                "semantic_relationship": "[CoT]: The original relationship \"used\" implies that the lateral movement process executed the SMB process, which aligns with the system-level \"Fork\" relationship between processes. [System-level Relationships]: <process:lateral movement,Fork,process:SMB>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text describes \"the threat actor used WMIC to execute the beacon,\" showing a process-to-process relationship. [Original Relationships]: <process:threat actor, used, process:WMIC>. ",
                "semantic_relationship": "[CoT]: The original relationship \"used\" implies that the threat actor executed the WMIC process, which aligns with the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:threat actor, Fork, process:WMIC>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text states \"the threat actors dropped an additional payload on the beachhead host,\" indicating a process-to-file relationship. [Original Relationships]: <process:threat actors, dropped, file:additional payload>. ",
                "semantic_relationship": "[CoT]: The term \"dropped\" in the original relationship implies that the threat actors created a new file (the additional payload) on the system, which aligns with the system-level relationship \"Create\" between a process and a file. [System-level Relationships]: <process:threat actors,Create,file:additional payload>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text mentions \"executed a service on the DC,\" showing a process-to-process relationship. [Original Relationships]: <process:threat actors, executed, process:service>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the threat actors executed a service, which in system-level terms translates to a Process-to-Process \"Fork\" relationship, as one process is directly causing another process to start. [System-level Relationships]: <process:threat actors, Fork, process:service>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text describes \"copied and executed a Cobalt Strike beacon executable,\" indicating a process-to-file relationship. [Original Relationships]: <process:threat actors, copied, file:Cobalt Strike beacon executable>. ",
                "semantic_relationship": "[CoT]: The original relationship \"copied\" implies that the threat actors wrote the Cobalt Strike beacon executable to disk, which corresponds to the system-level \"Write\" relationship between a process and a file. [System-level Relationships]: <process:threat actors,Write,file:Cobalt Strike beacon executable>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text states \"initiated it via a service on the domain controller,\" showing a process-to-process relationship. [Original Relationships]: <process:threat actors, initiated, process:service>. ",
                "semantic_relationship": "[CoT]: The original relationship \"initiated\" between two processes typically corresponds to the system-level relationship \"Fork\" in the Process-to-Process category, as it indicates the creation of a new process by an existing process. [System-level Relationships]: <process:threat actors, Fork, process:service>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text explicitly mentions \"C2 connections appear on the domain controller connecting to martahzz[.]com –88.119.171[.]75 over 443/https,\" indicating a process-to-socket relationship. [Original Relationships]: <process:domain controller, connected to, socket:martahzz[.]com –88.119.171[.]75:443>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (domain controller) establishing a connection to a socket (martahzz[.]com –88.119.171[.]75:443). In the system-level framework, this maps to the \"Connect\" relationship between a process and a socket, as it involves initiating a network connection. [System-level Relationships]: <process:domain controller,Connect,socket:martahzz[.]com –88.119.171[.]75:443>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that Bazar is listening on the IP:Port combination 5.182.210.145:443, indicating a socket entity. [Original Relationships]: <process:Bazar,listen,socket:5.182.210.145:443>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the process Bazar is listening on a socket, which in system-level terms translates to a 'Connect' relationship between the process and the socket. This is because the act of listening on a socket implies establishing a connection to it. [System-level Relationships]: <process:Bazar,Connect,socket:5.182.210.145:443>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that Cobalt strike is connecting to the IP:Port combination 88.119.171.75:443, indicating a socket entity. [Original Relationships]: <process:Cobalt strike,connect,socket:88.119.171.75:443>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (Cobalt strike) connecting to a socket (IP:Port combination). In the system-level framework, this maps directly to the 'Connect' relationship between a process and a socket. [System-level Relationships]: <process:Cobalt strike,Connect,socket:88.119.171.75:443>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that Bazar is connecting to the IP:Port combination 107.173.58.183:443, indicating a socket entity. [Original Relationships]: <process:Bazar,connect,socket:107.173.58.183:443>. ",
                "semantic_relationship": "[CoT]: The original relationship describes Bazar establishing a connection to a socket (IP:Port combination). In the system-level framework, this corresponds to the 'Connect' relationship between a process and a socket. [System-level Relationships]: <process:Bazar,Connect,socket:107.173.58.183:443>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that Cobalt strike is connecting to the IP:Port combination 107.173.58.183:443, indicating a socket entity. [Original Relationships]: <process:Cobalt strike,connect,socket:107.173.58.183:443>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (Cobalt strike) connecting to a socket (IP:Port combination). In the system-level framework, this directly maps to the 'Connect' relationship between a process and a socket. [System-level Relationships]: <process:Cobalt strike,Connect,socket:107.173.58.183:443>. "
            },
            {
                "phase": "exfiltration",
                "relationship": "[Description]: The text states that \"AdFind and Rubeus outputs exfiltrated by vsftpd to 45.141.84[.]120,\" which indicates that vsftpd is exfiltrating data to the IP address 45.141.84[.]120 via unspecified protocols. [Original Relationships]: <process:vsftpd,exfiltrated,socket:45.141.84[.]120>. ",
                "semantic_relationship": "[CoT]: The original relationship states that vsftpd \"exfiltrated\" data to the IP address 45.141.84[.]120. In system-level terms, this action corresponds to data being sent from a process to a socket, hence the \"Send\" relationship. Exfiltration typically involves transmitting data over a network, which aligns with the Process-to-Socket \"Send\" relationship in the system-level framework. [System-level Relationships]: <process:vsftpd,Send,socket:45.141.84[.]120>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text states \"SMB was used to transfer the Ryuk executables,\" indicating that the SMB protocol was used to transfer the Ryuk executables file. [Original Relationships]: <process:SMB, used, file:Ryuk executables>. ",
                "semantic_relationship": "[CoT]: The original relationship states that SMB \"was used to transfer\" the Ryuk executables file. In system-level terms, this implies that the SMB process wrote the Ryuk executables file to a destination, which aligns with the \"Write\" relationship in the Process-to-File category. [System-level Relationships]: <process:SMB,Write,file:Ryuk executables>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions \"RDP connections were made from the first compromised DC,\" showing that the system made RDP connections as processes. The domain 'compromised DC' is treated as a process entity. [Original Relationships]: <process:system, made, socket:RDP connections from the first compromised DC>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the system process making RDP connections, which in system-level terms translates to a Process-to-Socket 'Connect' relationship, as the process is establishing a connection to a remote socket (RDP). [System-level Relationships]: <process:system,Connect,socket:RDP connections from the first compromised DC>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text states \"ransomware executed throughout the environment, starting with the Backup servers,\" indicating that the ransomware process executed on the Backup servers system. [Original Relationships]: <process:ransomware, executed, process:Backup servers>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the ransomware process executed on the Backup servers system, which directly translates to the system-level relationship 'Fork' between two processes. [System-level Relationships]: <process:ransomware,Fork,process:Backup servers>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text describes \"the threat actors pulled up thewbadminmsc console\" before execution, showing that the threat actors process interacted with thewbadminmsc console process. [Original Relationships]: <process:threat actors, pulled up, process:thewbadminmsc console>. ",
                "semantic_relationship": "[CoT]: The original relationship \"pulled up\" indicates that the threat actors process initiated or spawned thethewbadminmsc console process. In system-level terms, this corresponds to a \"Fork\" relationship where one process creates another. [System-level Relationships]: <process:threat actors,Fork,process:thewbadminmsc console>. "
            }
        ]
    }
]