[
    {
        "phase": "initial access",
        "content": "To perform this attack, the threat actor must have access to credentials that can be used to access the tenant. These credentials need to have the virtual machine contributor role, or provide a path to a user account that does. Threat actors abusing tenants in this way utilize multiple methods to gain account credentials such as phishing, using leaked credentials, and on-premises device compromise. Microsoft Incident Response investigations found that in nearly all cases observed, the accounts did not have multi-factor authentication (MFA) enabled, and no evidence of password spray or brute force was present, suggesting leaked credentials might be the most common vector. \nAfter gaining access, some threat actors use attacker-controlled virtual machines within legitimate tenants as their operational infrastructure. By using living-off-theland techniques, threat actors can operate without any infrastructure external to the cloud environment. This attack cycle is shown in the diagram below. \nIn the above example, the attacker generally keeps their operational infrastructure separate from the compromised infrastructure used for mining. ",
        "relationship": "1. [CoT]: The text mentions that threat actors use attacker-controlled virtual machines within legitimate tenants as their operational infrastructure, indicating a relationship between threat actors (process) and attacker-controlled virtual machines (socket) via control.   [Relationships]: <process:threat actors,control,socket:attacker-controlled virtual machines>. \n2. [CoT]: The text states that threat actors utilize multiple methods to gain account credentials, suggesting a relationship between threat actors (process) and account credentials (socket) via gain.   [Relationships]: <process:threat actors,gain,socket:account credentials>. ",
        "semantic_relationship": "[CoT]: The original relationship describes threat actors (processes) establishing control over attacker-controlled virtual machines (sockets). In system-level terms, this is best represented as a 'Connect' relationship between the process and socket, as it indicates the process is establishing a connection to the socket for remote control or communication purposes. [System-level Relationships]: <process:threat actors,Connect,socket:attacker-controlled virtual machines>. \n[CoT]: The original relationship describes threat actors gaining account credentials, which implies the reading of credentials from memory or socket. Therefore, the system-level relationship is 'Read' between the process and socket entities. [System-level Relationships]: <process:threat actors,Read,socket:account credentials>. "
    },
    {
        "phase": "privilege escalation",
        "content": "In some observed cases, threat actors compromise the global administrator account. By design, global administrator accounts might not have access to all subscriptions and management groups within the directory; the elevate access option needs to be elevated for the account to have permissions over all resources. Access to global administrator accounts must therefore be adequately secured to prevent threat actors from elevating their access or granting roles that allow the creation of compute resources. ",
        "relationship": "1. [CoT]: The text mentions that threat actors compromise the global administrator account, indicating a process-to-process relationship where the threat actors (process) compromise the global administrator account (process).   [Relationships]: <process:threat actors,compromise,process:global administrator account>. \n2. [CoT]: The text states that threat actors grant roles that allow the creation of compute resources, indicating another process-to-process relationship where the threat actors (process) grant roles (process) .   [Relationships]: <process:threat actors,grant,process:roles that allow the creation of compute resources>. ",
        "semantic_relationship": "[CoT]: The term \"compromise\" in the original relationship implies that the threat actors gained access to the global administrator account, which aligns with the system-level \"Inject\" relationship between processes. This indicates code injection or process injection where the threat actors' process injects code into the global administrator account process to gain control or execute commands. [System-level Relationships]: <process:threat actors,Inject,process:global administrator account>. \n[CoT]: The original relationship describes the threat actors granting roles that allow the creation of compute resources. In system-level terms, this action corresponds to a Process-to-Process \"Fork\" relationship, as the threat actors (parent process) are creating new processes (roles). Fork is the appropriate system-level term for process creation. [System-level Relationships]: <process:threat actors,Fork,process:roles that allow the creation of compute resources>. "
    },
    {
        "phase": "defense evasion",
        "content": "After gaining access to the tenant and performing reconnaissance to determine available permissions, the attacker may proceed to hijack the subscription. Subscription hijacking has been covered previously in the blog entry Hunt for compromised Azure subscriptions using Microsoft Defender for Cloud Apps. \nSubscription hijacking is an evasion technique that allows the threat actor to hide some of their activities from the tenant administrator and security teams. Migrating a subscription directory requires the threat actor to have sufficient privileges in the target subscription. In cases observed by Microsoft, the destination tenant may be attacker-controlled or another affected tenant that the threat actor has access to. \nAdditionally, subscription hijacking is disruptive forensically. Microsoft Incident Response has observed instances where a threat actor compromised accounts in customer environments that were over-privileged. Abusing over-privileged accounts allowed the threat actor to migrate the subscription to a separate tenant (often attacker-controlled) to spin up additional resources. While activity logs at the subscription level remain with the subscription, anything recorded at the tenant role-based access control (RBAC) level is recorded in the new tenant, making forensic analysis, understanding the full timeline, or incident response by or for the customer, more challenging. ",
        "relationship": "1. [CoT]: The text mentions that the attacker gains access to the tenant and performs reconnaissance, indicating interaction with the Tenant entity. [Relationships]: <process:attacker, gains access to, socket:tenant>. \n2. [CoT]: The attacker proceeds to hijack the subscription, showing manipulation of the Subscription entity. [Relationships]: <process:attacker, hijacks, socket:subscription>. \n3. [CoT]: The threat actor migrates the subscription directory to another tenant, requiring access to the Subscription Directory entity. [Relationships]: <process:threat actor, migrates, socket:subscription directory>. \n4. [CoT]: The threat actor spins up additional resources, indicating interaction with the Resource entity. [Relationships]: <process:threat actor, spins up, socket:resource>. ",
        "semantic_relationship": "[CoT]: The original relationship \"gains access to\" implies the attacker is establishing a connection to the tenant socket, which aligns with the system-level \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:attacker,Connect,socket:tenant>. \n[CoT]: The original relationship \"hijacks\" implies the attacker is taking control of the subscription socket, which aligns with the system-level \"Inject\" relationship between a process and a socket. [System-level Relationships]: <process:attacker,Inject,socket:subscription>. \n[CoT]: The term \"migrates\" implies that the threat actor is writing data from the subscription directory to another location, which aligns with the system-level relationship \"Write\" between the process and the socket. [System-level Relationships]: <process:threat actor,Write,socket:subscription directory>. \n[CoT]: The term \"spins up\" in the original relationship implies that the threat actor is creating or establishing a connection to a resource, which aligns with the system-level \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:threat actor,Connect,socket:resource>. "
    },
    {
        "phase": "impact",
        "content": "Once a threat actor has access to a tenant, they can either create compute using existing core quota, or they may choose to increase core quotas within the tenant. Increasing core quotas is potentially risky for the actor as quota increases undergo review. Some quotas can't be immediately adjusted and require a support ticket to increase. \nThreat actors without permission to increase quotas use whatever is available. This often leads to them exhausting available core counts across multiple regions. Quota increases have occurred up to a month before resources are deployed by the threat actor. \nGPU compute offerings are often targeted by threat actors. GPU compute provides access to high performance NVIDIA and AMD GPU cores, allowing cryptocurrency mining magnitudes more effective than any CPU compute offering. A complete overview of GPU compute types can be found in GPU optimized virtual machine sizes. \nThe NVIDIA T4, V100, and A100 GPU compute options are most abused by threat actors. At time of writing, the NVIDIA A100 is the best mining card available that is not a dedicated application-specific integrated circuit (ASIC). When comparing NVIDIA GPU performance for cryptomining, the number of Compute Unified Device Architecture (CUDA) cores can be used as a rough representation of the card's performance. CUDA is designed specifically for high performance parallel computing, which allows more computations to take place at once. For NVIDIA GPUs, more CUDA cores generally means more mining potential. The table below shows the comparative hash rate for the top three most abused GPU compute cards within cloud environments based on mining Ethereum Proof of Work (ETHW). \nCryptojacking: Understanding and defending against cloud compute resource abuse | Microsoft Security Blog As the table above shows, threat actors who can provision NVIDIA GPU cores can mine a meaningful amount of currency in a relatively short period of time. In attacks observed by Microsoft, cryptojacking activities were seen to incur compute fees more than $\\$300,000$ , illustrating how unprofitable mining is within cloud environments without committing resource theft. ",
        "relationship": "1. [CoT]: The text states that threat actors without permission increase quotas and exhaust available core counts, indicating a process (threat actors) increasing a resource (core counts). [Relationships]: <process:threat actors,increase,core counts>. \n2. [CoT]: The text mentions that quota increases occur before resources are deployed by the threat actor, showing a process (threat actors) increasing a resource (quotas). [Relationships]: <process:threat actors,increase,quotas>. \n3. [CoT]: The text describes that GPU compute offerings are targeted by threat actors for cryptocurrency mining, indicating a process (threat actors) using a resource (GPU compute offerings). [Relationships]: <process:threat actors,use,GPU compute offerings>. \n4. [CoT]: The text states that the NVIDIA A100 is the best mining card available, which is abused by threat actors, showing a process (threat actors) using a resource (NVIDIA A100 GPU compute option). [Relationships]: <process:threat actors,use,NVIDIA A100 GPU compute option>. \n5. [CoT]: The text mentions that cryptojacking activities incur compute fees, indicating a process (cryptojacking activities) incurring a resource (compute fees). [Relationships]: <process:cryptojacking activities,incure,compute fees>. ",
        "semantic_relationship": "[CoT]: The original relationship describes a process (threat actors) increasing a resource (core counts) without permission, which aligns with the system-level 'Inject' relationship between a process and a resource. This indicates the process is injecting into the resource to modify its attributes. [System-level Relationships]: <process:threat actors,Inject,process:core counts>. \n[CoT]: The original relationship describes the threat actors increasing quotas, which implies modifying resource attributes (quotas) without creating, deleting, or modifying other resources. In system-level terms, this action corresponds to an \"Modify_Attribute\" relationship between the process (threat actors) and the resource (quotas). [System-level Relationships]: <process:threat actors,Modify_Attribute,quotas>. \n[CoT]: The original relationship \"use\" between the threat actors process and GPU compute offerings resource implies that the process is leveraging the GPU resources to perform computing tasks, which aligns with the system-level relationship \"Fork\" as it involves utilizing the hardware for computational efforts. [System-level Relationships]: <process:threat actors,Fork,GPU compute offerings>. \n[CoT]: The original relationship \"use\" between the process (threat actors) and the resource (NVIDIA A100 GPU compute option) is converted to \"Fork\" in the system-level framework. This indicates that the process is leveraging the GPU resource for computation, which aligns with the \"Fork\" relationship between a process and a device. [System-level Relationships]: <process:threat actors,Fork,device:NVIDIA A100 GPU compute option>. \n[CoT]: The original relationship \"incure\" implies that the cryptojacking activities are causing the compute fees to be incurred. In system-level terms, this is best represented as an \"Exit\" relationship from the process to the resource (compute fees). [System-level Relationships]: <process:cryptojacking activities,Exit,compute fees>. "
    },
    {
        "phase": "impact",
        "content": "There are several ways to deploy compute, and threat actors have adapted to abusing features to speed up deployment. As resource hijacking is an attack of scale, the threat actor needs a way to rapidly spin up and manage multiple devices. In observed cases, threat actors have employed VM scale sets, Azure Machine Learning compute instances, Azure Batch, and Azure Container Instances. Each of these systems allows compute to be deployed quickly and centrally managed. \nMalicious provisioning behavior of compute using the above methods generally does not match existing compute provisioning patterns within the tenant. The graph below shows an attacker deploying NVIDIA compute cores within a target environment using VM scale sets. The Y axis shows the capacity of the VM whilst the X axis represents time, this activity spans a three-hour period. Each color represents a single region, with the attacker iterating the various regions to create compute. \nIn the graph above, the actor followed a predictable and anomalous deployment pattern across several hijacked subscriptions. Microsoft Threat Intelligence analysis shows that this deployment pattern is unique to a specific threat actor. While this specific pattern may change, the automated nature of malicious compute deployments means that an unusual pattern almost always emerges. \nSome staggering of deployment is used, but the threat actor ultimately needs to provision compute very quickly to make the attack profitable. This time restriction means that patterns in provisioning generally emerge over relatively short periods of time. In the above case, the entire provisioning stage of the attack took place over a three-hour period. \nIn addition to the pattern of deployment, in this case, the following additional anomalies were also observed: \nThe user accounts used to provision compute had never provisioned compute before. The compromised user provisioned GPU compute, when no GPU compute had been provisioned in this environment before. Compute was deployed to regions anomalous for the environment. \nOther cases observed by Microsoft showed the following deployment anomalies: \nA user with a recent Azure AD anomaly creating large volumes of compute. A user suddenly causing multiple deployment failures spanning multiple core types due to a core quota unavailability. \nOther than VM scale set deployment patterns, the same anomalous patterns can be identified within other automated deployment services such as Azure ML compute instances, Azure Batch, and Azure Container Instances. ",
        "relationship": "1. [CoT]: The text states that threat actors have employed VM scale sets for rapid compute deployment, indicating a relationship between the threat actor (process) and VM scale sets (resource).   [Relationships]: <process:threat actor,employ,resource:VM scale sets>. \n2. [CoT]: The text mentions that threat actors have used Azure Machine Learning compute instances for deploymen, showing a connection between the threat actors (process) and these instances (resource).   [Relationships]: <process:threat actor,employ,resource:Azure Machine Learning compute instances>. \n3. [CoT]: The text describes the use of Azure Batch for malicious compute provisioning, indicating a relationship between the threat actors (process) and Azure Batch (resource).   [Relationships]: <process:threat actor,employ,resource:Azure Batch>. \n4. [CoT]: The text mentions that Azure Container Instances have been employed by threat actors for rapid compute deployment, showing a connection between the threat actors (process) and Azure Container Instances (resource).   [Relationships]: <process:threat actor,employ,resource:Azure Container Instances>. \n5. [CoT]: The text states that the user compromised by threat actors had never provisioned compute before, indicating a relationship between the threat actor (process) and the user account (socket).   [Relationships]: <process:threat actor,compromise,socket:user accounts>. \n6. [CoT]: The text describes the compromised user provisioning GPU compute, showing a relationship between the threat actor (process) and the GPU compute (resource).   [Relationships]: <process:threat actor,provision,resource:GPU compute>. \n7. [CoT]: The text mentions the deployment of compute to regions anomalous for the environment, indicating a relationship between the threat actor (process) and the regions (socket).   [Relationships]: <process:threat actor,deploy,socket:regions>. \n8. [CoT]: The text describes a user creating large volumes of compute, showing a relationship between the threat actor (process) and the compute (resource).   [Relationships]: <process:threat actor,create,resource:compute>. \n9. [CoT]: The text mentions a user causing multiple deployment failures, indicating a relationship between the threat actor (process) and the deployment failures (socket).   [Relationships]: <process:threat actor,cause,socket:deployment failures>. \n10. [CoT]: The text states that similar anomalous patterns can be identified in Azure ML compute instances, showing a relationship between the threat actor (process) and these instances (resource).   [Relationships]: <process:threat actor,identify,resource:Azure ML compute instances>. \n11. [CoT]: The text mentions patterns in provisioning compute, indicating a relationship between the threat actor (process) and the provisioning (socket).   [Relationships]: <process:threat actor,provision,socket:provisioning>. \n12. [CoT]: The text describes compute being deployed to regions anomalous for the environment, showing a relationship between the threat actor (process) and the regions (socket).   [Relationships]: <process:threat actor,deploy,socket:regions>. ",
        "semantic_relationship": "[CoT]: The original relationship \"employ\" implies that the threat actor is utilizing VM scale sets for their attacks. In system-level terms, this utilization translates to the threat actor spawning or launching VM scale sets to scale their computation power, hence the \"Fork\" relationship. [System-level Relationships]: <process:threat actor,Fork,resource:VM scale sets>. \n[CoT]: The original relationship \"employ\" implies that the threat actor process is utilizing the Azure Machine Learning compute instances for deployment purposes. In system-level terms, this utilization is best represented as a \"Fork\" relationship, where the process is fork another resource (the instance) to perform its actions. [System-level Relationships]: <process:threat actor,Fork,resource:Azure Machine Learning compute instances>. \n[CoT]: The original relationship \"employ\" indicates that the threat actor is using Azure Batch for malicious activities. In system-level terms, this translates to the threat actor establishing a connection to Azure Batch to provision compute resources, hence the \"Connect\" relationship. [System-level Relationships]: <process:threat actor,Connect,resource:Azure Batch>. \n[CoT]: The term \"employ\" implies that the threat actor is using Azure Container Instances to perform actions, which in system-level terms typically translates to the \"Fork\" relationship between a process and a resource. This indicates the threat actor is spawning or launching containers from this resource. [System-level Relationships]: <process:threat actor,Fork,resource:Azure Container Instances>. \n[CoT]: The term \"compromise\" in the original relationship implies that the threat actor (process) gained access to the user account (socket), which typically involves establishing a connection. Therefore, the system-level relationship is mapped to \"Connect\" as it represents the process-to-socket interaction where the threat actor process connects to the user account socket. [System-level Relationships]: <process:threat actor,Connect,socket:user accounts>. \n[CoT]: The original relationship \"provision\" implies that the threat actor process is allocating or configuring GPU compute resources, which aligns with the system-level \"Fork\" relationship where a process manipulates another resource. [System-level Relationships]: <process:threat actor,Fork,resource:GPU compute>. \n[CoT]: The original relationship describes the threat actor deploying to anomalous regions, which implies establishing a connection to these regions. In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:threat actor,Connect,socket:regions>. \n[CoT]: The original relationship describes the threat actor creating compute resources, which in system-level terms translates to a process creating a file (as compute is a type of resource filed under Filesystem). The 'Create' action in the original relationship maps to 'Create' in the system-level Process-to-File relationship. [System-level Relationships]: <process:threat actor,Create,resource:compute>. \n[CoT]: The original relationship \"cause\" implies that the threat actor process is triggering or inducing deployment failures, which in system-level terms translates to a \"Connect\" relationship between a process and a socket. This indicates the process is attempting to establish a connection to the socket, which may result in deployment failures. [System-level Relationships]: <process:threat actor,Connect,socket:deployment failures>. \n[CoT]: The original relationship \"identify\" implies that the threat actor process is inspecting or accessing the Azure ML compute instances, which aligns with the system-level \"Inject\" relationship where a process interacts with another process or resource to gather information. [System-level Relationships]: <process:threat actor,Inject,resource:Azure ML compute instances>. \n[CoT]: The original relationship \"provision\" implies that the threat actor is establishing a connection to the provisioning socket, which aligns with the system-level \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:threat actor,Connect,socket:provisioning>. \n[CoT]: The original relationship describes the threat actor deploying to regions via sockets, which implies establishing a connection to these regions. In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:threat actor,Connect,socket:regions>. "
    },
    {
        "phase": "impact",
        "content": "Once compute resources are deployed, the actor may need to install GPU drivers to take full advantage of the graphics card, especially on N-series VMs. Actors have been observed abusing Azure Virtual Machine extensions such as an NVIDIA GPU Driver Extension for Windows or Linux, or an AMD GPU Driver Extension for Windows, to facilitate driver installation. These extensions allow for the massdeployment of drivers, reducing the threat actors' setup time before mining. \nThe following anomalies have been observed when actors use these extensions: \nSudden or unusual high-volume provisioning of GPU drivers using a GPU Driver Extension. A user account suddenly deploying GPU extensions, especially where that user account has no history of deploying VM extensions. \nWith compute prepared, the threat actor can begin mining cryptocurrency by deploying mining software to the newly created VMs. The installed mining software joins the VM to a mining pool, which allows the threat actor to pool their stolen processing power from multiple compromised tenants. \nData from Microsoft Defender for Cloud shows some of the most recent pools in use by threat actors using already-compromised Azure tenants. Below is the list of the top 10 mining domains observed being used: \n1. nanopool[.]org   \n2. nicehash[.]com   \n3. supportxmr[.]com   \n4. hashvault[.]pro   \n5. zpool[.]ca   \n6. herominers[.]com   \n7. f2pool[.]com   \n8. minexmr[.]com   \n9. moneroocean[.]stream   \n10. miner[.]rocks \nSeeing connections to any mining pool from a VM within an environment is a strong indication of compromise. Microsoft Defender for Cloud has multiple detections for this behavior. ",
        "relationship": "1. [CoT]: The text states that threat actors use GPU Driver Extensions to facilitate driver installation, indicating a process-to-process relationship where the threat actor uses the GPU Driver Extension process. [Relationships]: <process:threat actor,use,process:GPU Driver Extension>. \n2. [CoT]: The text mentions that threat actors deploy mining software to newly created VMs after compute is prepared, showing a process-to-process relationship where the threat actor deploys the mining software process. [Relationships]: <process:threat actor,deploy,process:mining software>. \n3. [CoT]: The text describes how the installed mining software joins the VM to a mining pool, indicating a process-to-socket relationship where the mining software joins to the mining pool domain. [Relationships]: <process:mining software,joins,socket:mining pool (domain name)>. \n4. [CoT]: The text lists several mining domains observed being used by threat actors, showing a process-to-socket relationship where the threat actor uses these mining domains (as sockets). [Relationships]: <process:threat actor,use,socket:mining domains>. ",
        "semantic_relationship": "[CoT]: The original relationship \"use\" implies that the threat actor is executing the GPU Driver Extension process to facilitate driver installation. In system-level terms, this translates to an \"Fork\" relationship between the two processes. [System-level Relationships]: <process:threat actor,Fork,process:GPU Driver Extension>. \n[CoT]: The term \"deploy\" in the original relationship implies that the threat actor is executing the mining software process on the affected VMs. In system-level terms, this aligns with the \"Fork\" relationship between processes. [System-level Relationships]: <process:threat actor,Fork,process:mining software>. \n[CoT]: The original relationship \"joins\" implies that the mining software is establishing a connection to the mining pool's domain (socket), which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:mining software,Connect,socket:mining pool (domain name)>. \n[CoT]: The original relationship \"use\" between a process and a socket typically implies establishing a connection to the socket, which aligns with the system-level relationship \"Connect\" in the Process-to-Socket category. This indicates the threat actor is connecting to the mining domains for whatever purpose (likely command and control or resource retrieval). [System-level Relationships]: <process:threat actor,Connect,socket:mining domains>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that threat actors use attacker-controlled virtual machines within legitimate tenants as their operational infrastructure, indicating a relationship between threat actors (process) and attacker-controlled virtual machines (socket) via control.   [Original Relationships]: <process:threat actors,control,socket:attacker-controlled virtual machines>. ",
                "semantic_relationship": "[CoT]: The original relationship describes threat actors (processes) establishing control over attacker-controlled virtual machines (sockets). In system-level terms, this is best represented as a 'Connect' relationship between the process and socket, as it indicates the process is establishing a connection to the socket for remote control or communication purposes. [System-level Relationships]: <process:threat actors,Connect,socket:attacker-controlled virtual machines>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that threat actors utilize multiple methods to gain account credentials, suggesting a relationship between threat actors (process) and account credentials (socket) via gain.   [Original Relationships]: <process:threat actors,gain,socket:account credentials>. ",
                "semantic_relationship": "[CoT]: The original relationship describes threat actors gaining account credentials, which implies the reading of credentials from memory or socket. Therefore, the system-level relationship is 'Read' between the process and socket entities. [System-level Relationships]: <process:threat actors,Read,socket:account credentials>. "
            },
            {
                "phase": "privilege escalation",
                "relationship": "[Description]: The text mentions that threat actors compromise the global administrator account, indicating a process-to-process relationship where the threat actors (process) compromise the global administrator account (process).   [Original Relationships]: <process:threat actors,compromise,process:global administrator account>. ",
                "semantic_relationship": "[CoT]: The term \"compromise\" in the original relationship implies that the threat actors gained access to the global administrator account, which aligns with the system-level \"Inject\" relationship between processes. This indicates code injection or process injection where the threat actors' process injects code into the global administrator account process to gain control or execute commands. [System-level Relationships]: <process:threat actors,Inject,process:global administrator account>. "
            },
            {
                "phase": "privilege escalation",
                "relationship": "[Description]: The text states that threat actors grant roles that allow the creation of compute resources, indicating another process-to-process relationship where the threat actors (process) grant roles (process) .   [Original Relationships]: <process:threat actors,grant,process:roles that allow the creation of compute resources>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the threat actors granting roles that allow the creation of compute resources. In system-level terms, this action corresponds to a Process-to-Process \"Fork\" relationship, as the threat actors (parent process) are creating new processes (roles). Fork is the appropriate system-level term for process creation. [System-level Relationships]: <process:threat actors,Fork,process:roles that allow the creation of compute resources>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The text mentions that the attacker gains access to the tenant and performs reconnaissance, indicating interaction with the Tenant entity. [Original Relationships]: <process:attacker, gains access to, socket:tenant>. ",
                "semantic_relationship": "[CoT]: The original relationship \"gains access to\" implies the attacker is establishing a connection to the tenant socket, which aligns with the system-level \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:attacker,Connect,socket:tenant>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The attacker proceeds to hijack the subscription, showing manipulation of the Subscription entity. [Original Relationships]: <process:attacker, hijacks, socket:subscription>. ",
                "semantic_relationship": "[CoT]: The original relationship \"hijacks\" implies the attacker is taking control of the subscription socket, which aligns with the system-level \"Inject\" relationship between a process and a socket. [System-level Relationships]: <process:attacker,Inject,socket:subscription>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The threat actor migrates the subscription directory to another tenant, requiring access to the Subscription Directory entity. [Original Relationships]: <process:threat actor, migrates, socket:subscription directory>. ",
                "semantic_relationship": "[CoT]: The term \"migrates\" implies that the threat actor is writing data from the subscription directory to another location, which aligns with the system-level relationship \"Write\" between the process and the socket. [System-level Relationships]: <process:threat actor,Write,socket:subscription directory>. "
            },
            {
                "phase": "defense evasion",
                "relationship": "[Description]: The threat actor spins up additional resources, indicating interaction with the Resource entity. [Original Relationships]: <process:threat actor, spins up, socket:resource>. ",
                "semantic_relationship": "[CoT]: The term \"spins up\" in the original relationship implies that the threat actor is creating or establishing a connection to a resource, which aligns with the system-level \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:threat actor,Connect,socket:resource>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text states that threat actors without permission increase quotas and exhaust available core counts, indicating a process (threat actors) increasing a resource (core counts). [Original Relationships]: <process:threat actors,increase,core counts>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (threat actors) increasing a resource (core counts) without permission, which aligns with the system-level 'Inject' relationship between a process and a resource. This indicates the process is injecting into the resource to modify its attributes. [System-level Relationships]: <process:threat actors,Inject,process:core counts>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions that quota increases occur before resources are deployed by the threat actor, showing a process (threat actors) increasing a resource (quotas). [Original Relationships]: <process:threat actors,increase,quotas>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the threat actors increasing quotas, which implies modifying resource attributes (quotas) without creating, deleting, or modifying other resources. In system-level terms, this action corresponds to an \"Modify_Attribute\" relationship between the process (threat actors) and the resource (quotas). [System-level Relationships]: <process:threat actors,Modify_Attribute,file:quotas>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text describes that GPU compute offerings are targeted by threat actors for cryptocurrency mining, indicating a process (threat actors) using a resource (GPU compute offerings). [Original Relationships]: <process:threat actors,use,GPU compute offerings>. ",
                "semantic_relationship": "[CoT]: The original relationship \"use\" between the threat actors process and GPU compute offerings resource implies that the process is leveraging the GPU resources to perform computing tasks, which aligns with the system-level relationship \"Fork\" as it involves utilizing the hardware for computational efforts. [System-level Relationships]: <process:threat actors,Fork,process:GPU compute offerings>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text states that the NVIDIA A100 is the best mining card available, which is abused by threat actors, showing a process (threat actors) using a resource (NVIDIA A100 GPU compute option). [Original Relationships]: <process:threat actors,use,NVIDIA A100 GPU compute option>. ",
                "semantic_relationship": "[CoT]: The original relationship \"use\" between the process (threat actors) and the resource (NVIDIA A100 GPU compute option) is converted to \"Fork\" in the system-level framework. This indicates that the process is leveraging the GPU resource for computation, which aligns with the \"Fork\" relationship between a process and a device. [System-level Relationships]: <process:threat actors,Fork,process:NVIDIA A100 GPU compute option>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions that cryptojacking activities incur compute fees, indicating a process (cryptojacking activities) incurring a resource (compute fees). [Original Relationships]: <process:cryptojacking activities,incure,compute fees>. ",
                "semantic_relationship": "[CoT]: The original relationship \"incure\" implies that the cryptojacking activities are causing the compute fees to be incurred. In system-level terms, this is best represented as an \"Exit\" relationship from the process to the resource (compute fees). [System-level Relationships]: <process:cryptojacking activities,Exit,process:compute fees>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text states that threat actors have employed VM scale sets for rapid compute deployment, indicating a relationship between the threat actor (process) and VM scale sets (resource).   [Original Relationships]: <process:threat actor,employ,resource:VM scale sets>. ",
                "semantic_relationship": "[CoT]: The original relationship \"employ\" implies that the threat actor is utilizing VM scale sets for their attacks. In system-level terms, this utilization translates to the threat actor spawning or launching VM scale sets to scale their computation power, hence the \"Fork\" relationship. [System-level Relationships]: <process:threat actor,Fork,process:VM scale sets>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions that threat actors have used Azure Machine Learning compute instances for deploymen, showing a connection between the threat actors (process) and these instances (resource).   [Original Relationships]: <process:threat actor,employ,resource:Azure Machine Learning compute instances>. ",
                "semantic_relationship": "[CoT]: The original relationship \"employ\" implies that the threat actor process is utilizing the Azure Machine Learning compute instances for deployment purposes. In system-level terms, this utilization is best represented as a \"Fork\" relationship, where the process is fork another resource (the instance) to perform its actions. [System-level Relationships]: <process:threat actor,Fork,process:Azure Machine Learning compute instances>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text describes the use of Azure Batch for malicious compute provisioning, indicating a relationship between the threat actors (process) and Azure Batch (resource).   [Original Relationships]: <process:threat actor,employ,resource:Azure Batch>. ",
                "semantic_relationship": "[CoT]: The original relationship \"employ\" indicates that the threat actor is using Azure Batch for malicious activities. In system-level terms, this translates to the threat actor establishing a connection to Azure Batch to provision compute resources, hence the \"Connect\" relationship. [System-level Relationships]: <process:threat actor,Connect,socket:Azure Batch>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions that Azure Container Instances have been employed by threat actors for rapid compute deployment, showing a connection between the threat actors (process) and Azure Container Instances (resource).   [Original Relationships]: <process:threat actor,employ,resource:Azure Container Instances>. ",
                "semantic_relationship": "[CoT]: The term \"employ\" implies that the threat actor is using Azure Container Instances to perform actions, which in system-level terms typically translates to the \"Fork\" relationship between a process and a resource. This indicates the threat actor is spawning or launching containers from this resource. [System-level Relationships]: <process:threat actor,Fork,process:Azure Container Instances>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text states that the user compromised by threat actors had never provisioned compute before, indicating a relationship between the threat actor (process) and the user account (socket).   [Original Relationships]: <process:threat actor,compromise,socket:user accounts>. ",
                "semantic_relationship": "[CoT]: The term \"compromise\" in the original relationship implies that the threat actor (process) gained access to the user account (socket), which typically involves establishing a connection. Therefore, the system-level relationship is mapped to \"Connect\" as it represents the process-to-socket interaction where the threat actor process connects to the user account socket. [System-level Relationships]: <process:threat actor,Connect,socket:user accounts>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text describes the compromised user provisioning GPU compute, showing a relationship between the threat actor (process) and the GPU compute (resource).   [Original Relationships]: <process:threat actor,provision,resource:GPU compute>. ",
                "semantic_relationship": "[CoT]: The original relationship \"provision\" implies that the threat actor process is allocating or configuring GPU compute resources, which aligns with the system-level \"Fork\" relationship where a process manipulates another resource. [System-level Relationships]: <process:threat actor,Fork,process:GPU compute>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions the deployment of compute to regions anomalous for the environment, indicating a relationship between the threat actor (process) and the regions (socket).   [Original Relationships]: <process:threat actor,deploy,socket:regions>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the threat actor deploying to anomalous regions, which implies establishing a connection to these regions. In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:threat actor,Connect,socket:regions>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text describes a user creating large volumes of compute, showing a relationship between the threat actor (process) and the compute (resource).   [Original Relationships]: <process:threat actor,create,resource:compute>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the threat actor creating compute resources, which in system-level terms translates to a process creating a file (as compute is a type of resource filed under Filesystem). The 'Create' action in the original relationship maps to 'Create' in the system-level Process-to-File relationship. [System-level Relationships]: <process:threat actor,Create,file:compute>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions a user causing multiple deployment failures, indicating a relationship between the threat actor (process) and the deployment failures (socket).   [Original Relationships]: <process:threat actor,cause,socket:deployment failures>. ",
                "semantic_relationship": "[CoT]: The original relationship \"cause\" implies that the threat actor process is triggering or inducing deployment failures, which in system-level terms translates to a \"Connect\" relationship between a process and a socket. This indicates the process is attempting to establish a connection to the socket, which may result in deployment failures. [System-level Relationships]: <process:threat actor,Connect,socket:deployment failures>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text states that similar anomalous patterns can be identified in Azure ML compute instances, showing a relationship between the threat actor (process) and these instances (resource).   [Original Relationships]: <process:threat actor,identify,resource:Azure ML compute instances>. ",
                "semantic_relationship": "[CoT]: The original relationship \"identify\" implies that the threat actor process is inspecting or accessing the Azure ML compute instances, which aligns with the system-level \"Inject\" relationship where a process interacts with another process or resource to gather information. [System-level Relationships]: <process:threat actor,Inject,process:Azure ML compute instances>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions patterns in provisioning compute, indicating a relationship between the threat actor (process) and the provisioning (socket).   [Original Relationships]: <process:threat actor,provision,socket:provisioning>. ",
                "semantic_relationship": "[CoT]: The original relationship \"provision\" implies that the threat actor is establishing a connection to the provisioning socket, which aligns with the system-level \"Connect\" relationship between a process and a socket. [System-level Relationships]: <process:threat actor,Connect,socket:provisioning>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text describes compute being deployed to regions anomalous for the environment, showing a relationship between the threat actor (process) and the regions (socket).   [Original Relationships]: <process:threat actor,deploy,socket:regions>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the threat actor deploying to regions via sockets, which implies establishing a connection to these regions. In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:threat actor,Connect,socket:regions>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text states that threat actors use GPU Driver Extensions to facilitate driver installation, indicating a process-to-process relationship where the threat actor uses the GPU Driver Extension process. [Original Relationships]: <process:threat actor,use,process:GPU Driver Extension>. ",
                "semantic_relationship": "[CoT]: The original relationship \"use\" implies that the threat actor is executing the GPU Driver Extension process to facilitate driver installation. In system-level terms, this translates to an \"Fork\" relationship between the two processes. [System-level Relationships]: <process:threat actor,Fork,process:GPU Driver Extension>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions that threat actors deploy mining software to newly created VMs after compute is prepared, showing a process-to-process relationship where the threat actor deploys the mining software process. [Original Relationships]: <process:threat actor,deploy,process:mining software>. ",
                "semantic_relationship": "[CoT]: The term \"deploy\" in the original relationship implies that the threat actor is executing the mining software process on the affected VMs. In system-level terms, this aligns with the \"Fork\" relationship between processes. [System-level Relationships]: <process:threat actor,Fork,process:mining software>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text describes how the installed mining software joins the VM to a mining pool, indicating a process-to-socket relationship where the mining software joins to the mining pool domain. [Original Relationships]: <process:mining software,joins,socket:mining pool (domain name)>. ",
                "semantic_relationship": "[CoT]: The original relationship \"joins\" implies that the mining software is establishing a connection to the mining pool's domain (socket), which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:mining software,Connect,socket:mining pool (domain name)>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text lists several mining domains observed being used by threat actors, showing a process-to-socket relationship where the threat actor uses these mining domains (as sockets). [Original Relationships]: <process:threat actor,use,socket:mining domains>. ",
                "semantic_relationship": "[CoT]: The original relationship \"use\" between a process and a socket typically implies establishing a connection to the socket, which aligns with the system-level relationship \"Connect\" in the Process-to-Socket category. This indicates the threat actor is connecting to the mining domains for whatever purpose (likely command and control or resource retrieval). [System-level Relationships]: <process:threat actor,Connect,socket:mining domains>. "
            }
        ]
    }
]