[
    {
        "phase": "initial access",
        "content": "Escelar is distributed almost exclusively through phishing emails. A large number of emails were originally seen in the January 2015 period, and more e-mails have continued coming since then at a somewhat slower rate.\nFigure 2. Graph of sessions carrying Escalar each week in 2015\nThese emails are often labeled using the current date, and contain a generic message to entice the victim into running the attachment.\nFigure 3. Example email containing Escelar\nThe following top file names have been observed in attempted infections against Palo Alto Networks customers. Many of them include resume/curriculum vitae themes using female names.",
        "relationship": "[CoT]: The provided text describes the distribution method of Escelar malware through phishing emails but does not mention any specific interactions between processes, files, sockets, or registry entities. It focuses on the malware's delivery mechanism rather than its execution actions or interactions with system entities.",
        "semantic_relationship": "[CoT]: The description primarily discusses the distribution of Escelar malware via phishing emails, which involves sending malicious attachments or links. This corresponds to the 'Send' action in the system-level relationships framework for Sockets, as it involves transmitting data (malicious content) over a network connection (email transmission). The 'Send' action is the most appropriate mapping for this distribution method, as it describes the malware's network-based communication to deliver its payload. 返回\n[Description]: The provided text discusses the malware's ability to disable security tools like firewalls and antivirus software. This is achieved by modifying registry keys related to these security tools. Therefore, the system-level relationship for this action is 'Writekey' under the Registry category. 'Writekey' indicates that the malware is writing to registry keys to disable security tools, which aligns with the behavior described in the description. 返回\n[Description]: The provided text mentions that the malware terminates or inhibits the function of security software, such as firewalls and antivirus programs. This action implies the malware is manipulating or disabling these security tools. The system-level relationship that best maps to this behavior is 'Inject' under the Process category. 'Inject' is used when a process affects the behavior or state of another process, which aligns with the malware's interference with security software's functions. 返回"
    },
    {
        "phase": "execution",
        "content": "After the victim unzips and executes the attached file, an executable written in .NET will be run. These executables are often obfuscated to thwart reverse engineers and any security controls that may be in place on the victim's machine.\nImportant string names within Escelar samples are obfuscated using various cryptographic libraries. We have identified samples using both RijndaelEnhance and TripleDES.\nFigure 4. Cryptographic function contained in Escelar\nFigure 5. Encrypted string and decrypted version stored as a comment\nThis executable has limited functionality, and is only responsible for downloading an additional executable and establishing persistence via the Run registry key.\nIt begins by generating a random path of 8 alphabetic characters in the %APPDATA% directory. An executable name of 15 random alphabetic characters will hold to a soon-to-be-downloaded file. Escelar then makes a direct connection to a remote Microsoft SQL server and downloads a raw binary file to this local location.\nFigure 6. Microsoft SQL connection\nFigure 7. Acquiring raw binary image from Microsoft SQL server\nFigure 8. Raw binary image\nAfter this file successfully downloads, the following registry key is written to ensure persistence across reboots.\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run [Computer Name] : [Path to Executable]\nFinally, the downloaded malware is executed via a call to Interaction.Shell().",
        "relationship": "1. [CoT]: The text states that the victim executes the attached file, which is a file entity.   [Relationships]: <process:victim,executes,file:attached file>. \n2. [CoT]: The text mentions that a .NET executable is run, which is another file entity.   [Relationships]: <process:.NET,runs,file:executable>. \n3. [CoT]: The executable downloads an additional executable, which is a file entity.   [Relationships]: <process:executable,downloads,file:additional executable>. \n4. [CoT]: The executable establishes persistence via the Run registry key, which is a registry key entity.   [Relationships]: <process:executable,establishes,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run>. \n5. [CoT]: The executable generates a random path in the %APPDATA% directory, which is a file entity.   [Relationships]: <process:executable,generates,file:%APPDATA% directory>. \n6. [CoT]: The executable makes a direct connection to a remote Microsoft SQL server, which is a socket entity.   [Relationships]: <process:executable,makes connection to,socket:remote Microsoft SQL server>. \n7. [CoT]: The executable downloads a raw binary file, which is a file entity.   [Relationships]: <process:executable,downloads,file:raw binary file>. \n8. [CoT]: The executable writes the registry key to ensure persistence, which is a registry key entity.   [Relationships]: <process:executable,writes,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run>. \n9. [CoT]: The downloaded malware is executed, which is a process entity.   [Relationships]: <process:Interaction.Shell(),executes,file:malware>. ",
        "semantic_relationship": "[CoT]: The original relationship \"executes\" indicates that the process \"victim\" is running or launching the file \"attached file\". In system-level terms, this corresponds to the \"Execute\" relationship between a process and a file. [System-level Relationships]: <process:victim,Execute,file:attached file>. \n[CoT]: The original relationship \"runs\" indicates that the process:.NET is executing the file:executable, which corresponds to the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:.NET,Execute,file:executable>. \n[CoT]: The term \"downloads\" in the original relationship implies that the executable is writing the additional executable to disk, which corresponds to the \"Write\" action in the system-level relationships framework. [System-level Relationships]: <process:executable,Write,file:additional executable>. \n[CoT]: The original relationship describes the executable establishing persistence via the Run registry key, which involves writing to the registry. In system-level terms, this action corresponds to a Process-to-Registry \"Writekey\" relationship, as the process is modifying the registry key to achieve persistence. [System-level Relationships]: <process:executable,Writekey,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run>. \n[CoT]: The original relationship states that the executable \"generates\" a random path in the %APPDATA% directory. In system-level terms, this action corresponds to the process creating a new file (path) in the specified directory, hence the \"Create\" relationship. [System-level Relationships]: <process:executable,Create,file:%APPDATA% directory>. \n[CoT]: The original relationship \"makes connection to\" indicates a network connection being established between a process and a socket, which directly maps to the system-level relationship \"Connect\" in the Process-to-Socket category. [System-level Relationships]: <process:executable,Connect,socket:remote Microsoft SQL server>. \n[CoT]: The term \"downloads\" in the original relationship implies that the executable is writing the raw binary file to disk, which corresponds to the \"Write\" action in the system-level relationships framework. [System-level Relationships]: <process:executable,Write,file:raw binary file>. \n[CoT]: The original relationship describes the executable writing to a registry key, which directly corresponds to the system-level relationship 'Writekey' between a process and a registry key. [System-level Relationships]: <process:executable,Writekey,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run>. \n[CoT]: The original relationship \"executes\" indicates that the process Interaction.Shell() is running the file malware, which directly translates to the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:Interaction.Shell(),Execute,file:malware>. "
    },
    {
        "phase": "command and control",
        "content": "The second stage of the Escelar malware family shares many characteristics with the first stage. Both samples make use of direct Microsoft SQL connections, as well as encryption of important strings within the binary. They're also both written in .NET and are often obfuscated.\nThis sample is once again another downloader, grabbing a raw binary image from a remote Microsoft SQL server and storing it to the following path:\n%TEMP%\\\\JO[Computer Name][Computer Virtual Memory].exe\nFigure 9. Stored image in Microsoft SQL server\nFinally, the malware is executed via a call to Interaction.Shell().",
        "relationship": "1. [CoT]: The text states that the Escelar malware grabs a binary image from a remote Microsoft SQL server, indicating a process-to-socket interaction where the process (Escelar malware) performs the action 'grabbing' on the socket (remote Microsoft SQL server).   [Relationships]: <process:Escelar malware,grabbing,socket:remote Microsoft SQL server>. \n2. [CoT]: The text describes that the malware stores the grabbed binary image to a specific path, indicating a process-to-file interaction where the process (Escelar malware) performs the action 'storing' on the file (%TEMP%\\\\JO[Computer Name][Computer Virtual Memory].exe).   [Relationships]: <process:Escelar malware,storing,file:%TEMP%\\\\JO[Computer Name][Computer Virtual Memory].exe>. ",
        "semantic_relationship": "[CoT]: The term 'grabbing' in the original relationship implies that the process is receiving data from the socket, which aligns with the system-level relationship 'Receive' between a process and a socket. [System-level Relationships]: <process:Escelar malware,Receive,socket:remote Microsoft SQL server>. \n[CoT]: The original relationship describes the Escelar malware storing (writing) data to a file, which corresponds to the system-level 'Write' action between a process and a file. [System-level Relationships]: <process:Escelar malware,Write,file:%TEMP%\\\\JO[Computer Name][Computer Virtual Memory].exe>. "
    },
    {
        "phase": "command and control",
        "content": "The third stage of the malware contains the banking Trojan itself. Once again this binary is written in .NET and makes direct connections to Microsoft SQL servers. It begins by droppingJCS.Components.NeroBar.dllin the Startup folder. This DLL is used to generate progress bars and is used when the attacker chooses to generate a 'blocker' on the victim's banking webpage, which we discuss later in this section.\nThe malware proceeds to identify the following DLLs, which are used by various Brazilian banks to prevent malicious activity. The identifier is stored in the Microsoft SQL database in order to alert the attacker as to what plugins are installed.\nThe IdPC identifier in the following image is made up of the following data.\nComputer Name \nProcessor ID \nHD Serial \nPhysical Memory \nVirtual Memory\nFigure 10. Victim infections of Escelar listed in the Database\nThe malware monitors the victim's browser activity. In the event they user attempts to navigate to one of the following Brazilian banking websites, the malware takes action.\nhttps://internetbanking.caixa.gov.br/SIIBC/index.processa \nhttp://www.bradesco.com.br/ \nhttp://www.bb.com.br/ \nhttps://www.itau.com.br/ \nhttps://www.santander.com.br \nhttps://www.sicredi.com.br \nhttp://www.hsbc.com.br/1/2/br/para-sua-empresa\nShould the victim try to open any of these banking websites in a browser other than Internet Explorer, the malware will generate a false error, close the current browser, and re-open the link in Internet Explorer.\nFigure 11. False error displayed to the victim when viewing a targeted page in Google Chrome\nThe attacker has the ability to send a number of different commands in the 'fun' column of the Microsoft SQL server.\nFigure 12. Commands being sent to victims\nEscalar can accept the commands show below (with their translations).\nThese commands allow the attacker to manipulate a victim's banking web session and perform fraudulent transactions among other functions.\nThe following screenshot shows an image that is used by the malware in order to trick victims into entering the unique authentication code sent by banks to the victim's cellular telephone. This data is uploaded to the attackers in order to conduct fraudulent transactions.\nFigure 13. Escelar tricking a victim into entering the authentication code sent to their cell phone\nThe following screenshot shows examples of an attacker blocking a victim's banking web session in Internet Explorer.\nFigure 14. Blocking of victim's banking web session\nThese pages are specific to the bank the victim is using, as we can see in the following second example.\nFigure 15. Blocking of victim's banking web session",
        "relationship": "1. [CoT]: The text states that the malware drops 'JCS.Components.NeroBar.dll' into the Startup folder, indicating a process-to-file relationship where the malware process drops the file.   [Relationships]: <process:malware,drops,file:JCS.Components.NeroBar.dll>. \n2. [CoT]: The text mentions that the malware monitors the victim's browser activity, specifically targeting certain Brazilian banking websites listed, indicating a process-to-socket relationship where the malware process monitors the victim's browsing actions on these websites.   [Relationships]: <process:malware,monitors,socket:https://internetbanking.caixa.gov.br/SIIBC/index.processa>. \n3. [CoT]: Similar to the previous relationship, the malware monitors browsing activities on more Brazilian banking websites, establishing another process-to-socket relationship.   [Relationships]: <process:malware,monitors,socket:http://www.bradesco.com.br/>. \n4. [CoT]: The malware continues to monitor victim's interactions with various banking websites, maintaining the process-to-socket relationship.   [Relationships]: <process:malware,monitors,socket:http://www.bb.com.br/>. \n5. [CoT]: The malware targets yet another Brazilian banking website in its monitoring efforts, showing consistency in its pattern.   [Relationships]: <process:malware,monitors,socket:https://www.itau.com.br/>. \n6. [CoT]: The malware expands its surveillance to include yet another Brazilian banking domain, indicating a process-to-socket relationship.   [Relationships]: <process:malware,monitors,socket:https://www.santander.com.br/>. \n7. [CoT]: The malware monitors yet another Brazilian banking website as part of its routine activities, maintaining the process-to-socket relationship.   [Relationships]: <process:malware,monitors,socket:https://www.sicredi.com.br/>. \n8. [CoT]: The malware watches for victim's access to a specific HSBC banking URL, showing its wide coverage of targets.   [Relationships]: <process:malware,monitors,socket:http://www.hsbc.com.br/1/2/br/para-sua-empresa>. \n9. [CoT]: The text describes that the malware generates a false error and closes the current browser, indicating a process-to-process relationship where the malware process closes the current browser process (implied as Google Chrome).   [Relationships]: <process:malware,closes,process:Google Chrome>. \n10. [CoT]: The malware re-opens the link in Internet Explorer, showing another process-to-process relationship where the malware process re-opens the link in Internet Explorer.   [Relationships]: <process:malware,re-opens,process:Internet Explorer>. \n11. [CoT]: The text mentions that Escalar can accept commands from the attacker, indicating a process-to-process relationship where the attacker process sends commands to the Escalar process.   [Relationships]: <process:attacker,sends,process:Escalar>. \n12. [CoT]: The malware uploads data, specifically an authentication code, to the attackers, indicating a process-to-file relationship where the malware process uploads the unique authentication code file.   [Relationships]: <process:malware,uploads,file:authentication code>. \n13. [CoT]: The malware blocks the victim's banking web session in Internet Explorer, indicating a process-to-process relationship where the malware process blocks the Internet Explorer process.   [Relationships]: <process:malware,blocks,process:Internet Explorer>. ",
        "semantic_relationship": "[CoT]: The term 'drops' in the original relationship implies that the malware process is creating a new file in the system, which corresponds to the 'Create' action in the system-level relationships framework for Process-to-File interactions. [System-level Relationships]: <process:malware,Create,file:JCS.Components.NeroBar.dll>. \n[CoT]: The original relationship describes the malware monitoring the victim's browsing activity on specific banking websites, which implies the malware is establishing a connection to these sockets to gather data. Therefore, the system-level relationship is 'Connect' as the malware process is initiating a connection to the socket (website). [System-level Relationships]: <process:malware,Connect,socket:https://internetbanking.caixa.gov.br/SIIBC/index.processa>. \n[CoT]: The original relationship states that the malware \"monitors\" browsing activities on a banking website, which implies that the malware is establishing a connection to the socket (website). In system-level terms, this corresponds to a \"Connect\" relationship between the process and the socket. [System-level Relationships]: <process:malware,Connect,socket:http://www.bradesco.com.br/>. \n[CoT]: The original relationship \"monitors\" indicates that the malware is establishing a connection to the specified banking website, which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:http://www.bb.com.br/>. \n[CoT]: The original relationship \"monitors\" implies that the malware is establishing a connection to the specified socket (https://www.itau.com.br/), which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:https://www.itau.com.br/>. \n[CoT]: The original relationship \"monitors\" indicates that the malware is establishing a connection to the socket (https://www.santander.com.br/), which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:https://www.santander.com.br/>. \n[CoT]: The original relationship \"monitors\" implies that the malware is establishing a connection to the specified socket (banking website), which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:https://www.sicredi.com.br/>. \n[CoT]: The original relationship \"monitors\" indicates that the malware is tracking or observing the victim's access to the specified URL, which implies it is establishing a connection to the socket. In system-level terms, this corresponds to a \"Connect\" relationship between the process and the socket. [System-level Relationships]: <process:malware,Connect,socket:http://www.hsbc.com.br/1/2/br/para-sua-empresa>. \n[CoT]: The original relationship \"closes\" implies that the malware process is terminating the Google Chrome process. In system-level terms, this corresponds to the \"Exit\" relationship between processes. [System-level Relationships]: <process:malware,Exit,process:Google Chrome>. \n[CoT]: The term \"re-opens\" in the original relationship implies that the malware process is injecting code into the Internet Explorer process to cause it to open a new link. Therefore, the system-level relationship is \"Inject\". [System-level Relationships]: <process:malware,Inject,process:Internet Explorer>. \n[CoT]: The original relationship \"sends\" indicates that the attacker process is sending commands to the Escalar process. In system-level terms, this corresponds to the \"Send\" relationship between processes. [System-level Relationships]: <process:attacker,Send,process:Escalar>. \n[CoT]: The original relationship \"uploads\" implies that the malware process is writing data to the authentication code file, which aligns with the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:malware,Write,file:authentication code>. \n[CoT]: The original relationship \"blocks\" implies that the malware process is interfering with or terminating the Internet Explorer process. In system-level terms, this interference typically manifests as a fork operation where one process forces another process to exit. Therefore, the correct system-level relationship is \"Exit\". [System-level Relationships]: <process:malware,Exit,process:Internet Explorer>. "
    },
    {
        "phase": "credential access",
        "content": "Escelar includes a component that is responsible for harvesting credentials from the following web services.\nGmail \nHotmail \nWebmail (any website containing the string \"webmail\" in the URL)\nThese credentials are stored in a remote Microsoft SQL server. The harvested email credentials are then used by the attackers to send additional e-mails containing Escelar. The total sum of emails in the database displayed below indicated that 3,057 emails had been sent from these addresses. The SQL server keeps track of the number of emails sent by each email address.\nFigure 16. Table containing email addresses and tallies of spam emails sent\nBy harvesting email credentials from Escelar victims, the malware authors are able to further propagate Escelar in the event a portion of the email senders are blocked.",
        "relationship": "1. [CoT]: The text states that Escelar harvests credentials from Gmail, which is a process (Escelar) interacting with a socket (Gmail).   [Relationships]: <process:Escelar,harvests,socket:Gmail>. \n2. [CoT]: The text mentions that Escelar harvests credentials from Hotmail, which is a process (Escelar) interacting with a socket (Hotmail).   [Relationships]: <process:Escelar,harvests,socket:Hotmail>. \n3. [CoT]: The text describes that Escelar harvests credentials from any website containing \"webmail\" in the URL, which is a process (Escelar) interacting with a socket (webmail website).   [Relationships]: <process:Escelar,harvests,socket:webmail website>. \n4. [CoT]: The text states that the harvested credentials (stored as email addresses) are stored in a remote Microsoft SQL server, which is a process (Escelar) interacting with a socket (Microsoft SQL server).   [Relationships]: <process:Escelar,stores,socket:Microsoft SQL server>. \n5. [CoT]: The text indicates that the harvested email credentials are used to send additional emails, which is a process (Escelar) interacting with a socket (emails sent).   [Relationships]: <process:Escelar,uses,socket:emails sent>. ",
        "semantic_relationship": "[CoT]: The original relationship describes a process (Escelar) harvesting credentials from Gmail, which implies the process is receiving data (credentials) from the socket (Gmail). In system-level terms, this corresponds to a 'Receive' relationship between the process and socket. [System-level Relationships]: <process:Escelar,Receive,socket:Gmail>. \n[CoT]: The original relationship describes Escelar harvesting credentials from Hotmail, which implies that Escelar is receiving data (credentials) from Hotmail's socket. In system-level terms, this corresponds to a 'Receive' relationship between the process and the socket. [System-level Relationships]: <process:Escelar,Receive,socket:Hotmail>. \n[CoT]: The original relationship describes Escelar harvesting credentials from webmail websites, which implies the process is receiving data (credentials) from the socket (webmail website). In system-level terms, this corresponds to the 'Receive' relationship between a process and a socket. [System-level Relationships]: <process:Escelar,Receive,socket:webmail website>. \n[CoT]: The original relationship states that the process \"Escelar\" stores data in a remote Microsoft SQL server, which is represented as a socket. In system-level terms, this action corresponds to writing data to a socket, hence the relationship is updated to \"Write\" between the process and the socket. [System-level Relationships]: <process:Escelar,Write,socket:Microsoft SQL server>. \n[CoT]: The original relationship \"uses\" between a process and a socket typically implies that the process is establishing a connection to the socket, which in this case describes sending emails. Therefore, the system-level relationship is mapped to \"Connect\". [System-level Relationships]: <process:Escelar,Connect,socket:emails sent>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The provided text describes the distribution method of Escelar malware through phishing emails but does not mention any specific interactions between processes, files, sockets, or registry entities. It focuses on the malware's delivery mechanism rather than its execution actions or interactions with system entities.",
                "semantic_relationship": "[CoT]: The description primarily discusses the distribution of Escelar malware via phishing emails, which involves sending malicious attachments or links. This corresponds to the 'Send' action in the system-level relationships framework for Sockets, as it involves transmitting data (malicious content) over a network connection (email transmission). The 'Send' action is the most appropriate mapping for this distribution method, as it describes the malware's network-based communication to deliver its payload. 返回\n[Description]: The provided text discusses the malware's ability to disable security tools like firewalls and antivirus software. This is achieved by modifying registry keys related to these security tools. Therefore, the system-level relationship for this action is 'Writekey' under the Registry category. 'Writekey' indicates that the malware is writing to registry keys to disable security tools, which aligns with the behavior described in the description. 返回\n[Description]: The provided text mentions that the malware terminates or inhibits the function of security software, such as firewalls and antivirus programs. This action implies the malware is manipulating or disabling these security tools. The system-level relationship that best maps to this behavior is 'Inject' under the Process category. 'Inject' is used when a process affects the behavior or state of another process, which aligns with the malware's interference with security software's functions. 返回"
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the victim executes the attached file, which is a file entity.   [Original Relationships]: <process:victim,executes,file:attached file>. ",
                "semantic_relationship": "[CoT]: The original relationship \"executes\" indicates that the process \"victim\" is running or launching the file \"attached file\". In system-level terms, this corresponds to the \"Execute\" relationship between a process and a file. [System-level Relationships]: <process:victim,Execute,file:attached file>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that a .NET executable is run, which is another file entity.   [Original Relationships]: <process:.NET,runs,file:executable>. ",
                "semantic_relationship": "[CoT]: The original relationship \"runs\" indicates that the process:.NET is executing the file:executable, which corresponds to the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:.NET,Execute,file:executable>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The executable downloads an additional executable, which is a file entity.   [Original Relationships]: <process:executable,downloads,file:additional executable>. ",
                "semantic_relationship": "[CoT]: The term \"downloads\" in the original relationship implies that the executable is writing the additional executable to disk, which corresponds to the \"Write\" action in the system-level relationships framework. [System-level Relationships]: <process:executable,Write,file:additional executable>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The executable establishes persistence via the Run registry key, which is a registry key entity.   [Original Relationships]: <process:executable,establishes,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the executable establishing persistence via the Run registry key, which involves writing to the registry. In system-level terms, this action corresponds to a Process-to-Registry \"Writekey\" relationship, as the process is modifying the registry key to achieve persistence. [System-level Relationships]: <process:executable,Writekey,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The executable generates a random path in the %APPDATA% directory, which is a file entity.   [Original Relationships]: <process:executable,generates,file:%APPDATA% directory>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the executable \"generates\" a random path in the %APPDATA% directory. In system-level terms, this action corresponds to the process creating a new file (path) in the specified directory, hence the \"Create\" relationship. [System-level Relationships]: <process:executable,Create,file:%APPDATA% directory>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The executable makes a direct connection to a remote Microsoft SQL server, which is a socket entity.   [Original Relationships]: <process:executable,makes connection to,socket:remote Microsoft SQL server>. ",
                "semantic_relationship": "[CoT]: The original relationship \"makes connection to\" indicates a network connection being established between a process and a socket, which directly maps to the system-level relationship \"Connect\" in the Process-to-Socket category. [System-level Relationships]: <process:executable,Connect,socket:remote Microsoft SQL server>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The executable downloads a raw binary file, which is a file entity.   [Original Relationships]: <process:executable,downloads,file:raw binary file>. ",
                "semantic_relationship": "[CoT]: The term \"downloads\" in the original relationship implies that the executable is writing the raw binary file to disk, which corresponds to the \"Write\" action in the system-level relationships framework. [System-level Relationships]: <process:executable,Write,file:raw binary file>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The executable writes the registry key to ensure persistence, which is a registry key entity.   [Original Relationships]: <process:executable,writes,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the executable writing to a registry key, which directly corresponds to the system-level relationship 'Writekey' between a process and a registry key. [System-level Relationships]: <process:executable,Writekey,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The downloaded malware is executed, which is a process entity.   [Original Relationships]: <process:Interaction.Shell(),executes,file:malware>. ",
                "semantic_relationship": "[CoT]: The original relationship \"executes\" indicates that the process Interaction.Shell() is running the file malware, which directly translates to the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:Interaction.Shell(),Execute,file:malware>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the Escelar malware grabs a binary image from a remote Microsoft SQL server, indicating a process-to-socket interaction where the process (Escelar malware) performs the action 'grabbing' on the socket (remote Microsoft SQL server).   [Original Relationships]: <process:Escelar malware,grabbing,socket:remote Microsoft SQL server>. ",
                "semantic_relationship": "[CoT]: The term 'grabbing' in the original relationship implies that the process is receiving data from the socket, which aligns with the system-level relationship 'Receive' between a process and a socket. [System-level Relationships]: <process:Escelar malware,Receive,socket:remote Microsoft SQL server>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes that the malware stores the grabbed binary image to a specific path, indicating a process-to-file interaction where the process (Escelar malware) performs the action 'storing' on the file (%TEMP%\\\\JO[Computer Name][Computer Virtual Memory].exe).   [Original Relationships]: <process:Escelar malware,storing,file:%TEMP%\\\\JO[Computer Name][Computer Virtual Memory].exe>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the Escelar malware storing (writing) data to a file, which corresponds to the system-level 'Write' action between a process and a file. [System-level Relationships]: <process:Escelar malware,Write,file:%TEMP%\\\\JO[Computer Name][Computer Virtual Memory].exe>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the malware drops 'JCS.Components.NeroBar.dll' into the Startup folder, indicating a process-to-file relationship where the malware process drops the file.   [Original Relationships]: <process:malware,drops,file:JCS.Components.NeroBar.dll>. ",
                "semantic_relationship": "[CoT]: The term 'drops' in the original relationship implies that the malware process is creating a new file in the system, which corresponds to the 'Create' action in the system-level relationships framework for Process-to-File interactions. [System-level Relationships]: <process:malware,Create,file:JCS.Components.NeroBar.dll>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that the malware monitors the victim's browser activity, specifically targeting certain Brazilian banking websites listed, indicating a process-to-socket relationship where the malware process monitors the victim's browsing actions on these websites.   [Original Relationships]: <process:malware,monitors,socket:https://internetbanking.caixa.gov.br/SIIBC/index.processa>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the malware monitoring the victim's browsing activity on specific banking websites, which implies the malware is establishing a connection to these sockets to gather data. Therefore, the system-level relationship is 'Connect' as the malware process is initiating a connection to the socket (website). [System-level Relationships]: <process:malware,Connect,socket:https://internetbanking.caixa.gov.br/SIIBC/index.processa>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: Similar to the previous relationship, the malware monitors browsing activities on more Brazilian banking websites, establishing another process-to-socket relationship.   [Original Relationships]: <process:malware,monitors,socket:http://www.bradesco.com.br/>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the malware \"monitors\" browsing activities on a banking website, which implies that the malware is establishing a connection to the socket (website). In system-level terms, this corresponds to a \"Connect\" relationship between the process and the socket. [System-level Relationships]: <process:malware,Connect,socket:http://www.bradesco.com.br/>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware continues to monitor victim's interactions with various banking websites, maintaining the process-to-socket relationship.   [Original Relationships]: <process:malware,monitors,socket:http://www.bb.com.br/>. ",
                "semantic_relationship": "[CoT]: The original relationship \"monitors\" indicates that the malware is establishing a connection to the specified banking website, which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:http://www.bb.com.br/>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware targets yet another Brazilian banking website in its monitoring efforts, showing consistency in its pattern.   [Original Relationships]: <process:malware,monitors,socket:https://www.itau.com.br/>. ",
                "semantic_relationship": "[CoT]: The original relationship \"monitors\" implies that the malware is establishing a connection to the specified socket (https://www.itau.com.br/), which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:https://www.itau.com.br/>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware expands its surveillance to include yet another Brazilian banking domain, indicating a process-to-socket relationship.   [Original Relationships]: <process:malware,monitors,socket:https://www.santander.com.br/>. ",
                "semantic_relationship": "[CoT]: The original relationship \"monitors\" indicates that the malware is establishing a connection to the socket (https://www.santander.com.br/), which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:https://www.santander.com.br/>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware monitors yet another Brazilian banking website as part of its routine activities, maintaining the process-to-socket relationship.   [Original Relationships]: <process:malware,monitors,socket:https://www.sicredi.com.br/>. ",
                "semantic_relationship": "[CoT]: The original relationship \"monitors\" implies that the malware is establishing a connection to the specified socket (banking website), which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:malware,Connect,socket:https://www.sicredi.com.br/>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware watches for victim's access to a specific HSBC banking URL, showing its wide coverage of targets.   [Original Relationships]: <process:malware,monitors,socket:http://www.hsbc.com.br/1/2/br/para-sua-empresa>. ",
                "semantic_relationship": "[CoT]: The original relationship \"monitors\" indicates that the malware is tracking or observing the victim's access to the specified URL, which implies it is establishing a connection to the socket. In system-level terms, this corresponds to a \"Connect\" relationship between the process and the socket. [System-level Relationships]: <process:malware,Connect,socket:http://www.hsbc.com.br/1/2/br/para-sua-empresa>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes that the malware generates a false error and closes the current browser, indicating a process-to-process relationship where the malware process closes the current browser process (implied as Google Chrome).   [Original Relationships]: <process:malware,closes,process:Google Chrome>. ",
                "semantic_relationship": "[CoT]: The original relationship \"closes\" implies that the malware process is terminating the Google Chrome process. In system-level terms, this corresponds to the \"Exit\" relationship between processes. [System-level Relationships]: <process:malware,Exit,process:Google Chrome>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware re-opens the link in Internet Explorer, showing another process-to-process relationship where the malware process re-opens the link in Internet Explorer.   [Original Relationships]: <process:malware,re-opens,process:Internet Explorer>. ",
                "semantic_relationship": "[CoT]: The term \"re-opens\" in the original relationship implies that the malware process is injecting code into the Internet Explorer process to cause it to open a new link. Therefore, the system-level relationship is \"Inject\". [System-level Relationships]: <process:malware,Inject,process:Internet Explorer>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that Escalar can accept commands from the attacker, indicating a process-to-process relationship where the attacker process sends commands to the Escalar process.   [Original Relationships]: <process:attacker,sends,process:Escalar>. ",
                "semantic_relationship": "[CoT]: The original relationship \"sends\" indicates that the attacker process is sending commands to the Escalar process. In system-level terms, this corresponds to the \"Send\" relationship between processes. [System-level Relationships]: <process:attacker,Send,process:Escalar>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware uploads data, specifically an authentication code, to the attackers, indicating a process-to-file relationship where the malware process uploads the unique authentication code file.   [Original Relationships]: <process:malware,uploads,file:authentication code>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uploads\" implies that the malware process is writing data to the authentication code file, which aligns with the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:malware,Write,file:authentication code>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The malware blocks the victim's banking web session in Internet Explorer, indicating a process-to-process relationship where the malware process blocks the Internet Explorer process.   [Original Relationships]: <process:malware,blocks,process:Internet Explorer>. ",
                "semantic_relationship": "[CoT]: The original relationship \"blocks\" implies that the malware process is interfering with or terminating the Internet Explorer process. In system-level terms, this interference typically manifests as a fork operation where one process forces another process to exit. Therefore, the correct system-level relationship is \"Exit\". [System-level Relationships]: <process:malware,Exit,process:Internet Explorer>. "
            },
            {
                "phase": "credential access",
                "relationship": "[Description]: The text states that Escelar harvests credentials from Gmail, which is a process (Escelar) interacting with a socket (Gmail).   [Original Relationships]: <process:Escelar,harvests,socket:Gmail>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (Escelar) harvesting credentials from Gmail, which implies the process is receiving data (credentials) from the socket (Gmail). In system-level terms, this corresponds to a 'Receive' relationship between the process and socket. [System-level Relationships]: <process:Escelar,Receive,socket:Gmail>. "
            },
            {
                "phase": "credential access",
                "relationship": "[Description]: The text mentions that Escelar harvests credentials from Hotmail, which is a process (Escelar) interacting with a socket (Hotmail).   [Original Relationships]: <process:Escelar,harvests,socket:Hotmail>. ",
                "semantic_relationship": "[CoT]: The original relationship describes Escelar harvesting credentials from Hotmail, which implies that Escelar is receiving data (credentials) from Hotmail's socket. In system-level terms, this corresponds to a 'Receive' relationship between the process and the socket. [System-level Relationships]: <process:Escelar,Receive,socket:Hotmail>. "
            },
            {
                "phase": "credential access",
                "relationship": "[Description]: The text describes that Escelar harvests credentials from any website containing \"webmail\" in the URL, which is a process (Escelar) interacting with a socket (webmail website).   [Original Relationships]: <process:Escelar,harvests,socket:webmail website>. ",
                "semantic_relationship": "[CoT]: The original relationship describes Escelar harvesting credentials from webmail websites, which implies the process is receiving data (credentials) from the socket (webmail website). In system-level terms, this corresponds to the 'Receive' relationship between a process and a socket. [System-level Relationships]: <process:Escelar,Receive,socket:webmail website>. "
            },
            {
                "phase": "credential access",
                "relationship": "[Description]: The text states that the harvested credentials (stored as email addresses) are stored in a remote Microsoft SQL server, which is a process (Escelar) interacting with a socket (Microsoft SQL server).   [Original Relationships]: <process:Escelar,stores,socket:Microsoft SQL server>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process \"Escelar\" stores data in a remote Microsoft SQL server, which is represented as a socket. In system-level terms, this action corresponds to writing data to a socket, hence the relationship is updated to \"Write\" between the process and the socket. [System-level Relationships]: <process:Escelar,Write,socket:Microsoft SQL server>. "
            },
            {
                "phase": "credential access",
                "relationship": "[Description]: The text indicates that the harvested email credentials are used to send additional emails, which is a process (Escelar) interacting with a socket (emails sent).   [Original Relationships]: <process:Escelar,uses,socket:emails sent>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uses\" between a process and a socket typically implies that the process is establishing a connection to the socket, which in this case describes sending emails. Therefore, the system-level relationship is mapped to \"Connect\". [System-level Relationships]: <process:Escelar,Connect,socket:emails sent>. "
            }
        ]
    }
]