[
    {
        "phase": "initial access",
        "content": "The attackers penetrated the enterprise network using carefully crafted phishing emails, some of which use information that is specific to the organization under attack and is not publicly available. This could indicate that the attackers did preparatory work in advance (they may have obtained the information in earlier attacks on the same organization or its employees, or on other organizations or individuals associated with the victim organization). \nMicrosoft Word documents attached to the phishing emails contained malicious code that exploits the CVE-2017-11882 vulnerability. The vulnerability enables an attacker to execute arbitrary code (in the attacks analyzed, the main module of the PortDoor malware) without any additional user activity. \nAn earlier series of attacks in which the PortDoor malware was also used was described by Cybereason experts. A new version of PortDoor was identified in the course of our research. ",
        "relationship": "1. [CoT]: The text mentions that Microsoft Word documents contained malicious code that exploits the CVE-2017-11882 vulnerability, indicating a relationship between Microsoft Word and the vulnerability. [Relationships]: <process:Microsoft Word,contains,vulnerability:CVE-2017-11882>. \n2. [CoT]: The text states that the malicious code executes the main module of the PortDoor malware, showing a relationship between the malicious code and the PortDoor malware. [Relationships]: <process:malicious code,executes,process:PortDoor malware>. \n3. [CoT]: The text describes how the attackers used phishing emails with malicious Microsoft Word documents to penetrate the enterprise network, indicating a relationship between the attackers and the phishing emails. [Relationships]: <process:attackers,used,process:phishing emails>. \n4. [CoT]: The text mentions that the attackers used phishing emails with malicious Microsoft Word documents to penetrate the enterprise network, showing a relationship between the attackers and Microsoft Word documents. [Relationships]: <process:attackers,used,process:Microsoft Word documents>. ",
        "semantic_relationship": "[CoT]: The original relationship states that Microsoft Word \"contains\" the vulnerability CVE-2017-11882. In system-level terms, this implies that the vulnerability is being exploited by Microsoft Word, which aligns with the \"Inject\" relationship between a process and a vulnerability. [System-level Relationships]: <process:Microsoft Word,Inject,vulnerability:CVE-2017-11882>. \n[CoT]: The original relationship \"executes\" indicates that the malicious code is launching or running the PortDoor malware, which corresponds to the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:malicious code,Fork,process:PortDoor malware>. \n[CoT]: The original relationship \"used\" implies that the attackers executed the phishing emails to send them, which aligns with the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:attackers,Fork,process:phishing emails>. \n[CoT]: The original relationship \"used\" implies that the attackers executed the Microsoft Word documents to penetrate the network, which aligns with the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:attackers,Fork,process:Microsoft Word documents>. "
    },
    {
        "phase": "command and control",
        "content": "After being launched, PortDoor collects general information on the infected system and sends it to the malware command-and-control (CnC) server. In cases where an infected system is of interest to the attackers, they use the PortDoor functionality to control the system remotely and install additional malware. ",
        "relationship": "1. [CoT]: The text states that PortDoor collects information and sends it to the CnC server, indicating a process-to-socket relationship where PortDoor is the process and CnC server is the socket.  [Relationships]: <process:PortDoor,sends,socket:malware command-and-control (CnC) server>. ",
        "semantic_relationship": "[CoT]: The original relationship \"sends\" indicates a data transmission from the process PortDoor to the socket (CnC server). In system-level terms, this corresponds to the \"Send\" action between a process and a socket. [System-level Relationships]: <process:PortDoor,Send,socket:malware command-and-control (CnC) server>. "
    },
    {
        "phase": "command and control",
        "content": "The attackers used five different backdoors at the same time – probably to set up redundant communication channels with infected systems in case one of the malicious programs was detected and removed by a security solution. The backdoors used provide extensive functionality for controlling infected systems and collecting confidential data. \nOf the six backdoors identified on infected systems, five (PortDoor, nccTrojan, Logtu, Cotx, and DNSep) have been used earlier in attacks attributed by other researchers to APT TA428. The sixth backdoor is new and has not been observed in other attacks. ",
        "relationship": "1. [CoT]: The text states that the attackers used five different backdoors, indicating a process-to-process relationship where the attackers (process) used (verb) the backdoors (process).   [Relationships]: <process:attackers,used,process:backdoors>. \n2. [CoT]: The text mentions that the backdoors provide functionality for controlling infected systems, indicating a process-to-process relationship where the backdoors (process) control (verb) the infected systems (process).   [Relationships]: <process:backdoors,control,process:infected systems>. \n3. [CoT]: The text states that the backdoors collect confidential data, indicating a process-to-file relationship where the backdoors (process) collect (verb) confidential data (file).   [Relationships]: <process:backdoors,collect,file:confidential data>. \n4. [CoT]: The text mentions that the backdoors have been used in attacks attributed to APT TA428, indicating a process-to-process relationship where APT TA428 (process) used (verb) the backdoors (process).   [Relationships]: <process:APT TA428,used,process:backdoors>. \n5. [CoT]: The text describes a new backdoor that has not been observed in other attacks, indicating a process-to-process relationship where other attacks (process) used (verb) the new backdoor (process). [Relationships]: <process:other attacks,used,process:new backdoor>. ",
        "semantic_relationship": "[CoT]: The verb \"used\" in the original relationship implies that the attackers (process) executed the backdoors (process) to gain access. In system-level terms, this corresponds to an \"Fork\" relationship between processes. [System-level Relationships]: <process:attackers,Fork,process:backdoors>. \n[CoT]: The verb \"control\" in the original relationship implies that the backdoors process is manipulating or directing the infected systems process. In system-level terms, this manipulation is most accurately represented as \"Inject\". The backdoors process is injecting code or commands into the infected systems process to exercise control over it. [System-level Relationships]: <process:backdoors,Inject,process:infected systems>. \n[CoT]: The verb \"collect\" implies that the backdoors are accessing or writing data to the confidential file, which aligns with the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:backdoors,Write,file:confidential data>. \n[CoT]: The verb \"used\" in the original relationship implies that the APT TA428 process is utilizing the backdoors process to perform actions, which aligns with the system-level \"Fork\" relationship where one process creates or spawns another process. This indicates a master-process-to-slave-process interaction where APT TA428 is fork the backdoors. [System-level Relationships]: <process:APT TA428,Fork,process:backdoors>. \n[CoT]: The original relationship \"used\" implies that the other attacks process incorporated the new backdoor process into their activity, which aligns with the system-level \"Fork\" relationship where one process creates another. This indicates the new backdoor was likely spawned or initiated by the other attacks process. [System-level Relationships]: <process:other attacks,Fork,process:new backdoor>. "
    },
    {
        "phase": "lateral movement",
        "content": "After gaining a foothold on the initial system, the attackers attempt to spread the malware to other computers on the enterprise network. To gain access to those computers, the attackers use network scanning results, as well as user credentials stolen earlier. \nThe Ladon hacking utility (which is popular in China) is used as the main lateral movement tool. It combines network scanning, vulnerability search and exploitation, password attack, and other functionality. The attackers also extensively use standard utilities that are part of the Microsoft Windows operating system. \nThe attack's final stage involves hijacking the domain controller and gaining full control of all of the organization's workstations and servers. \nThe attackers used DLL hijacking and process hollowing techniques extensively in the attack to prevent security software from detecting the malware. ",
        "relationship": "1. [CoT]: The text mentions that the Ladon hacking utility is used for network scanning, indicating a process-to-socket relationship where the process performs scanning actions on the network. [Relationships]: <process:Ladon hacking utility,scanning,socket:network>. \n2. [CoT]: The text states that Ladon combines vulnerability search and exploitation, showing a process-to-process relationship where the process performs exploitation actions on vulnerabilities. [Relationships]: <process:Ladon hacking utility,exploitation,process:vulnerability>. \n3. [CoT]: The attackers use standard utilities that are part of the Microsoft Windows operating system, indicating a process-to-process relationship where the attackers use these utilities for their actions. [Relationships]: <process:attackers,use,process:standard utilities>. \n4. [CoT]: The text describes the attackers' goal of hijacking the domain controller, showing a process-to-process relationship where the attackers attempt to hijack this important system. [Relationships]: <process:attackers,hijacking,process:domain controller>. \n5. [CoT]: The attackers use password attack techniques, indicating a process-to-process relationship where the attackers perform attacks on password-related entities. [Relationships]: <process:attackers,attack,process:password>. ",
        "semantic_relationship": "[CoT]: The original relationship describes the Ladon hacking utility performing scanning actions on the network, which implies establishing a connection to the socket for network communication. In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:Ladon hacking utility,Connect,socket:network>. \n[CoT]: The original relationship describes Ladon performing exploitation actions on vulnerabilities. In system-level terms, this translates to a Process-to-Process Fork relationship, as exploitation typically involves injecting code or forcing another process to execute malicious content. [System-level Relationships]: <process:Ladon hacking utility,Fork,process:vulnerability>. \n[CoT]: The original relationship \"use\" between the attackers' process and the standard utilities process implies that the attackers are executing the utilities to perform their actions. In system-level terms, this corresponds to the \"Fork\" relationship between processes. [System-level Relationships]: <process:attackers,Fork,process:standard utilities>. \n[CoT]: The term \"hijacking\" in the original relationship implies that the attackers are attempting to inject code into the domain controller process to take over its behavior. In system-level terms, this corresponds to the \"Inject\" relationship between processes. [System-level Relationships]: <process:attackers,Inject,process:domain controller>. \n[CoT]: The original relationship indicates the attackers are performing attacks on password-related entities, which implies an attempt to inject code or data into the password process. In system-level terms, this corresponds to an \"Inject\" relationship between the attackers' process and the password process. [System-level Relationships]: <process:attackers,Inject,process:password>. "
    },
    {
        "phase": "exfiltration",
        "content": "After gaining domain administrator privileges, the attackers searched for and exfiltrated documents and other files that contained the attacked organization's sensitive data to their servers hosted in different countries. These servers were also used as stage one CnC servers. \nThe attackers compressed stolen files into encrypted and password-protected ZIP archives. After receiving the data collected, the stage one CnC servers forwarded the archives received to a stage two server located in China. ",
        "relationship": "1. [CoT]: The text states that the attackers searched for files containing sensitive data, indicating a process (attackers) interacting with files (documents and other files). [Relationships]: <process:attackers,searched for,file:documents and other files>. \n2. [CoT]: The attackers exfiltrated files to their servers, showing a process (attackers) sending files (documents and other files) to a socket (their servers). [Relationships]: <process:attackers,exfiltrated,file:documents and other files>. \n3. [CoT]: The stage one CnC servers forwarded ZIP archives received from the attackers, indicating a process (stage one CnC servers) receiving files (ZIP archives) and forwarding them to another server (stage two server). [Relationships]: <process:stage one CnC servers,forwarded,file:ZIP archives>. ",
        "semantic_relationship": "[CoT]: The action \"searched for\" implies that the attackers accessed the contents of the files to check for sensitive data, which aligns with the system-level relationship \"Read\" between a process and a file. [System-level Relationships]: <process:attackers,Read,file:documents and other files>. \n[CoT]: The original relationship describes the attackers exfiltrating files, which involves sending data over a network connection (socket). In system-level terms, this corresponds to a 'Send' action from a process to a socket. [System-level Relationships]: <process:attackers,Send,socket:their servers>. \n[CoT]: The original relationship \"forwarded\" implies that the stage one CnC servers wrote the ZIP archives to a network socket, which aligns with the system-level relationship \"Write\" between a process and a socket. [System-level Relationships]: <process:stage one CnC servers,Write,socket:network socket,file:ZIP archives>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that Microsoft Word documents contained malicious code that exploits the CVE-2017-11882 vulnerability, indicating a relationship between Microsoft Word and the vulnerability. [Original Relationships]: <process:Microsoft Word,contains,vulnerability:CVE-2017-11882>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Microsoft Word \"contains\" the vulnerability CVE-2017-11882. In system-level terms, this implies that the vulnerability is being exploited by Microsoft Word, which aligns with the \"Inject\" relationship between a process and a vulnerability. [System-level Relationships]: <process:Microsoft Word,Inject,vulnerability:CVE-2017-11882>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the malicious code executes the main module of the PortDoor malware, showing a relationship between the malicious code and the PortDoor malware. [Original Relationships]: <process:malicious code,executes,process:PortDoor malware>. ",
                "semantic_relationship": "[CoT]: The original relationship \"executes\" indicates that the malicious code is launching or running the PortDoor malware, which corresponds to the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:malicious code,Fork,process:PortDoor malware>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text describes how the attackers used phishing emails with malicious Microsoft Word documents to penetrate the enterprise network, indicating a relationship between the attackers and the phishing emails. [Original Relationships]: <process:attackers,used,process:phishing emails>. ",
                "semantic_relationship": "[CoT]: The original relationship \"used\" implies that the attackers executed the phishing emails to send them, which aligns with the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:attackers,Fork,process:phishing emails>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that the attackers used phishing emails with malicious Microsoft Word documents to penetrate the enterprise network, showing a relationship between the attackers and Microsoft Word documents. [Original Relationships]: <process:attackers,used,process:Microsoft Word documents>. ",
                "semantic_relationship": "[CoT]: The original relationship \"used\" implies that the attackers executed the Microsoft Word documents to penetrate the network, which aligns with the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:attackers,Fork,process:Microsoft Word documents>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that PortDoor collects information and sends it to the CnC server, indicating a process-to-socket relationship where PortDoor is the process and CnC server is the socket.  [Original Relationships]: <process:PortDoor,sends,socket:malware command-and-control (CnC) server>. ",
                "semantic_relationship": "[CoT]: The original relationship \"sends\" indicates a data transmission from the process PortDoor to the socket (CnC server). In system-level terms, this corresponds to the \"Send\" action between a process and a socket. [System-level Relationships]: <process:PortDoor,Send,socket:malware command-and-control (CnC) server>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the attackers used five different backdoors, indicating a process-to-process relationship where the attackers (process) used (verb) the backdoors (process).   [Original Relationships]: <process:attackers,used,process:backdoors>. ",
                "semantic_relationship": "[CoT]: The verb \"used\" in the original relationship implies that the attackers (process) executed the backdoors (process) to gain access. In system-level terms, this corresponds to an \"Fork\" relationship between processes. [System-level Relationships]: <process:attackers,Fork,process:backdoors>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that the backdoors provide functionality for controlling infected systems, indicating a process-to-process relationship where the backdoors (process) control (verb) the infected systems (process).   [Original Relationships]: <process:backdoors,control,process:infected systems>. ",
                "semantic_relationship": "[CoT]: The verb \"control\" in the original relationship implies that the backdoors process is manipulating or directing the infected systems process. In system-level terms, this manipulation is most accurately represented as \"Inject\". The backdoors process is injecting code or commands into the infected systems process to exercise control over it. [System-level Relationships]: <process:backdoors,Inject,process:infected systems>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the backdoors collect confidential data, indicating a process-to-file relationship where the backdoors (process) collect (verb) confidential data (file).   [Original Relationships]: <process:backdoors,collect,file:confidential data>. ",
                "semantic_relationship": "[CoT]: The verb \"collect\" implies that the backdoors are accessing or writing data to the confidential file, which aligns with the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:backdoors,Write,file:confidential data>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that the backdoors have been used in attacks attributed to APT TA428, indicating a process-to-process relationship where APT TA428 (process) used (verb) the backdoors (process).   [Original Relationships]: <process:APT TA428,used,process:backdoors>. ",
                "semantic_relationship": "[CoT]: The verb \"used\" in the original relationship implies that the APT TA428 process is utilizing the backdoors process to perform actions, which aligns with the system-level \"Fork\" relationship where one process creates or spawns another process. This indicates a master-process-to-slave-process interaction where APT TA428 is fork the backdoors. [System-level Relationships]: <process:APT TA428,Fork,process:backdoors>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes a new backdoor that has not been observed in other attacks, indicating a process-to-process relationship where other attacks (process) used (verb) the new backdoor (process). [Original Relationships]: <process:other attacks,used,process:new backdoor>. ",
                "semantic_relationship": "[CoT]: The original relationship \"used\" implies that the other attacks process incorporated the new backdoor process into their activity, which aligns with the system-level \"Fork\" relationship where one process creates another. This indicates the new backdoor was likely spawned or initiated by the other attacks process. [System-level Relationships]: <process:other attacks,Fork,process:new backdoor>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text mentions that the Ladon hacking utility is used for network scanning, indicating a process-to-socket relationship where the process performs scanning actions on the network. [Original Relationships]: <process:Ladon hacking utility,scanning,socket:network>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the Ladon hacking utility performing scanning actions on the network, which implies establishing a connection to the socket for network communication. In system-level terms, this is best represented as a 'Connect' relationship between the process and the socket. [System-level Relationships]: <process:Ladon hacking utility,Connect,socket:network>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text states that Ladon combines vulnerability search and exploitation, showing a process-to-process relationship where the process performs exploitation actions on vulnerabilities. [Original Relationships]: <process:Ladon hacking utility,exploitation,process:vulnerability>. ",
                "semantic_relationship": "[CoT]: The original relationship describes Ladon performing exploitation actions on vulnerabilities. In system-level terms, this translates to a Process-to-Process Fork relationship, as exploitation typically involves injecting code or forcing another process to execute malicious content. [System-level Relationships]: <process:Ladon hacking utility,Fork,process:vulnerability>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The attackers use standard utilities that are part of the Microsoft Windows operating system, indicating a process-to-process relationship where the attackers use these utilities for their actions. [Original Relationships]: <process:attackers,use,process:standard utilities>. ",
                "semantic_relationship": "[CoT]: The original relationship \"use\" between the attackers' process and the standard utilities process implies that the attackers are executing the utilities to perform their actions. In system-level terms, this corresponds to the \"Fork\" relationship between processes. [System-level Relationships]: <process:attackers,Fork,process:standard utilities>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text describes the attackers' goal of hijacking the domain controller, showing a process-to-process relationship where the attackers attempt to hijack this important system. [Original Relationships]: <process:attackers,hijacking,process:domain controller>. ",
                "semantic_relationship": "[CoT]: The term \"hijacking\" in the original relationship implies that the attackers are attempting to inject code into the domain controller process to take over its behavior. In system-level terms, this corresponds to the \"Inject\" relationship between processes. [System-level Relationships]: <process:attackers,Inject,process:domain controller>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The attackers use password attack techniques, indicating a process-to-process relationship where the attackers perform attacks on password-related entities. [Original Relationships]: <process:attackers,attack,process:password>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates the attackers are performing attacks on password-related entities, which implies an attempt to inject code or data into the password process. In system-level terms, this corresponds to an \"Inject\" relationship between the attackers' process and the password process. [System-level Relationships]: <process:attackers,Inject,process:password>. "
            },
            {
                "phase": "exfiltration",
                "relationship": "[Description]: The text states that the attackers searched for files containing sensitive data, indicating a process (attackers) interacting with files (documents and other files). [Original Relationships]: <process:attackers,searched for,file:documents and other files>. ",
                "semantic_relationship": "[CoT]: The action \"searched for\" implies that the attackers accessed the contents of the files to check for sensitive data, which aligns with the system-level relationship \"Read\" between a process and a file. [System-level Relationships]: <process:attackers,Read,file:documents and other files>. "
            },
            {
                "phase": "exfiltration",
                "relationship": "[Description]: The attackers exfiltrated files to their servers, showing a process (attackers) sending files (documents and other files) to a socket (their servers). [Original Relationships]: <process:attackers,exfiltrated,file:documents and other files>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the attackers exfiltrating files, which involves sending data over a network connection (socket). In system-level terms, this corresponds to a 'Send' action from a process to a socket. [System-level Relationships]: <process:attackers,Send,socket:their servers>. "
            },
            {
                "phase": "exfiltration",
                "relationship": "[Description]: The stage one CnC servers forwarded ZIP archives received from the attackers, indicating a process (stage one CnC servers) receiving files (ZIP archives) and forwarding them to another server (stage two server). [Original Relationships]: <process:stage one CnC servers,forwarded,file:ZIP archives>. ",
                "semantic_relationship": "[CoT]: The original relationship \"forwarded\" implies that the stage one CnC servers wrote the ZIP archives to a network socket, which aligns with the system-level relationship \"Write\" between a process and a socket. [System-level Relationships]: <process:stage one CnC servers,Write,socket:network socket,file:ZIP archives>. "
            }
        ]
    }
]