[
    {
        "phase": "initial access",
        "content": "These attacks were already well underway when another group began to deploy a previously unknown piece of malware. In October 2014, the Seaduke payload began to appear within target networks. Although Seaduke was developed in Python, the overall framework bears a striking resemblance to Cozyduke in terms of operation.  It's unclear why the attackers waited until October to deploy Seaduke. Was it reserved for a more specific attack? Was part of their cover blown, necessitating the use of an alternative framework?\nThe Seaduke framework was designed to be highly configurable. Hundreds of reconfigurations were identified on compromised networks. The communication protocol employed had many layers of encryption and obfuscation, using over 200 compromised web servers for command and control. Seaduke required a significant investment of time and resources in the preparatory and operational phases of the attack.",
        "relationship": "1. [CoT]: The text states that the Seaduke payload began to appear within target networks, indicating that the payload (a file entity) was deployed by the attackers (process entities).   [Relationships]: <process:attackers,deploy,file:Seaduke payload>. \n2. [CoT]: The text mentions that the communication protocol used over 200 compromised web servers for command and control, showing that Seaduke (a process entity) communicated with the compromised web servers (socket entities) for control.   [Relationships]: <process:Seaduke,communicate with,socket:compromised web servers>. ",
        "semantic_relationship": "[CoT]: The term \"deploy\" in the original relationship implies that the attackers wrote the Seaduke payload file to the target network, which corresponds to the \"Write\" action in system-level relationships. This is a classic example of payload deployment where a process writes a file to the system. [System-level Relationships]: <process:attackers,Write,file:Seaduke payload>. \n[CoT]: The original relationship \"communicate with\" indicates that the Seaduke process is establishing a connection to the compromised web servers, which aligns with the system-level relationship \"Connect\" in the Process-to-Socket category. This reflects the command and control communication described in the attack description. [System-level Relationships]: <process:Seaduke,Connect,socket:compromised web servers>. "
    },
    {
        "phase": "execution",
        "content": "The attackers control Cozyduke via compromised websites, issuing instructions to infected machines by uploading \"tasks\" to a database file. Cozyduke will periodically contact these websites to retrieve task information to be executed on the local machine.  One such task (an encoded PowerShell script) instructed Cozyduke to download and execute Seaduke from a compromised website.",
        "relationship": "1. [CoT]: The text states that Cozyduke periodically contacts compromised websites to retrieve task information, indicating a process-to-socket relationship where 'contact' is the verb. [Relationships]: <process:Cozyduke,contact,socket:compromised websites>. \n2. [CoT]: The text mentions that attackers upload tasks to a database file, showing a process-to-file relationship with 'upload' as the verb. [Relationships]: <process:attackers,upload,file:database file>. \n3. [CoT]: Cozyduke downloads an encoded PowerShell script from a compromised website, establishing a process-to-socket relationship with 'download' as the verb. [Relationships]: <process:Cozyduke,download,socket:compromised website>. \n4. [CoT]: Cozyduke executes Seaduke, indicating a process-to-process relationship with 'execute' as the verb. [Relationships]: <process:Cozyduke,execute,process:Seaduke>. ",
        "semantic_relationship": "[CoT]: The verb 'contact' in the original relationship implies that Cozyduke initiates a connection to the compromised websites, which aligns with the system-level 'Connect' relationship between a process and a socket. This indicates network communication initiation. [System-level Relationships]: <process:Cozyduke,Connect,socket:compromised websites>. \n[CoT]: The verb 'upload' in the original relationship indicates that the attackers are writing data to the database file, which corresponds to the 'Write' action in the system-level relationships framework. [System-level Relationships]: <process:attackers,Write,file:database file>. \n[CoT]: The original relationship describes Cozyduke downloading a PowerShell script from a compromised website, which implies the process is receiving data over a network socket. In system-level terms, this corresponds to a 'Receive' relationship between the process and the socket. [System-level Relationships]: <process:Cozyduke,Receive,socket:compromised website>. \n[CoT]: The original relationship describes a process (Cozyduke) executing another process (Seaduke). In the system-level relationships framework, this corresponds to the 'Fork' action between two processes. [System-level Relationships]: <process:Cozyduke,Fork,process:Seaduke>. "
    },
    {
        "phase": "command and control",
        "content": "The attackers can operate Seaduke in a broadly similar fashion to Cozyduke. The Seaduke control infrastructure is essentially distinct, opening up the possibility of sub-teams concurrently exploiting the target network. Unlike Cozyduke, Seaduke operators upload \"task\" files directly to the command-and-control (C&C) server; there is no database as such present. Seaduke securely communicates with the C&C server over HTTP/HTTPS beneath layers of encoding (Base64) and encryption (RC4, AES). To an untrained eye, the communications look fairly benign, no doubt an effort to stay under the radar on compromised networks.\nSeaduke has many inbuilt commands which are available to the attackers. They have the ability to retrieve detailed bot/system information, update bot configuration, upload files, download files, and self-delete the malware from the system. The self-delete function is interestingly called \"seppuku\". This is a form of Japanese ritual suicide.",
        "relationship": "1. [CoT]: The text mentions that Seaduke securely communicates with the C&C server over HTTP/HTTPS, indicating a process-to-socket relationship where Seaduke (process) communicates with the C&C server (socket).   [Relationships]: <process:Seaduke,communicates with,socket:C&C server>. \n2. [CoT]: The text states that Seaduke operators upload \"task\" files to the C&C server, indicating a process-to-file relationship where Seaduke (process) uploads task files (file).   [Relationships]: <process:Seaduke,uploads,file:task files>. \n3. [CoT]: The text mentions that Seaduke has the ability to download files, indicating a process-to-file relationship where Seaduke (process) downloads files (file).   [Relationships]: <process:Seaduke,downloads,file:files>. \n4. [CoT]: The text mentions that Seaduke has the ability to upload files, indicating a process-to-file relationship where Seaduke (process) uploads files (file).   [Relationships]: <process:Seaduke,uploads,file:files>. \n5. [CoT]: The text mentions that Seaduke has a self-delete function called \"seppuku,\" indicating a process-to-process relationship where Seaduke (process) deletes itself (process Seaduke). [Relationships]: <process:Seaduke,deletes,process:Seaduke>. ",
        "semantic_relationship": "[CoT]: The original relationship \"communicates with\" indicates a network connection between the process Seaduke and the socket (C&C server). In system-level terms, this is best represented as a \"Connect\" relationship, as it describes the establishment of a connection to the socket for communication. [System-level Relationships]: <process:Seaduke,Connect,socket:C&C server>. \n[CoT]: The term \"uploads\" in the original relationship implies that the Seaduke process is writing data to the C&C server, which is represented as a file in the system-level relationship. Therefore, \"uploads\" maps to \"Write\" in the Process-to-File category. [System-level Relationships]: <process:Seaduke,Write,file:task files>. \n[CoT]: The term \"downloads\" implies that the process Seaduke is writing data to a file, which corresponds to the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:Seaduke,Write,file:files>. \n[CoT]: The term \"uploads\" in the original relationship implies that the process Seaduke is writing data to a file, which corresponds to the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:Seaduke,Write,file:files>. \n[CoT]: The original relationship describes a process (Seaduke) deleting itself, which corresponds to the system-level \"Exit\" relationship between processes in the Process-to-Process category. The action of self-deletion is categorized as an exit or termination of the process. [System-level Relationships]: <process:Seaduke,Exit,process:Seaduke>. "
    },
    {
        "phase": "impact",
        "content": "The attackers have also developed a number of additional payloads. Operators can push these payloads onto infected machines for very specific attacks.\nImpersonation using Kerberos pass-the-ticket attacks (Mimikatz PowerShell)\nEmail extraction from the MS Exchange Server using compromised credentials\nArchiving sensitive information\nData exfiltration via legitimate cloud services\nSecure file deletion",
        "relationship": "1. [CoT]: The text mentions that operators can push payloads onto infected machines, indicating a process-to-process relationship where the operators (process) push payloads (process).   [Relationships]: <process:operators,push,process:payloads>. \n2. [CoT]: The text describes impersonation attacks using Kerberos pass-the-ticket, implying a process-to-process relationship where the attackers (process) use Mimikatz (process).   [Relationships]: <process:attackers,use,process:Mimikatz PowerShell>. \n3. [CoT]: The text states that operators can push payloads for very specific attacks, indicating a process-to-process relationship where the operators (process) push payloads (process).   [Relationships]: <process:operators,push,process:payloads>. \n4. [CoT]: The text mentions email extraction from the MS Exchange Server, implying a process-to-process relationship where the attackers (process) extract (verb) email (process:MS Exchange Server).   [Relationships]: <process:attackers,extract,process:MS Exchange Server>. \n5. [CoT]: The text describes archiving sensitive information, indicating a process-to-file relationship where the attackers (process) archive (verb) sensitive information (file).   [Relationships]: <process:attackers,archive,file:sensitive information>. \n6. [CoT]: The text mentions data exfiltration via legitimate cloud services, implying a process-to-socket relationship where the attackers (process) exfiltrate (verb) data (process:legitimate cloud services). [Relationships]: <process:attackers,exfiltrate,process:legitimate cloud services>. \n7. [CoT]: The text describes secure file deletion, indicating a process-to-file relationship where the attackers (process) delete (verb) files (file). [Relationships]: <process:attackers,delete,file:files>. ",
        "semantic_relationship": "[CoT]: The original relationship describes a process (operators) performing a 'push' action on another process (payloads). In system-level terms, 'push' corresponds to the 'Fork' relationship between processes, as it involves creating or spawning a new process. [System-level Relationships]: <process:operators,Fork,process:payloads>. \n[CoT]: The original relationship \"use\" between the attackers and Mimikatz implies that the attackers are using Mimikatz to perform operations, which in system-level terms typically translates to \"Fork\" a process. [System-level Relationships]: <process:attackers,Fork,process:Mimikatz PowerShell>. \n[CoT]: The original relationship describes a process (operators) pushing payloads (another process). In system-level terms, this action corresponds to process injection, as one process is injecting data into another process's memory space. [System-level Relationships]: <process:operators,Inject,process:payloads>. \n[CoT]: The verb \"extract\" implies that the attackers (process) are reading data from the MS Exchange Server (process). In system-level terms, this corresponds to a \"Inject\" relationship from the attackers' process to the MS Exchange Server process, as it involves accessing or modifying the server's memory or data. [System-level Relationships]: <process:attackers,Inject,process:MS Exchange Server>. \n[CoT]: The verb \"archive\" implies that the attackers are writing data to a file, which aligns with the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:attackers,Write,file:sensitive information>. \n[CoT]: The original relationship describes data exfiltration from the attackers' process to a legitimate cloud service, which implies sending data over a network socket. Therefore, the system-level relationship is 'Send' from the attackers' process to the socket representing the cloud service. [System-level Relationships]: <process:attackers,Send,socket:cloud service>. \n[CoT]: The original relationship \"delete\" corresponds to the system-level relationship \"Delete\" between a process and a file, as it involves the removal of data from the file system. [System-level Relationships]: <process:attackers,Delete,file:files>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The text states that the Seaduke payload began to appear within target networks, indicating that the payload (a file entity) was deployed by the attackers (process entities).   [Original Relationships]: <process:attackers,deploy,file:Seaduke payload>. ",
                "semantic_relationship": "[CoT]: The term \"deploy\" in the original relationship implies that the attackers wrote the Seaduke payload file to the target network, which corresponds to the \"Write\" action in system-level relationships. This is a classic example of payload deployment where a process writes a file to the system. [System-level Relationships]: <process:attackers,Write,file:Seaduke payload>. "
            },
            {
                "phase": "initial access",
                "relationship": "[Description]: The text mentions that the communication protocol used over 200 compromised web servers for command and control, showing that Seaduke (a process entity) communicated with the compromised web servers (socket entities) for control.   [Original Relationships]: <process:Seaduke,communicate with,socket:compromised web servers>. ",
                "semantic_relationship": "[CoT]: The original relationship \"communicate with\" indicates that the Seaduke process is establishing a connection to the compromised web servers, which aligns with the system-level relationship \"Connect\" in the Process-to-Socket category. This reflects the command and control communication described in the attack description. [System-level Relationships]: <process:Seaduke,Connect,socket:compromised web servers>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that Cozyduke periodically contacts compromised websites to retrieve task information, indicating a process-to-socket relationship where 'contact' is the verb. [Original Relationships]: <process:Cozyduke,contact,socket:compromised websites>. ",
                "semantic_relationship": "[CoT]: The verb 'contact' in the original relationship implies that Cozyduke initiates a connection to the compromised websites, which aligns with the system-level 'Connect' relationship between a process and a socket. This indicates network communication initiation. [System-level Relationships]: <process:Cozyduke,Connect,socket:compromised websites>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that attackers upload tasks to a database file, showing a process-to-file relationship with 'upload' as the verb. [Original Relationships]: <process:attackers,upload,file:database file>. ",
                "semantic_relationship": "[CoT]: The verb 'upload' in the original relationship indicates that the attackers are writing data to the database file, which corresponds to the 'Write' action in the system-level relationships framework. [System-level Relationships]: <process:attackers,Write,file:database file>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Cozyduke downloads an encoded PowerShell script from a compromised website, establishing a process-to-socket relationship with 'download' as the verb. [Original Relationships]: <process:Cozyduke,download,socket:compromised website>. ",
                "semantic_relationship": "[CoT]: The original relationship describes Cozyduke downloading a PowerShell script from a compromised website, which implies the process is receiving data over a network socket. In system-level terms, this corresponds to a 'Receive' relationship between the process and the socket. [System-level Relationships]: <process:Cozyduke,Receive,socket:compromised website>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: Cozyduke executes Seaduke, indicating a process-to-process relationship with 'execute' as the verb. [Original Relationships]: <process:Cozyduke,execute,process:Seaduke>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (Cozyduke) executing another process (Seaduke). In the system-level relationships framework, this corresponds to the 'Fork' action between two processes. [System-level Relationships]: <process:Cozyduke,Fork,process:Seaduke>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that Seaduke securely communicates with the C&C server over HTTP/HTTPS, indicating a process-to-socket relationship where Seaduke (process) communicates with the C&C server (socket).   [Original Relationships]: <process:Seaduke,communicates with,socket:C&C server>. ",
                "semantic_relationship": "[CoT]: The original relationship \"communicates with\" indicates a network connection between the process Seaduke and the socket (C&C server). In system-level terms, this is best represented as a \"Connect\" relationship, as it describes the establishment of a connection to the socket for communication. [System-level Relationships]: <process:Seaduke,Connect,socket:C&C server>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that Seaduke operators upload \"task\" files to the C&C server, indicating a process-to-file relationship where Seaduke (process) uploads task files (file).   [Original Relationships]: <process:Seaduke,uploads,file:task files>. ",
                "semantic_relationship": "[CoT]: The term \"uploads\" in the original relationship implies that the Seaduke process is writing data to the C&C server, which is represented as a file in the system-level relationship. Therefore, \"uploads\" maps to \"Write\" in the Process-to-File category. [System-level Relationships]: <process:Seaduke,Write,file:task files>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that Seaduke has the ability to download files, indicating a process-to-file relationship where Seaduke (process) downloads files (file).   [Original Relationships]: <process:Seaduke,downloads,file:files>. ",
                "semantic_relationship": "[CoT]: The term \"downloads\" implies that the process Seaduke is writing data to a file, which corresponds to the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:Seaduke,Write,file:files>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that Seaduke has the ability to upload files, indicating a process-to-file relationship where Seaduke (process) uploads files (file).   [Original Relationships]: <process:Seaduke,uploads,file:files>. ",
                "semantic_relationship": "[CoT]: The term \"uploads\" in the original relationship implies that the process Seaduke is writing data to a file, which corresponds to the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:Seaduke,Write,file:files>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that Seaduke has a self-delete function called \"seppuku,\" indicating a process-to-process relationship where Seaduke (process) deletes itself (process Seaduke). [Original Relationships]: <process:Seaduke,deletes,process:Seaduke>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (Seaduke) deleting itself, which corresponds to the system-level \"Exit\" relationship between processes in the Process-to-Process category. The action of self-deletion is categorized as an exit or termination of the process. [System-level Relationships]: <process:Seaduke,Exit,process:Seaduke>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions that operators can push payloads onto infected machines, indicating a process-to-process relationship where the operators (process) push payloads (process).   [Original Relationships]: <process:operators,push,process:payloads>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (operators) performing a 'push' action on another process (payloads). In system-level terms, 'push' corresponds to the 'Fork' relationship between processes, as it involves creating or spawning a new process. [System-level Relationships]: <process:operators,Fork,process:payloads>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text describes impersonation attacks using Kerberos pass-the-ticket, implying a process-to-process relationship where the attackers (process) use Mimikatz (process).   [Original Relationships]: <process:attackers,use,process:Mimikatz PowerShell>. ",
                "semantic_relationship": "[CoT]: The original relationship \"use\" between the attackers and Mimikatz implies that the attackers are using Mimikatz to perform operations, which in system-level terms typically translates to \"Fork\" a process. [System-level Relationships]: <process:attackers,Fork,process:Mimikatz PowerShell>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text states that operators can push payloads for very specific attacks, indicating a process-to-process relationship where the operators (process) push payloads (process).   [Original Relationships]: <process:operators,push,process:payloads>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (operators) pushing payloads (another process). In system-level terms, this action corresponds to process injection, as one process is injecting data into another process's memory space. [System-level Relationships]: <process:operators,Inject,process:payloads>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions email extraction from the MS Exchange Server, implying a process-to-process relationship where the attackers (process) extract (verb) email (process:MS Exchange Server).   [Original Relationships]: <process:attackers,extract,process:MS Exchange Server>. ",
                "semantic_relationship": "[CoT]: The verb \"extract\" implies that the attackers (process) are reading data from the MS Exchange Server (process). In system-level terms, this corresponds to a \"Inject\" relationship from the attackers' process to the MS Exchange Server process, as it involves accessing or modifying the server's memory or data. [System-level Relationships]: <process:attackers,Inject,process:MS Exchange Server>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text describes archiving sensitive information, indicating a process-to-file relationship where the attackers (process) archive (verb) sensitive information (file).   [Original Relationships]: <process:attackers,archive,file:sensitive information>. ",
                "semantic_relationship": "[CoT]: The verb \"archive\" implies that the attackers are writing data to a file, which aligns with the system-level relationship \"Write\" in the Process-to-File category. [System-level Relationships]: <process:attackers,Write,file:sensitive information>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text mentions data exfiltration via legitimate cloud services, implying a process-to-socket relationship where the attackers (process) exfiltrate (verb) data (process:legitimate cloud services). [Original Relationships]: <process:attackers,exfiltrate,process:legitimate cloud services>. ",
                "semantic_relationship": "[CoT]: The original relationship describes data exfiltration from the attackers' process to a legitimate cloud service, which implies sending data over a network socket. Therefore, the system-level relationship is 'Send' from the attackers' process to the socket representing the cloud service. [System-level Relationships]: <process:attackers,Send,socket:cloud service>. "
            },
            {
                "phase": "impact",
                "relationship": "[Description]: The text describes secure file deletion, indicating a process-to-file relationship where the attackers (process) delete (verb) files (file). [Original Relationships]: <process:attackers,delete,file:files>. ",
                "semantic_relationship": "[CoT]: The original relationship \"delete\" corresponds to the system-level relationship \"Delete\" between a process and a file, as it involves the removal of data from the file system. [System-level Relationships]: <process:attackers,Delete,file:files>. "
            }
        ]
    }
]