[
    {
        "phase": "command and control",
        "content": "PowHeartBeat is a full-featured backdoor written in PowerShell, obfuscated using various techniques such as  compression, encoding, and encryption. Based on ESET telemetry, we believe PowHeartBeat replaced CLRLoad in more recent Worok campaigns as the tool used to launch PNGLoad.\nThe first layer of the backdoor code consists of multiple chunks of base64-encoded PowerShell code. Once the payload is reconstructed, it is executed viaIEX. Once decoded, another layer of obfuscated code is executed, which we can see in Figure 3.\nThe second layer of the backdoor first base64 decodes the next layer of its code, which is then decrypted withTriple DES(CBC mode). After decryption, this code is decompressed using thegzipalgorithm, thus giving the third layer of PowerShell code, which is the actual backdoor. It is divided into two main parts: configuration, and handling backdoor commands.\nThe main layer of backdoor code is also written in PowerShell and uses HTTP or ICMP to communicate with the C&C server. It works as depicted in Figure 4.",
        "relationship": "1. [CoT]: The text states that \"The payload is reconstructed, it is executed via IEX,\" indicating that the PowerShell process IEX executes the payload. [Relationships]: <process:IEX,executes,file:payload>. \n2. [CoT]: The text mentions \"another layer of obfuscated code is executed,\" implying that the IEX process executes this obfuscated code. [Relationships]: <process:IEX,executes,file:obfuscated code>. \n3. [CoT]: The text describes that the obfuscated code is decoded, which is followed by decryption and decomposition processes. [Relationships]: <process:obfuscated code,decodes,file:next layer of its code>. \n4. [CoT]: The obfuscated code is decoded to give the next layer of code, which is then decrypted with Triple DES. [Relationships]: <process:next layer of its code,decrypts,file:Triple DES(CBC mode)>. \n5. [CoT]: The decrypted code is decompressed using gzip, revealing the third layer of PowerShell code. [Relationships]: <process:Triple DES(CBC mode),decompresses,file:gzipalgorithm>. \n6. [CoT]: The main layer of backdoor code communicates with the C&C server using HTTP or ICMP. [Relationships]: <process:backdoor code,communicates with,socket:C&C server>. ",
        "semantic_relationship": "[CoT]: The original relationship states that the process IEX \"executes\" the file \"payload.\" In the system-level framework, this directly maps to the \"Execute\" relationship between a process and a file, as it describes a process running or launching a file. [System-level Relationships]: <process:IEX,Execute,file:payload>. \n[CoT]: The original relationship states that the IEX process \"executes\" the obfuscated code file. In system-level terms, this directly translates to the \"Execute\" relationship between a process and a file, as it indicates the process is running or launching the file. [System-level Relationships]: <process:IEX,Execute,file:obfuscated code>. \n[CoT]: The original relationship states that the obfuscated code \"decodes\" the next layer of its code, which implies that the obfuscated code needs to read the encrypted/obfuscated code file to perform the decoding operation. Therefore, the system-level relationship is \"Read\" from the process to the file. [System-level Relationships]: <process:obfuscated code,Read,file:next layer of its code>. \n[CoT]: The original relationship states that the next layer of code decrypts Triple DES(CBC mode). In system-level terms, this translates to the process reading the encrypted file to obtain the key for decryption. The action of reading the file to obtain data or keys is represented as 'Read' in the system-level relationships. [System-level Relationships]: <process:next layer of its code,Read,file:Triple DES(CBC mode)>. \n[CoT]: The original relationship states that the Triple DES process decompresses the file using the gzip algorithm. In system-level terms, this corresponds to the 'Decode' action between a process and a file, as the process is performing a decompression operation on the file. [System-level Relationships]: <process:Triple DES(CBC mode),Decode,file:gzipalgorithm>. \n[CoT]: The original relationship \"communicates with\" can be mapped to the system-level relationship \"Connect\" between a process and a socket, as it describes the establishment of a connection to a C&C server. [System-level Relationships]: <process:backdoor code,Connect,socket:C&C server>. "
    },
    {
        "phase": "command and control",
        "content": "The configuration contains multiple fields, including version number, optional proxy configuration, and C&C address. Table 1 describes the meanings of the configuration fields in the different versions we have observed.\nTable 1. Configuration field meanings\nFigure 5 shows an example of the configuration extracted from a PowHeartBeat sample (SHA-1:757ABA12D04FD1167528FDD107A441D11CD8C427).\nFigure 5. Configuration example",
        "relationship": "1. [CoT]: The text describes that the PowHeartBeat sample contains a configuration with a C&C address field, indicating a process-to-socket relationship where the process PowHeartBeat interacts with the C&C address socket.   [Relationships]: <process:PowHeartBeat,connect,socket:C&C address>. ",
        "semantic_relationship": "[CoT]: The original relationship describes a process (PowHeartBeat) connecting to a socket (C&C address). In the system-level framework, this directly maps to the Process-to-Socket \"Connect\" relationship, as it involves establishing a connection to a remote socket. [System-level Relationships]: <process:PowHeartBeat,Connect,socket:C&C address>. "
    },
    {
        "phase": "command and control",
        "content": "In an infinite loop, the backdoor sends a GET request to the C&C server, asking for a command to issue. The encrypted answer is decrypted by the backdoor, which processes the command, and writes the command output to a file whose content is then sent to the C&C server via a POST request.\nThe format of the GET requests is the following:\nNote that the request is constructed using the eponymous configuration fields.\nIn the response from the C&C server, the third byte of the content is the command identifier that indicates the command to be processed by the backdoor. We'll call itcommand_id. The remaining content of the response will be passed as an argument to the command that is processed. This content is encrypted with the algorithm shown in Figure 6,taskIdbeing the value of the cookie named afterCookieTaskId's value from the configuration.\nFigure 6. Requests content data encryption algorithm\nThe response from the C&C server also contains another cookie, whose name is specified by the backdoor'sCookieTerminalIdconfiguration variable. The value of this cookie is repeated in the POST request from the backdoor, and it must not be empty. After executing the backdoor command, PowHeartBeat sends the result as a POST request to the C&C server. The result is sent as a file whose name is<command_id>.png.",
        "relationship": "1. [CoT]: The text states that the backdoor sends a GET request to the C&C server, indicating a process-to-socket relationship. [Relationships]: <process:backdoor, sends, socket:C&C server>. \n2. [CoT]: The text mentions that the backdoor processes the command from the C&C server, showing a process-to-process relationship. [Relationships]: <process:backdoor, processes, process:command>. \n3. [CoT]: The backdoor writes the command output to a file, which is later sent to the C&C server, indicating a process-to-file relationship. [Relationships]: <process:backdoor, writes, file:command output file>. \n4. [CoT]: The text describes that the command output is sent to the C&C server via a POST request, showing a process-to-socket relationship. [Relationships]: <process:backdoor, sends, socket:C&C server>. \n5. [CoT]: The response from the C&C server contains a cookie named afterCookieTaskId, which is used in the encryption algorithm, indicating a socket-to-cookie relationship. [Relationships]: <socket:C&C server, contains, cookie:afterCookieTaskId>. \n6. [CoT]: The response from the C&C server also contains another cookie named CookieTerminalId, which is repeated in the POST request, showing a socket-to-cookie relationship. [Relationships]: <socket:C&C server, contains, cookie:CookieTerminalId>. \n7. [CoT]: After executing the backdoor command, PowHeartBeat sends the result as a POST request to the C&C server, indicating a process-to-socket relationship. [Relationships]: <process:PowHeartBeat, sends, socket:C&C server>. \n8. [CoT]: The result is sent as a file named <command_id>.png, showing a process-to-file relationship. [Relationships]: <process:PowHeartBeat, sends, file:<command_id>.png>. ",
        "semantic_relationship": "[CoT]: The original relationship describes a process (backdoor) sending a request to a socket (C&C server), which directly maps to the system-level 'Send' relationship between a process and a socket. [System-level Relationships]: <process:backdoor,Send,socket:C&C server>. \n[CoT]: The original relationship \"processes\" indicates that the backdoor is executing the command received from the C&C server. In system-level terms, this corresponds to an \"Fork\" relationship between processes. [System-level Relationships]: <process:backdoor,Fork,process:command>. \n[CoT]: The original relationship describes the backdoor writing data to a file, which directly corresponds to the system-level \"Write\" relationship between a process and a file. [System-level Relationships]: <process:backdoor,Write,file:command output file>. \n[CoT]: The original relationship describes a process sending data to a socket, which directly maps to the system-level 'Send' relationship between a process and a socket. [System-level Relationships]: <process:backdoor,Send,socket:C&C server>. \n[CoT]: The original relationship states that the C&C server contains a cookie named afterCookieTaskId. In system-level terms, this implies that the C&C server is writing the cookie to the client's socket, hence the \"Write\" relationship. [System-level Relationships]: <socket:C&C server,Write,cookie:afterCookieTaskId>. \n[CoT]: The original relationship states that the C&C server contains the CookieTerminalId cookie. In system-level terms, this implies that the C&C server is writing or modifying the cookie, which aligns with the 'Write' action in the socket-to-cookie relationship framework. [System-level Relationships]: <socket:C&C server,Write,cookie:CookieTerminalId>. \n[CoT]: The original relationship \"sends\" indicates that the process PowHeartBeat is sending data to a socket (C&C server). In system-level terms, this corresponds to the \"Send\" relationship between a process and a socket. [System-level Relationships]: <process:PowHeartBeat,Send,socket:C&C server>. \n[CoT]: The original relationship \"sends\" indicates that the process is writing data to the file, which corresponds to the \"Write\" action in the system-level relationships framework. [System-level Relationships]: <process:PowHeartBeat,Write,file:<command_id>.png>. "
    },
    {
        "phase": "command and control",
        "content": "Starting from version 2.4 of PowHeartBeat, HTTP was replaced by ICMP, sent packets having a timeout of six seconds and beingunfragmented. Communication through ICMP is most likely a way to evade detection.\nThere is no major change in versions 2.4 and later, but we noticed some modifications in the code:\nPowHeartBeat sends a heartbeat packet at each loop that contains the stringabcdefghijklmnopqrstuvwxyz, before requesting a command. This informs the C&C server that the backdoor is ready to receive commands. \nRequests to get commands performed by the backdoor contain the stringabcdefghijklmnop.\nHeartbeat packets have the format described in Figure 7.\nThe difference betweenclient IDandclient flagis thatclient IDdiffers in every sample whereasclient flagis the same in every sample that uses ICMP.heartbeat flagindicates that the backdoor is sending a heartbeat. The response from the C&C server has the format described in Figure 8.\nflaghere indicates whether there is a command to issue to the backdoor. Requests to get commands have the format described in Figure 9.\nNote that the backdoor's ICMP mode allows receiving an unlimited amount of data, divided into chunks, and the variablesdata length,current positionandtotal lengthare used to keep track of the transmitted data. Responses to these requests have the format described in Figure 10.\nAs in HTTP responses, the command identifier is the third byte ofdata.\nAfter seven consecutive ICMP replies with empty or inconsistently formatted content, transfers between the backdoor and C&C server are considered finished.\nConcerning the requests to send the result of the issued command to the C&C server, server mode is changed for post mode, and the final string (abcdefghijklmnop) is changed for the result data.",
        "relationship": "1. [CoT]: The text states that PowHeartBeat sends a heartbeat packet at each loop, which contains the string \"abcdefghijklmnopqrstuvwxyz\". This indicates that the process PowHeartBeat is sending a packet containing the specified string. [Relationships]: <process:PowHeartBeat,sends,packet:heartbeat packet containing the string abcdefghijklmnopqrstuvwxyz>. \n2. [CoT]: The text mentions that requests to get commands performed by the backdoor contain the string \"abcdefghijklmnop\". This shows that the process PowHeartBeat is sending a request packet containing the specified string. [Relationships]: <process:PowHeartBeat,sends,packet:request containing the string abcdefghijklmnop>. \n3. [CoT]: The text describes that heartbeat packets have a format with a client ID and a client flag, among other fields. This indicates that PowHeartBeat is sending packets with the specified format. [Relationships]: <process:PowHeartBeat,sends,packet:heartbeat packet with format described in Figure 7>. \n4. [CoT]: The text states that the response from the C&C server has a format with a flag and other fields. This shows that PowHeartBeat is receiving packets with the specified format from the C&C server (socket). [Relationships]: <process:PowHeartBeat,receives,socket:C&C server>. <process:PowHeartBeat,receives,packet:response with format described in Figure 8>. \n5. [CoT]: The text mentions that requests to get commands have a format with a flag and other fields. This indicates that PowHeartBeat is sending packets with the specified format to the C&C server (socket). [Relationships]: <process:PowHeartBeat,sends,socket:C&C server>. <process:PowHeartBeat,sends,packet:request with format described in Figure 9>. \n6. [CoT]: The text describes that responses to these requests have a format with a command identifier and other fields. This shows that PowHeartBeat is receiving packets with the specified format from the C&C server (socket). [Relationships]: <process:PowHeartBeat,receives,socket:C&C server>. <process:PowHeartBeat,receives,packet:response with format described in Figure 10>. \n7. [CoT]: The text states that after seven consecutive ICMP replies, transfers between the backdoor and C&C server are considered finished. This indicates that PowHeartBeat is receiving ICMP replies from the C&C server (socket). [Relationships]: <process:PowHeartBeat,receives,socket:C&C server>. ",
        "semantic_relationship": "[CoT]: The original relationship states that the process \"PowHeartBeat\" sends a packet containing a specific string. In system-level terms, this corresponds to a process writing data to a socket, hence the relationship is converted to \"Write\" between the process and the socket. [System-level Relationships]: <process:PowHeartBeat,Write,socket:heartbeat packet>. \n[CoT]: The original relationship describes a process sending a packet with specific content. In system-level terms, this corresponds to a Process-to-Network \"Send\" relationship, as the process is transmitting data over a network connection. The content of the packet is included for accuracy but does not change the core relationship type. [System-level Relationships]: <process:PowHeartBeat,Send,packet:request containing the string abcdefghijklmnop>. \n[CoT]: The original relationship states that the process PowHeartBeat \"sends\" a packet with a specific format. In system-level terms, this corresponds to a Process-to-Packet \"Send\" relationship, as the process is transmitting a packet to the network. [System-level Relationships]: <process:PowHeartBeat,Send,packet:heartbeat packet with format described in Figure 7>. \n[CoT]: The original relationships indicate that PowHeartBeat is receiving packets from the C&C server. In system-level terms, this corresponds to a Process-to-Socket \"Receive\" relationship, as the process is accepting data transmitted over a network socket. The packet is treated as data received from the socket. [System-level Relationships]: <process:PowHeartBeat,Receive,socket:C&C server>. \n[CoT]: The original relationships state that PowHeartBeat sends packets to the C&C server. In system-level terms, this corresponds to a Process-to-Socket 'Send' relationship, as the process is transmitting data to a socket. The second relationship is more specific about the content of the packet, but the core action of sending data still maps to 'Send' in the system-level framework. [System-level Relationships]: <process:PowHeartBeat,Send,socket:C&C server>. \n[CoT]: The original relationships indicate that PowHeartBeat is receiving packets from the C&C server. In system-level terms, this corresponds to a Process-to-Socket \"Receive\" relationship, as the process is accepting data transmitted over the socket. The second relationship remains as-is, as it describes the process receiving a specific type of packet. [System-level Relationships]: <process:PowHeartBeat,Receive,socket:C&C server>. <process:PowHeartBeat,receives,packet:response with format described in Figure 10>. \n[CoT]: The original relationship states that PowHeartBeat \"receives\" ICMP replies from the C&C server (socket). In system-level terms, this corresponds to a \"Receive\" action between a process and a socket, as the process is accepting incoming network packets from the socket. [System-level Relationships]: <process:PowHeartBeat,Receive,socket:C&C server>. "
    },
    {
        "phase": "execution",
        "content": "PowHeartBeat has various capabilities, including command/process execution and file manipulation. Table 2 lists all commands supported by the various analyzed samples.\nTable 2. PowHeartBeat command descriptions\nIn case of errors on the backdoor side, the backdoor uses a specific command identifier 0x00 in the POST request to the C&C server, thus indicating an error occurred.\nNote that before sending the information back to the C&C server, the data is gzip-compressed.",
        "relationship": "1. [CoT]: The text mentions that PowHeartBeat uses a specific command identifier (0x00) in the POST request to the C&C server, indicating an error occurred. This shows that PowHeartBeat sends a request to the C&C server.   [Relationships]: <process:PowHeartBeat,sends,socket:C&C server>. \n2. [CoT]: The text states that before sending the information back to the C&C server, the data is gzip-compressed, implying PowHeartBeat performs compression on the data.   [Relationships]: <process:PowHeartBeat,compresses,file:data>. ",
        "semantic_relationship": "[CoT]: The original relationship \"sends\" indicates that the process PowHeartBeat is sending data to a socket (C&C server). In system-level terms, this corresponds to the \"Send\" relationship between a process and a socket. [System-level Relationships]: <process:PowHeartBeat,Send,socket:C&C server>. \n[CoT]: The original relationship states that PowHeartBeat compresses the data file. In system-level terms, compression is part of the Process-to-File \"Write\" operation, as it involves modifying the content of the file by applying compression algorithms to its data. Therefore, the correct system-level relationship is \"Write\". [System-level Relationships]: <process:PowHeartBeat,Write,file:data>. "
    },
    {
        "phase": "command and control",
        "content": "PNGLoad is the second-stage payload deployed by Worok on compromised systems and, according to ESET telemetry, loaded either by CLRLoad or PowHeartBeat. While we don't see any code in PowHeartBeat that directly loads PNGLoad, the backdoor has the capabilities to download and execute additional payloads from the C&C server, which is likely how the attackers have deployed PNGLoad on systems compromised with PowHeartBeat. PNGLoad is a loader that uses bytes from PNG files to create a payload to execute. It is a 64-bit .NET executable – obfuscated with.NET Reactor– that masquerades as legitimate software. For example, Figure 11 shows the CLR headers of a sample masquerading as a WinRAR DLL.\nOnce deobfuscated, only one class is present. In this class, there is aMainPathattribute containing the directory path the backdoor searches, including its subdirectories, for files with a.pngextension, as shown in Figure 12.\nEach.pngfile located by this search ofMainPathis then checked for steganographically embedded content. First, the least-significant bit of each pixel's R (red), G (green), B (blue), and A (alpha) values are fetched and assembled into a buffer. Should the first eight bytes of that buffer match the magic number seen in Figure 13 and the next eight-byte value, control, be non-null, the file passes PNGLoad's steganographic content check. For such files, processing continues with the remainder of the buffer decrypted with a multiple-byte XOR, using the key stored in PNGLoad'sSecretKeyBytesattribute, and then the decrypted buffer is gzip-decompressed. The result is expected to be a PowerShell script, which is run immediately.\nInterestingly, operations performed by PNGLoad are logged in a file whose path is stored in the variableLogFilePath. Operations are only logged if a file is present whose path is specified by the internal variableIfLogFilePath.\nWe have not been able to obtain a sample.pngfile used along with PNGLoad, but the way PNGLoad operates suggests that it should work with valid PNG files. To hide the malicious payload, Worok uses Bitmap objects in C#, which only take pixel information from files, not the file metadata. This means that Worok can hide its malicious payloads in valid, innocuous-looking PNG images and thus hide in plain sight.",
        "relationship": "1. [CoT]: The text states that \"PNGLoad is the second-stage payload deployed by Worok on compromised systems and, according to ESET telemetry, loaded either by CLRLoad or PowHeartBeat,\" indicating that CLRLoad loads PNGLoad. [Relationships]: <process:CLRLoad,loads,file:PNGLoad>. \n2. [CoT]: The text states that \"PNGLoad is a loader that uses bytes from PNG files to create a payload to execute,\" indicating that PNGLoad uses PNG files. [Relationships]: <process:PNGLoad,uses,file:PNG files>. \n3. [CoT]: The text states that \"the backdoor has the capabilities to download and execute additional payloads from the C&C server,\" indicating that PowHeartBeat downloads PNGLoad. [Relationships]: <process:PowHeartBeat,downloads,file:PNGLoad>. \n4. [CoT]: The text states that \"PNGLoad is a loader that... that masquerades as legitimate software,\" indicating that PNGLoad masquerades as WinRAR DLL. [Relationships]: <process:PNGLoad,masquerades as,file:WinRAR DLL>. \n5. [CoT]: The text describes the mechanism by which PNGLoad searches for .png files in the MainPath directory. [Relationships]: <process:PNGLoad,searches for,file:MainPath directory>. \n6. [CoT]: The text states that PNGLoad checks .png files for steganographically embedded content, indicating a process-to-file relationship. [Relationships]: <process:PNGLoad,checks,file:.png files>. \n7. [CoT]: The text describes how PNGLoad decrypts the buffer using the SecretKeyBytes attribute, indicating a process-to-socket relationship. [Relationships]: <process:PNGLoad,decrypts,socket:SecretKeyBytes>. \n8. [CoT]: The text states that the decrypted buffer is gzip-decompressed, indicating a process-to-file relationship. [Relationships]: <process:PNGLoad,gzip-decompresses,file:buffer>. \n9. [CoT]: The text describes that the result of the decryption is expected to be a PowerShell script, which is run immediately, indicating a process-to-file relationship. [Relationships]: <process:PNGLoad,runs,file:PowerShell script>. \n10. [CoT]: The text mentions that operations performed by PNGLoad are logged in a file specified by LogFilePath, indicating a process-to-file relationship. [Relationships]: <process:PNGLoad,logs,file:LogFilePath>. ",
        "semantic_relationship": "[CoT]: The original relationship \"loads\" implies that the process CLRLoad executes the file PNGLoad, which aligns with the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:CLRLoad,Execute,file:PNGLoad>. \n[CoT]: The original relationship \"uses\" is too generic. Since PNGLoad loads bytes from PNG files to create a payload, this corresponds to the system-level relationship \"Read\" between the process and the file. [System-level Relationships]: <process:PNGLoad,Read,file:PNG files>. \n[CoT]: The term \"downloads\" implies that the process PowHeartBeat writes the file PNGLoad to disk, which aligns with the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:PowHeartBeat,Write,file:PNGLoad>. \n[CoT]: The term \"masquerades as\" in the original relationship implies that PNGLoad is attempting to deceive other processes or systems into believing it is a legitimate WinRAR DLL file. In system-level terms, this behavior is best represented as \"Process Injection\" because PNGLoad is injecting its code into the process space of WinRAR DLL, which can lead to code execution vulnerabilities. [System-level Relationships]: <process:PNGLoad,Inject,process:WinRAR DLL>. \n[CoT]: The original relationship \"searches for\" implies that PNGLoad is looking for files in the MainPath directory, which corresponds to the system-level \"Read\" operation where the process reads the contents of the directory to find files. [System-level Relationships]: <process:PNGLoad,Read,file:MainPath directory>. \n[CoT]: The original relationship \"checks\" implies that PNGLoad is inspecting the content of .png files, which aligns with the system-level relationship \"Read\" as it involves accessing the file's data. [System-level Relationships]: <process:PNGLoad,Read,file:.png files>. \n[CoT]: The original relationship describes PNGLoad decrypting data from the socket SecretKeyBytes, which implies that the process is receiving encrypted data from the socket. In system-level terms, this corresponds to a 'Receive' relationship between the process and the socket. [System-level Relationships]: <process:PNGLoad,Receive,socket:SecretKeyBytes>. \n[CoT]: The original relationship \"gzip-decompresses\" implies that the process PNGLoad is reading data from the file buffer to perform gzip decompression. In system-level terms, this corresponds to a \"Read\" operation from the process to the file. [System-level Relationships]: <process:PNGLoad,Read,file:buffer>. \n[CoT]: The original relationship states that the process \"PNGLoad\" runs the PowerShell script, which directly translates to the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:PNGLoad,Execute,file:PowerShell script>. \n[CoT]: The original relationship states that PNGLoad \"logs\" to LogFilePath, which implies that the process is writing data to the file. In system-level terms, this corresponds to a \"Write\" operation from the process to the file. [System-level Relationships]: <process:PNGLoad,Write,file:LogFilePath>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that \"The payload is reconstructed, it is executed via IEX,\" indicating that the PowerShell process IEX executes the payload. [Original Relationships]: <process:IEX,executes,file:payload>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process IEX \"executes\" the file \"payload.\" In the system-level framework, this directly maps to the \"Execute\" relationship between a process and a file, as it describes a process running or launching a file. [System-level Relationships]: <process:IEX,Execute,file:payload>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions \"another layer of obfuscated code is executed,\" implying that the IEX process executes this obfuscated code. [Original Relationships]: <process:IEX,executes,file:obfuscated code>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the IEX process \"executes\" the obfuscated code file. In system-level terms, this directly translates to the \"Execute\" relationship between a process and a file, as it indicates the process is running or launching the file. [System-level Relationships]: <process:IEX,Execute,file:obfuscated code>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes that the obfuscated code is decoded, which is followed by decryption and decomposition processes. [Original Relationships]: <process:obfuscated code,decodes,file:next layer of its code>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the obfuscated code \"decodes\" the next layer of its code, which implies that the obfuscated code needs to read the encrypted/obfuscated code file to perform the decoding operation. Therefore, the system-level relationship is \"Read\" from the process to the file. [System-level Relationships]: <process:obfuscated code,Read,file:next layer of its code>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The obfuscated code is decoded to give the next layer of code, which is then decrypted with Triple DES. [Original Relationships]: <process:next layer of its code,decrypts,file:Triple DES(CBC mode)>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the next layer of code decrypts Triple DES(CBC mode). In system-level terms, this translates to the process reading the encrypted file to obtain the key for decryption. The action of reading the file to obtain data or keys is represented as 'Read' in the system-level relationships. [System-level Relationships]: <process:next layer of its code,Read,file:Triple DES(CBC mode)>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The decrypted code is decompressed using gzip, revealing the third layer of PowerShell code. [Original Relationships]: <process:Triple DES(CBC mode),decompresses,file:gzipalgorithm>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the Triple DES process decompresses the file using the gzip algorithm. In system-level terms, this corresponds to the 'Decode' action between a process and a file, as the process is performing a decompression operation on the file. [System-level Relationships]: <process:Triple DES(CBC mode),Decode,file:gzipalgorithm>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The main layer of backdoor code communicates with the C&C server using HTTP or ICMP. [Original Relationships]: <process:backdoor code,communicates with,socket:C&C server>. ",
                "semantic_relationship": "[CoT]: The original relationship \"communicates with\" can be mapped to the system-level relationship \"Connect\" between a process and a socket, as it describes the establishment of a connection to a C&C server. [System-level Relationships]: <process:backdoor code,Connect,socket:C&C server>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes that the PowHeartBeat sample contains a configuration with a C&C address field, indicating a process-to-socket relationship where the process PowHeartBeat interacts with the C&C address socket.   [Original Relationships]: <process:PowHeartBeat,connect,socket:C&C address>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (PowHeartBeat) connecting to a socket (C&C address). In the system-level framework, this directly maps to the Process-to-Socket \"Connect\" relationship, as it involves establishing a connection to a remote socket. [System-level Relationships]: <process:PowHeartBeat,Connect,socket:C&C address>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the backdoor sends a GET request to the C&C server, indicating a process-to-socket relationship. [Original Relationships]: <process:backdoor, sends, socket:C&C server>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (backdoor) sending a request to a socket (C&C server), which directly maps to the system-level 'Send' relationship between a process and a socket. [System-level Relationships]: <process:backdoor,Send,socket:C&C server>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that the backdoor processes the command from the C&C server, showing a process-to-process relationship. [Original Relationships]: <process:backdoor, processes, process:command>. ",
                "semantic_relationship": "[CoT]: The original relationship \"processes\" indicates that the backdoor is executing the command received from the C&C server. In system-level terms, this corresponds to an \"Fork\" relationship between processes. [System-level Relationships]: <process:backdoor,Fork,process:command>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The backdoor writes the command output to a file, which is later sent to the C&C server, indicating a process-to-file relationship. [Original Relationships]: <process:backdoor, writes, file:command output file>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the backdoor writing data to a file, which directly corresponds to the system-level \"Write\" relationship between a process and a file. [System-level Relationships]: <process:backdoor,Write,file:command output file>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes that the command output is sent to the C&C server via a POST request, showing a process-to-socket relationship. [Original Relationships]: <process:backdoor, sends, socket:C&C server>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process sending data to a socket, which directly maps to the system-level 'Send' relationship between a process and a socket. [System-level Relationships]: <process:backdoor,Send,socket:C&C server>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The response from the C&C server contains a cookie named afterCookieTaskId, which is used in the encryption algorithm, indicating a socket-to-cookie relationship. [Original Relationships]: <socket:C&C server, contains, cookie:afterCookieTaskId>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the C&C server contains a cookie named afterCookieTaskId. In system-level terms, this implies that the C&C server is writing the cookie to the client's socket, hence the \"Write\" relationship. [System-level Relationships]: <socket:C&C server,Write,cookie:afterCookieTaskId>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The response from the C&C server also contains another cookie named CookieTerminalId, which is repeated in the POST request, showing a socket-to-cookie relationship. [Original Relationships]: <socket:C&C server, contains, cookie:CookieTerminalId>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the C&C server contains the CookieTerminalId cookie. In system-level terms, this implies that the C&C server is writing or modifying the cookie, which aligns with the 'Write' action in the socket-to-cookie relationship framework. [System-level Relationships]: <socket:C&C server,Write,cookie:CookieTerminalId>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: After executing the backdoor command, PowHeartBeat sends the result as a POST request to the C&C server, indicating a process-to-socket relationship. [Original Relationships]: <process:PowHeartBeat, sends, socket:C&C server>. ",
                "semantic_relationship": "[CoT]: The original relationship \"sends\" indicates that the process PowHeartBeat is sending data to a socket (C&C server). In system-level terms, this corresponds to the \"Send\" relationship between a process and a socket. [System-level Relationships]: <process:PowHeartBeat,Send,socket:C&C server>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The result is sent as a file named <command_id>.png, showing a process-to-file relationship. [Original Relationships]: <process:PowHeartBeat, sends, file:<command_id>.png>. ",
                "semantic_relationship": "[CoT]: The original relationship \"sends\" indicates that the process is writing data to the file, which corresponds to the \"Write\" action in the system-level relationships framework. [System-level Relationships]: <process:PowHeartBeat,Write,file:<command_id>.png>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that PowHeartBeat sends a heartbeat packet at each loop, which contains the string \"abcdefghijklmnopqrstuvwxyz\". This indicates that the process PowHeartBeat is sending a packet containing the specified string. [Original Relationships]: <process:PowHeartBeat,sends,packet:heartbeat packet containing the string abcdefghijklmnopqrstuvwxyz>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process \"PowHeartBeat\" sends a packet containing a specific string. In system-level terms, this corresponds to a process writing data to a socket, hence the relationship is converted to \"Write\" between the process and the socket. [System-level Relationships]: <process:PowHeartBeat,Write,socket:heartbeat packet>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that requests to get commands performed by the backdoor contain the string \"abcdefghijklmnop\". This shows that the process PowHeartBeat is sending a request packet containing the specified string. [Original Relationships]: <process:PowHeartBeat,sends,packet:request containing the string abcdefghijklmnop>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process sending a packet with specific content. In system-level terms, this corresponds to a Process-to-Network \"Send\" relationship, as the process is transmitting data over a network connection. The content of the packet is included for accuracy but does not change the core relationship type. [System-level Relationships]: <process:PowHeartBeat,Send,socket:request containing the string abcdefghijklmnop>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes that heartbeat packets have a format with a client ID and a client flag, among other fields. This indicates that PowHeartBeat is sending packets with the specified format. [Original Relationships]: <process:PowHeartBeat,sends,packet:heartbeat packet with format described in Figure 7>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process PowHeartBeat \"sends\" a packet with a specific format. In system-level terms, this corresponds to a Process-to-Packet \"Send\" relationship, as the process is transmitting a packet to the network. [System-level Relationships]: <process:PowHeartBeat,Send,socket:heartbeat packet with format described in Figure 7>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the response from the C&C server has a format with a flag and other fields. This shows that PowHeartBeat is receiving packets with the specified format from the C&C server (socket). [Original Relationships]: <process:PowHeartBeat,receives,socket:C&C server>. <process:PowHeartBeat,receives,packet:response with format described in Figure 8>. ",
                "semantic_relationship": "[CoT]: The original relationships indicate that PowHeartBeat is receiving packets from the C&C server. In system-level terms, this corresponds to a Process-to-Socket \"Receive\" relationship, as the process is accepting data transmitted over a network socket. The packet is treated as data received from the socket. [System-level Relationships]: <process:PowHeartBeat,Receive,socket:C&C server>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that requests to get commands have a format with a flag and other fields. This indicates that PowHeartBeat is sending packets with the specified format to the C&C server (socket). [Original Relationships]: <process:PowHeartBeat,sends,socket:C&C server>. <process:PowHeartBeat,sends,packet:request with format described in Figure 9>. ",
                "semantic_relationship": "[CoT]: The original relationships state that PowHeartBeat sends packets to the C&C server. In system-level terms, this corresponds to a Process-to-Socket 'Send' relationship, as the process is transmitting data to a socket. The second relationship is more specific about the content of the packet, but the core action of sending data still maps to 'Send' in the system-level framework. [System-level Relationships]: <process:PowHeartBeat,Send,socket:C&C server>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes that responses to these requests have a format with a command identifier and other fields. This shows that PowHeartBeat is receiving packets with the specified format from the C&C server (socket). [Original Relationships]: <process:PowHeartBeat,receives,socket:C&C server>. <process:PowHeartBeat,receives,packet:response with format described in Figure 10>. ",
                "semantic_relationship": "[CoT]: The original relationships indicate that PowHeartBeat is receiving packets from the C&C server. In system-level terms, this corresponds to a Process-to-Socket \"Receive\" relationship, as the process is accepting data transmitted over the socket. The second relationship remains as-is, as it describes the process receiving a specific type of packet. [System-level Relationships]: <process:PowHeartBeat,Receive,socket:C&C server>. <process:PowHeartBeat,Receive,socket:response with format described in Figure 10>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that after seven consecutive ICMP replies, transfers between the backdoor and C&C server are considered finished. This indicates that PowHeartBeat is receiving ICMP replies from the C&C server (socket). [Original Relationships]: <process:PowHeartBeat,receives,socket:C&C server>. ",
                "semantic_relationship": "[CoT]: The original relationship states that PowHeartBeat \"receives\" ICMP replies from the C&C server (socket). In system-level terms, this corresponds to a \"Receive\" action between a process and a socket, as the process is accepting incoming network packets from the socket. [System-level Relationships]: <process:PowHeartBeat,Receive,socket:C&C server>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text mentions that PowHeartBeat uses a specific command identifier (0x00) in the POST request to the C&C server, indicating an error occurred. This shows that PowHeartBeat sends a request to the C&C server.   [Original Relationships]: <process:PowHeartBeat,sends,socket:C&C server>. ",
                "semantic_relationship": "[CoT]: The original relationship \"sends\" indicates that the process PowHeartBeat is sending data to a socket (C&C server). In system-level terms, this corresponds to the \"Send\" relationship between a process and a socket. [System-level Relationships]: <process:PowHeartBeat,Send,socket:C&C server>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that before sending the information back to the C&C server, the data is gzip-compressed, implying PowHeartBeat performs compression on the data.   [Original Relationships]: <process:PowHeartBeat,compresses,file:data>. ",
                "semantic_relationship": "[CoT]: The original relationship states that PowHeartBeat compresses the data file. In system-level terms, compression is part of the Process-to-File \"Write\" operation, as it involves modifying the content of the file by applying compression algorithms to its data. Therefore, the correct system-level relationship is \"Write\". [System-level Relationships]: <process:PowHeartBeat,Write,file:data>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that \"PNGLoad is the second-stage payload deployed by Worok on compromised systems and, according to ESET telemetry, loaded either by CLRLoad or PowHeartBeat,\" indicating that CLRLoad loads PNGLoad. [Original Relationships]: <process:CLRLoad,loads,file:PNGLoad>. ",
                "semantic_relationship": "[CoT]: The original relationship \"loads\" implies that the process CLRLoad executes the file PNGLoad, which aligns with the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:CLRLoad,Execute,file:PNGLoad>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that \"PNGLoad is a loader that uses bytes from PNG files to create a payload to execute,\" indicating that PNGLoad uses PNG files. [Original Relationships]: <process:PNGLoad,uses,file:PNG files>. ",
                "semantic_relationship": "[CoT]: The original relationship \"uses\" is too generic. Since PNGLoad loads bytes from PNG files to create a payload, this corresponds to the system-level relationship \"Read\" between the process and the file. [System-level Relationships]: <process:PNGLoad,Read,file:PNG files>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that \"the backdoor has the capabilities to download and execute additional payloads from the C&C server,\" indicating that PowHeartBeat downloads PNGLoad. [Original Relationships]: <process:PowHeartBeat,downloads,file:PNGLoad>. ",
                "semantic_relationship": "[CoT]: The term \"downloads\" implies that the process PowHeartBeat writes the file PNGLoad to disk, which aligns with the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:PowHeartBeat,Write,file:PNGLoad>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that \"PNGLoad is a loader that... that masquerades as legitimate software,\" indicating that PNGLoad masquerades as WinRAR DLL. [Original Relationships]: <process:PNGLoad,masquerades as,file:WinRAR DLL>. ",
                "semantic_relationship": "[CoT]: The term \"masquerades as\" in the original relationship implies that PNGLoad is attempting to deceive other processes or systems into believing it is a legitimate WinRAR DLL file. In system-level terms, this behavior is best represented as \"Process Injection\" because PNGLoad is injecting its code into the process space of WinRAR DLL, which can lead to code execution vulnerabilities. [System-level Relationships]: <process:PNGLoad,Inject,process:WinRAR DLL>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes the mechanism by which PNGLoad searches for .png files in the MainPath directory. [Original Relationships]: <process:PNGLoad,searches for,file:MainPath directory>. ",
                "semantic_relationship": "[CoT]: The original relationship \"searches for\" implies that PNGLoad is looking for files in the MainPath directory, which corresponds to the system-level \"Read\" operation where the process reads the contents of the directory to find files. [System-level Relationships]: <process:PNGLoad,Read,file:MainPath directory>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that PNGLoad checks .png files for steganographically embedded content, indicating a process-to-file relationship. [Original Relationships]: <process:PNGLoad,checks,file:.png files>. ",
                "semantic_relationship": "[CoT]: The original relationship \"checks\" implies that PNGLoad is inspecting the content of .png files, which aligns with the system-level relationship \"Read\" as it involves accessing the file's data. [System-level Relationships]: <process:PNGLoad,Read,file:.png files>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes how PNGLoad decrypts the buffer using the SecretKeyBytes attribute, indicating a process-to-socket relationship. [Original Relationships]: <process:PNGLoad,decrypts,socket:SecretKeyBytes>. ",
                "semantic_relationship": "[CoT]: The original relationship describes PNGLoad decrypting data from the socket SecretKeyBytes, which implies that the process is receiving encrypted data from the socket. In system-level terms, this corresponds to a 'Receive' relationship between the process and the socket. [System-level Relationships]: <process:PNGLoad,Receive,socket:SecretKeyBytes>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the decrypted buffer is gzip-decompressed, indicating a process-to-file relationship. [Original Relationships]: <process:PNGLoad,gzip-decompresses,file:buffer>. ",
                "semantic_relationship": "[CoT]: The original relationship \"gzip-decompresses\" implies that the process PNGLoad is reading data from the file buffer to perform gzip decompression. In system-level terms, this corresponds to a \"Read\" operation from the process to the file. [System-level Relationships]: <process:PNGLoad,Read,file:buffer>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text describes that the result of the decryption is expected to be a PowerShell script, which is run immediately, indicating a process-to-file relationship. [Original Relationships]: <process:PNGLoad,runs,file:PowerShell script>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the process \"PNGLoad\" runs the PowerShell script, which directly translates to the system-level relationship \"Execute\" between a process and a file. [System-level Relationships]: <process:PNGLoad,Execute,file:PowerShell script>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that operations performed by PNGLoad are logged in a file specified by LogFilePath, indicating a process-to-file relationship. [Original Relationships]: <process:PNGLoad,logs,file:LogFilePath>. ",
                "semantic_relationship": "[CoT]: The original relationship states that PNGLoad \"logs\" to LogFilePath, which implies that the process is writing data to the file. In system-level terms, this corresponds to a \"Write\" operation from the process to the file. [System-level Relationships]: <process:PNGLoad,Write,file:LogFilePath>. "
            }
        ]
    }
]