[
    {
        "phase": "initial access",
        "content": "A user accidentally installs a malicious appstarter APK de.belu.appstarter, which loads an attack module called busybox. This module gives the attacker control from 77.138.117.150. The attacker then installs the driver msm_g711tlaw into the victim host for privilege escalation. The attack exfiltrates calllog.db, calendar.db, and mmssms.db and takes a screenshot. Two days later, the attacker exploits appstarter again to try to connect to the C&C server(128.55.12.233) but failed. The ground truth also describes some malicious activity of attack payloads called lockwatch and mozilla. Upon close inspection, we discover that the provenance data related to the malicious activity is corrupted. We remove the corrupted data and omit the malicious activity in Fig. 6.",
        "relationship": "1. [CoT]: The text states that the malicious appstarter APK loads an attack module called busybox, indicating a process-to-process relationship where appstarter loads busybox.   [Relationships]: <process:appstarter,loads,process:busybox>. \n2. [CoT]: The text mentions that busybox gives the attacker control from 77.138.117.150, indicating a process-to-socket relationship where busybox controls the IP address.   [Relationships]: <process:busybox,controls,socket:77.138.117.150>. \n3. [CoT]: The text states that the attacker installs the driver msm_g711tlaw into the victim host, indicating a process-to-file relationship where the attacker installs the file.   [Relationships]: <process:attacker,installs,file:msm_g711tlaw>. \n4. [CoT]: The text mentions that the attack exfiltrates calllog.db, indicating a process-to-file relationship where the attack exfiltrates the file.   [Relationships]: <process:attack,exfiltrates,file:calllog.db>. \n5. [CoT]: The text mentions that the attack exfiltrates calendar.db, indicating a process-to-file relationship where the attack exfiltrates the file.   [Relationships]: <process:attack,exfiltrates,file:calendar.db>. \n6. [CoT]: The text mentions that the attack exfiltrates mmssms.db, indicating a process-to-file relationship where the attack exfiltrates the file.   [Relationships]: <process:attack,exfiltrates,file:mmssms.db>. \n7. [CoT]: The text states that the attacker exploits appstarter, indicating a process-to-process relationship where the attacker exploits appstarter.   [Relationships]: <process:attacker,exploits,process:appstarter>. \n8. [CoT]: The text mentions that the attacker exploits appstarter to try to connect to the C&C server, indicating a process-to-socket relationship where appstarter connects to the socket.   [Relationships]: <process:appstarter,connects,socket:128.55.12.233>. "
    }
]