[
    {
        "phase": "execution",
        "content": "QBot PowerShell analysis\nWhen run for the first time, the script creates a new registry key entry in the same path, saving the date of execution. It then verifies upon execution if the creation date key of this registry key is older than 4 hours.\nBased on the outcome, it will either: (1) retrieve the base64-encoded Qbot payload from the Windows Registry, decode it, save it on the file system and execute it.\nOR (2) Fetch the QBot payload remotely using one of the active C2 IPs using theInvoke-WebRequestPowerShell module:\nThe PS script contains built-in logic to execute various types of payloads including batch and Visual Basic files.\nThe encoded QBot DLL that was stored in the registry, was dropped in the directory%APPDATA%\\Roaming\\Microsoft\\Fdopitcu. The unsigned DLL, with descriptorCancel Autoplay 2was executed usingregsvr32.exe\nUpon execution of this second-stage DLL, various registry keys were created inHKCU\\Software\\Microsoft\\Yerqbqokc.In addition, a new instance of explorer.exe (32-bit) was started and injected into.\nThe registry keys contain eight-character long hex strings for which we believe is part of the malware's encryptedconfig.",
        "relationship": "1. [CoT]: The text states that the script creates a new registry key entry in the same path, indicating a process-to-registry relationship where the process 'script' creates the registry key. [Relationships]: <process:script,creates,registry:Same path>. \n2. [CoT]: The text mentions that the script verifies if the creation date key of the registry key is older than 4 hours, showing a process-to-registry relationship where the process 'script' verifies the registry key. [Relationships]: <process:script,verifies,registry:creation date key>. \n3. [CoT]: The script retrieves the base64-encoded Qbot payload from the Windows Registry, indicating a process-to-registry relationship where the process 'script' retrieves data from the registry. [Relationships]: <process:script,retrieves,registry:base64-encoded Qbot payload>. \n4. [CoT]: The script decodes the base64-encoded payload and saves it on the file system, showing a process-to-file relationship where the process 'script' saves a file. [Relationships]: <process:script,saves,file:base64-encoded Qbot payload>. \n5. [CoT]: The script executes the decoded payload, indicating a process-to-file relationship where the process 'script' executes a file (payload). [Relationships]: <process:script,executes,file:payload>. \n6. [CoT]: The PS script fetches the QBot payload remotely using an active C2 IP, showing a process-to-socket relationship where the process 'PS script' fetches data from a socket (C2 IP). [Relationships]: <process:PS script,fetches,socket:active C2 IPs>. \n7. [CoT]: The PS script uses the Invoke-WebRequest PowerShell module to fetch the payload, indicating a process-to-process relationship where the process 'PS script' uses another process (module). [Relationships]: <process:PS script,uses,process:Invoke-WebRequest PowerShell module>. \n8. [CoT]: The descriptor describes where the encoded QBot DLL was stored in the registry, showing a process-to-registry relationship where the process 'script' stores the DLL in the registry. [Relationships]: <process:script,stores,registry:encoded QBot DLL>. \n9. [CoT]: The descriptor mentions that the unsigned DLL was dropped in a specific directory, indicating a process-to-file relationship where the process 'script' drops a file (DLL). [Relationships]: <process:script,drops,file:unsigned DLL>. \n10. [CoT]: The script executes regsvr32.exe to execute the unsigned DLL, showing a process-to-process relationship where the process 'script' executes another process (regsvr32.exe). [Relationships]: <process:script,executes,process:regsvr32.exe>. \n11. [CoT]: Upon execution of the second-stage DLL, various registry keys were created, indicating a process-to-registry relationship where the process 'DLL' creates registry keys. [Relationships]: <process:DLL,creates,registry:HKCU\\Software\\Microsoft\\Yerqbqokc>. \n12. [CoT]: A new instance of explorer.exe was started, showing a process-to-process relationship where the process 'DLL' starts another process (explorer.exe). [Relationships]: <process:DLL,starts,process:explorer.exe>. \n13. [CoT]: explorer.exe was injected into by the DLL, indicating a process-to-process relationship where the process 'DLL' injects into process explorer.exe. [Relationships]: <process:DLL,injects into,process:explorer.exe>. "
    },
    {
        "phase": "privilege escalation",
        "content": "Thirty minutes after gaining initial access, the threat actors ran an executable file on the beachhead to exploit CVE-2020-1472, Zerologon.\nThe executable was named \"cool.exe\" :\nThree milliseconds after theZerologonexploit, an event 4742 \"A computer account was changed.\" was generated on the targeted Domain Controller.\nAs explained in a detailed blog fromCrowdStrike, the ZeroLogon CVE relies on the AES-CFB8 algorithm used with a zero IV :\nAs we can see on the network captures, a brute-force attack was performed in order to spoof the identity of the domain controller :\nAfter the end of the brute force traffic, we can see a single instance where a the exploit has completed successfully.\nAfter being successfully authenticated, the DC password was set:\nThe PasswordLastSet field is equal to the TimeCreated field, meaning that the password of the domain controller was successfully updated.We can also see that the SubjectUserName is ANONYMOUS LOGON.\nA connection was performed from thebeachheadto the Domain Controller using the DC account.After authenticating to the DC with the DC account, the threat actors dumped the Domain Admin hash, and then reset the DC password in order to unbreak the Active Directory Domain.\nThe explorer shell was also restarted by the threat actor:",
        "relationship": "1. [CoT]: The text states that the threat actors ran an executable file named \"cool.exe,\" indicating a process-to-file relationship where the threat actors (process) ran the executable file (file).   [Relationships]: <process:threat actors,ran,file:cool.exe>. \n2. [CoT]: The text mentions that after the Zerologon exploit, an event 4742 was generated on the Domain Controller, indicating a process-to-event relationship where the Zerologon exploit (process) generated the event (event).   [Relationships]: <process:Zerologonexploit,generated,event:event 4742 \"A computer account was changed.\">. \n3. [CoT]: The text describes a brute-force attack performed to spoof the identity of the domain controller, indicating a process-to-socket relationship where the threat actors (process) performed the brute-force attack (socket).   [Relationships]: <process:threat actors,performed,socket:brute-force attack>. \n4. [CoT]: The text states that the exploit successfully authenticated to the DC, indicating a process-to-socket relationship where the exploit (process) performed the authentication action (socket).   [Relationships]: <process:exploit,performed,socket:authenticated>. \n5. [CoT]: The text describes that the threat actors dumped the Domain Admin hash, indicating a process-to-file relationship where the threat actors (process) dumped the Domain Admin hash (file).   [Relationships]: <process:threat actors,dumped,file:Domain Admin hash>. \n6. [CoT]: The text states that the threat actors reset the DC password, indicating a process-to-file relationship where the threat actors (process) reset the DC password (file).   [Relationships]: <process:threat actors,reset,file:DC password>. \n7. [CoT]: The text mentions that the explorer shell was restarted by the threat actor, indicating a process-to-process relationship where the threat actor (process) restarted the explorer shell (process). [Relationships]: <process:threat actor,restarted,process:explorer shell>. "
    },
    {
        "phase": "defense evasion",
        "content": "Upon execution of the initial DLL, QBot uses process hollowing to start a suspended instance of explorer.exe (32-bit) and then injects itself into this process.\nThe injected explorer.exe process was used to spawn and inject into additional instances of explorer.exe (32-bit). An example event can be seen below. Source PID 10492 belonging to QBot, injected a DLL into PID 4072 which we discovered was part of Cobalt Strike C2 communication.\nOver-Pass-the-Hash from Beachhead\nThe threat actor obtained the NTLM hash value of the administrator account through the Zerologon exploit and used over-pass-the-hashto request a TGT from the domain controller.We have seen the use of over-pass-the-hash several times before. For example, ourCobalt Strike Defender Guidecovers detection of this technique in more detail.\nSoon after, a TGT for the administrator account was requested:",
        "relationship": "1. [CoT]: The text states that QBot uses process hollowing to start a suspended instance of explorer.exe, indicating a process-to-process relationship where QBot is the process initiating the action.   [Relationships]: <process:QBot,uses,process:explorer.exe>. \n2. [CoT]: The text mentions that QBot injects itself into the explorer.exe process, indicating a process-to-process relationship where QBot is the process performing the injection action.   [Relationships]: <process:QBot,injects,process:explorer.exe>. \n3. [CoT]: The text describes that the injected explorer.exe process was used to spawn and inject into additional instances of explorer.exe (32-bit), indicating a process-to-process relationship where explorer.exe is the process performing the spawn action.   [Relationships]: <process:explorer.exe,spawns,process:explorer.exe>. \n4. [CoT]: The text mentions that the threat actor obtained the NTLM hash value of the administrator account through the Zerologon exploit, indicating a process-to-process relationship where the Zerologon exploit is the process performing the action of obtaining the hash.   [Relationships]: <process:Zerologon exploit,obtains,process:NTLM hash value>. \n5. [CoT]: The text states that the threat actor used over-pass-the-hash to request a TGT from the domain controller, indicating a process-to-process relationship where over-pass-the-hash is the process performing the action of requesting the TGT.   [Relationships]: <process:over-pass-the-hash,requests,process:TGT>. \n6. [CoT]: The text describes that a TGT for the administrator account was requested soon after, indicating a process-to-process relationship where an unknown threat actor agent requested the TGT.   [Relationships]: <process:threat actor agent,request,process:TGT>. "
    },
    {
        "phase": "discovery",
        "content": "QBot initially starts a number of processes to collect information about the affected system. This is part of the \"SYSTEM INFO\" bot request, as described in a recent article fromSecureList.\nLater, more discovery commands were executed via the Cobalt Strike beacon, which gathered information about the active directory environment.\nADFind(renamed in find.exe) used to enumerate computers\nOn the Domain Controller, the threat actors gathered information about the installed security software through WMI:\nPing was used to verify machines were online",
        "relationship": "1. [CoT]: The text states that QBot starts processes as part of its collection activity, indicating a process-to-process relationship where QBot is the source process and \"starts\" is the verb.   [Relationships]: <process:QBot,start,process:process>. \n2. [CoT]: The text mentions that more discovery commands were executed via the Cobalt Strike beacon, showing a process-to-process relationship where the Cobalt Strike beacon is the source process and \"executed\" is the verb.   [Relationships]: <process:Cobalt Strike beacon,execute,process:discovery commands>. \n3. [CoT]: The text describes ADFind (renamed to find.exe) being used to enumerate computers, indicating a process-to-process relationship where ADFind (find.exe) is the source process and \"enumerated\" is the verb.   [Relationships]: <process:ADFind(renamed in find.exe),enumerate,process:computers>. \n4. [CoT]: The text states that threat actors gathered information about installed security software through WMI, showing a process-to-process relationship where WMI is the source process and \"gathered\" is the verb.   [Relationships]: <process:WMI,gathered,process:information about installed security software>. \n5. [CoT]: The text mentions that ping was used to verify machines were online, indicating a process-to-process relationship where ping is the source process and \"verified\" is the verb.   [Relationships]: <process:ping,verify,process:machines were online>. "
    },
    {
        "phase": "lateral movement",
        "content": "On the first Domain Controller, a Cobalt Strike service was installed:\nMultiple services were installed by Cobalt Strike across the environment, here are a few examples:\nCobalt Strikefirst callsOpenSCManagerWto create the service remotely, then starts it withStartServiceAfunction:\nRDP/interactive Logins\nVarious commands were executed to enable the RDP service on various hosts:\nIncrease the max RDP connections allowed, in this case a arbitrarily large number.\nThe threat actor then established interactive administrative RDP sessions and pivoted to different hosts in the network.",
        "relationship": "1. [CoT]: The text states \"Cobalt Strike first calls OpenSCManagerW to create the service remotely,\" indicating that the Cobalt Strike process performs the action of calling the OpenSCManagerW process.   [Relationships]: <process:Cobalt Strike, calls, process:OpenSCManagerW>. \n2. [CoT]: The text mentions \"then starts it with StartServiceA function,\" showing that Cobalt Strike processes starts the StartServiceA process as part of the service creation.   [Relationships]: <process:Cobalt Strike, starts, process:StartServiceA>. \n3. [CoT]: The text states \"Various commands were executed to enable the RDP service,\" implying that the Cobalt Strike process executes other commands, which we label as the EnableRDP process.   [Relationships]: <process:Cobalt Strike, executes, process:EnableRDP>. \n4. [CoT]: The text describes \"increase the max RDP connections allowed,\" showing that the EnableRDP process performs the action of increasing connections to the socket:RDP. [Relationships]: <process:EnableRDP, increases, socket:RDP>. \n5. [CoT]: The text mentions \"established interactive administrative RDP sessions,\" indicating that the threat actor (process) established sessions to the socket:RDP. [Relationships]: <process:threat actor, establishes, socket:RDP sessions>. "
    },
    {
        "phase": "command and control",
        "content": "QBot details – 24.229.150.54 // 41.228.22.180\nHere is the initial access DLL (Qbot) information fromTria.ge\nCobalt Strike details – 5.255.98[.]144\nThis Cobalt Strike server was added to ourThreat Feedon 2021-11-16.",
        "relationship": "1. [CoT]: The text states that the IP address 24.229.150.54 belongs to QBot, indicating a process-to-socket relationship. [Relationships]: <process:QBot,access,socket:24.229.150.54>. \n2. [CoT]: The text mentions that QBot uses the IP address 41.228.22.180, indicating another process-to-socket relationship. [Relationships]: <process:QBot,access,socket:41.228.22.180>. \n3. [CoT]: The text refers to a Cobalt Strike server with the IP address 5.255.98[.]144, indicating a process-to-socket relationship with the implicit process Cobalt Strike. [Relationships]: <process:Cobalt Strike,access,socket:5.255.98[.]144>. "
    },
    {
        "phase": "exfiltration",
        "content": "While the threat actors were active in the environment, we received 3 different alerts stating that someone had opened canary documents from the IP address 91.193.182[.]165. These alerts tell us that data was indeed exfiltrated from the environment.\nThe threat actors were most interested in files concerning financial statements, ransomware reports, and salary data.\nThe C2 channel was encrypted and multiple connections were established with the internal file server. No other traffic was observed for possible exfiltration leading us to the conclusion that the command and control channel was used for the exfiltration.\nAt 17:35 UTC, the Cobalt Strike Beacon was deployed on the File Server.\nAccording to the number of connections to the C2 from the File Server per minute, we can conclude that exfiltration was done between 17:52 UTC and 18:00 UTC.\nSpike in traffic from file share server to Cobalt Strike command and control server.",
        "relationship": "1. [CoT]: The text states that the threat actors opened canary documents from the IP address 91.193.182[.]165, indicating a process-to-socket relationship where the process (threat actors) performed the action 'opened' on the socket (IP address).   [Relationships]: <process:threat actors, opened, socket:91.193.182[.]165>. \n2. [CoT]: The text mentions that the threat actors were most interested in files concerning financial statements, indicating a process-to-file relationship where the process (threat actors) performed the action 'interested in' on the file (financial statements).   [Relationships]: <process:threat actors, interested in, file:financial statements>. \n3. [CoT]: The text states that the threat actors were interested in files concerning ransomware reports, indicating a similar process-to-file relationship as the previous relationship.   [Relationships]: <process:threat actors, interested in, file:ransomware reports>. \n4. [CoT]: The text mentions that the threat actors were interested in files concerning salary data, indicating another process-to-file relationship where the process (threat actors) performed the action 'interested in' on the file (salary data).   [Relationships]: <process:threat actors, interested in, file:salary data>. \n5. [CoT]: The text states that the C2 channel was encrypted and multiple connections were established with the internal file server, indicating a process-to-socket relationship where the process (threat actors) performed the action 'established' on the socket (internal file server).   [Relationships]: <process:threat actors, established, socket:internal file server>. \n6. [CoT]: The text mentions that the Cobalt Strike Beacon was deployed on the File Server at 17:35 UTC, indicating a process-to-process relationship where the process (threat actors) performed the action 'deployed' on the process (Cobalt Strike Beacon).   [Relationships]: <process:threat actors, deployed, process:Cobalt Strike Beacon>. \n7. [CoT]: The text states that there was a spike in traffic from the file share server to the Cobalt Strike command and control server, indicating a process-to-socket relationship where the process (file share server) performed the action 'sent traffic to' on the socket (Cobalt Strike command and control server). [Relationships]: <process:file share server, sent traffic to, socket:Cobalt Strike command and control server>. "
    }
]