[
    {
        "phase": "initial access",
        "content": "Initial delivery was via email with a link to the Bazar/Kegtap backdoor loader. We downloaded and ran Document-Preview.exe, which connected to 5.182.210[.]145 over 443/https.",
        "relationship": "1. [CoT]: The text states that the user downloaded and ran Document-Preview.exe, indicating a process-to-file relationship. [Relationships]: <process:user,downloaded and ran,file:Document-Preview.exe>. \n2. [CoT]: The text mentions that Document-Preview.exe connected to 5.182.210[.]145, indicating a process-to-socket relationship. [Relationships]: <process:Document-Preview.exe,connected to,socket:5.182.210[.]145>. "
    },
    {
        "phase": "execution",
        "content": "Service execution was used several times to execute scripts and executables during lateral movement.\nWMI was used as well in an attempt to execute dlls laterally.\nThe threat actors also performed process injection.",
        "relationship": "1. [CoT]: The text mentions that WMI was used to execute dlls, indicating a process-to-process relationship where WMI (a process) executes dll (another process).   [Relationships]: <process:WMI,execute,process:dll>. \n2. [CoT]: The text states that threat actors performed process injection, which is a process-to-process relationship where threat actors (process) perform actions on other processes.   [Relationships]: <process:threat actors,perform,process:process injection>. "
    },
    {
        "phase": "defense evasion",
        "content": "Disabling Windows Defender.",
        "relationship": "1. [CoT]: The text states that the attacker disables Windows Defender, which is a process entity, using reg. [Relationships]: <process:reg,disables,process:Windows Defender>. "
    },
    {
        "phase": "discovery",
        "content": "Day 1\nAdFind and adf.bat were dropped and run minutes after Document-Preview.exe was executed. We've seen adf.bat numerous times and you can read more about ithere. The batch file outputs information into the following text files.\nNltest was used to check for Domain trusts\nNet was used to show Domain Admins\nPing was used to test if systems were up in the environment\nBreak down of the process tree of activity from the Bazar loader on day 1.\nDay 2\nAfind was run again, and then the threat actor attempted toKerberoastusingRubeus.\nAfter a few false starts during lateral movement failures, the threat actors performed some additional local system recon.\nWMI was used to check for the current AntiVirus on numerous systems",
        "relationship": "1. [CoT]: AdFind was dropped and run after Document-Preview.exe was executed, indicating a process-to-process relationship where Document-Preview.exe drops AdFind.   [Relationships]: <process:Document-Preview.exe, drops, process:AdFind>. \n2. [CoT]: adf.bat was dropped and run after Document-Preview.exe was executed, indicating a process-to-process relationship where Document-Preview.exe drops adf.bat.   [Relationships]: <process:Document-Preview.exe, drops, process:adf.bat>. \n3. [CoT]: The batch file adf.bat outputs information into text files, indicating a process-to-file relationship where adf.bat outputs information into text files.   [Relationships]: <process:adf.bat, outputs, file:text files>. \n4. [CoT]: Nltest was used to check for Domain trusts, indicating a process-to-process relationship where the threat actor uses Nltest.   [Relationships]: <process:threat actor, uses, process:Nltest>. \n5. [CoT]: Net was used to show Domain Admins, indicating a process-to-process relationship where the threat actor uses Net.   [Relationships]: <process:threat actor, uses, process:Net>. \n6. [CoT]: Ping was used to test if systems were up in the environment, indicating a process-to-process relationship where the threat actor uses Ping.   [Relationships]: <process:threat actor, uses, process:Ping>. \n7. [CoT]: The threat actor performed local system recon using WMI, indicating a process-to-process relationship where the threat actor uses WMI.   [Relationships]: <process:threat actor, uses, process:WMI>. \n8. [CoT]: The threat actors used Rubeus to Kerberoast, indicating a process-to-process relationship where the threat actors use Rubeus.   [Relationships]: <process:threat actors, uses, process:Rubeus>. "
    },
    {
        "phase": "lateral movement",
        "content": "On day 1 the threat actors checked a domain controller for MS17-010 before continuing with more discovery. The system was not vulnerable to MS17-010\nLateral movement began around 28 hours after initial entry, using SMB to drop a Cobalt Strike Beacon on a domain controller. From there, the threat actor used WMIC to execute the beacon.\nThis payload did not appear to run successfully, as shortly after the threat actors dropped an additional payload on the beachhead host, and then executed a service on the DC, after no command and control traffic was apparent.\nThe decoded Powershell.\nFollowing this, the treat actors copied and executed a Cobalt Strike beacon executable and initiated it via a service on the domain controller.\nAt this point, C2 connections appear on the domain controller connecting tomartahzz[.]com –88.119.171[.]75 over 443/https.\nBackup systems were targeted for lateral movement using the SMB exe executed around one hour after the first lateral movement execution from the beachhead host.\nThe threat actor was having issues running beacons on numerous systems, and on at least one of the systems, they mounted the drive remotely.",
        "relationship": "1. [CoT]: The text states \"The system was not vulnerable to MS17-010,\" which implies the system was checked for vulnerability to MS17-010. [Relationships]: <process:threat actors, checked, process:MS17-010>. \n2. [CoT]: The text explicitly mentions \"using SMB to drop a Cobalt Strike Beacon,\" indicating a process-to-file relationship. [Relationships]: <process:lateral movement, used, process:SMB>. \n3. [CoT]: The text describes \"the threat actor used WMIC to execute the beacon,\" showing a process-to-process relationship. [Relationships]: <process:threat actor, used, process:WMIC>. \n4. [CoT]: The text states \"the threat actors dropped an additional payload on the beachhead host,\" indicating a process-to-file relationship. [Relationships]: <process:threat actors, dropped, file:additional payload>. \n5. [CoT]: The text mentions \"executed a service on the DC,\" showing a process-to-process relationship. [Relationships]: <process:threat actors, executed, process:service>. \n6. [CoT]: The text describes \"copied and executed a Cobalt Strike beacon executable,\" indicating a process-to-file relationship. [Relationships]: <process:threat actors, copied, file:Cobalt Strike beacon executable>. \n7. [CoT]: The text states \"initiated it via a service on the domain controller,\" showing a process-to-process relationship. [Relationships]: <process:threat actors, initiated, process:service>. \n8. [CoT]: The text explicitly mentions \"C2 connections appear on the domain controller connecting to martahzz[.]com –88.119.171[.]75 over 443/https,\" indicating a process-to-socket relationship. [Relationships]: <process:domain controller, connected to, socket:martahzz[.]com –88.119.171[.]75:443>. "
    },
    {
        "phase": "command and control",
        "content": "Bazar:\n5.182.210.145|443\nCertificate [ec:4c:07:b8:3b:6a:a0:bf:60:36:b7:f4:92:9e:83:81:0f:96:46:b0]\nNot Before2020/09/21 05:24:24 UTC\nNot After2021/09/21 05:24:24 UTC\nIssuer OrgGlobal Security\nSubject Commonexample.com\nSubject OrgGlobal Security\nPublic AlgorithmrsaEncryption\nJA3: 72a589da586844d7f0818ce684948eea\nJA3s: e35df3e00ca4ef31d42b34bebaa2f86e\nCobalt strike:\n88.119.171.75|443\nCertificate [ee:92:91:6b:7e:31:85:22:65:eb:16:11:c4:8f:0a:75:c9:05:1d:4b]\nNot Before2020/09/29 08:18:03 UTC\nNot After2021/09/29 08:18:03 UTC\nIssuer Orglol\nSubject Commonmartahzz.com\nSubject Orglol\nPublic AlgorithmrsaEncryption\nJA3 : a0e9f5d64349fb13191bc781f81f42e1\nJA3s: ae4edc6faf64d08308082ad26be60767\n107.173.58.183|443\nCertificate [e2:13:2c:a4:29:ae:f3:fa:35:1f:e1:5b:2c:25:76:57:37:5b:dc:35]\nNot Before2020/09/22 14:34:11 UTC\nNot After2021/09/22 14:34:11 UTC\nIssuer Orglol\nSubject Commonnomadfunclub.com\nSubject Orglol\nPublic AlgorithmrsaEncryption\nJA3: a0e9f5d64349fb13191bc781f81f42e1\nJA3s: ae4edc6faf64d08308082ad26be60767",
        "relationship": "1. [CoT]: The text states that Bazar is listening on the IP:Port combination 5.182.210.145:443, indicating a socket entity. [Relationships]: <process:Bazar,listen,socket:5.182.210.145:443>. \n2. [CoT]: The text mentions that Cobalt strike is connecting to the IP:Port combination 88.119.171.75:443, indicating a socket entity. [Relationships]: <process:Cobalt strike,connect,socket:88.119.171.75:443>. \n3. [CoT]: The text states that Bazar is connecting to the IP:Port combination 107.173.58.183:443, indicating a socket entity. [Relationships]: <process:Bazar,connect,socket:107.173.58.183:443>. \n4. [CoT]: The text mentions that Cobalt strike is connecting to the IP:Port combination 107.173.58.183:443, indicating a socket entity. [Relationships]: <process:Cobalt strike,connect,socket:107.173.58.183:443>. "
    },
    {
        "phase": "exfiltration",
        "content": "Domain discovery (AdFind and Rubeus outputs) exfiltrated by vsftpd to 45.141.84[.]120.",
        "relationship": "1. [CoT]: The text states that \"AdFind and Rubeus outputs exfiltrated by vsftpd to 45.141.84[.]120,\" which indicates that vsftpd is exfiltrating data to the IP address 45.141.84[.]120 via unspecified protocols. [Relationships]: <process:vsftpd,exfiltrated,socket:45.141.84[.]120>. "
    },
    {
        "phase": "impact",
        "content": "SMB was used to transfer the Ryuk executables. Then, RDP connections were made from the first compromised DC, and then, ransomware executed throughout the environment, starting with the Backup servers. On the backup server, prior to execution, the threat actors pulled up thewbadminmsc console.\nCommands ran prior to ransom execution:\nThe threat actors asked for more than $6 million but were willing to negotiate.\nEnjoy our report? Please consider donating $1 or more to the project usingPatreon. Thank you for your support!\nWe also have PCAPs, files, memory images, Kape and Redline packages availablehere.",
        "relationship": "1. [CoT]: The text states \"SMB was used to transfer the Ryuk executables,\" indicating that the SMB protocol was used to transfer the Ryuk executables file. [Relationships]: <process:SMB, used, file:Ryuk executables>. \n2. [CoT]: The text mentions \"RDP connections were made from the first compromised DC,\" showing that the system made RDP connections as processes. The domain 'compromised DC' is treated as a process entity. [Relationships]: <process:system, made, socket:RDP connections from the first compromised DC>. \n3. [CoT]: The text states \"ransomware executed throughout the environment, starting with the Backup servers,\" indicating that the ransomware process executed on the Backup servers system. [Relationships]: <process:ransomware, executed, process:Backup servers>. \n4. [CoT]: The text describes \"the threat actors pulled up thewbadminmsc console\" before execution, showing that the threat actors process interacted with thewbadminmsc console process. [Relationships]: <process:threat actors, pulled up, process:thewbadminmsc console>. "
    }
]