[
    {
        "phase": "initial access",
        "content": "During May 2023, we obtained two types of Word documents for analysis. The first type featured an external link embedded within an XML file, \"word/_rels/document.xml.rels,\" while the second type included a VBA script that executed a macro immediately upon opening the document. Notably, both files contained a strikingly similar bait image, depicted in Figure 1.\nThe Word document that targets CVE-2021-40444 contained a file \"document.xml.rels\", shown in Figure 2, with an external link using MHTML (MIME encapsulation of aggregate HTML documents). This web archive file format combines a website's HTML code and companion resources into a single file. This link also uses Cuttly, a URL shortener and link management platform, to redirect users to the cloud file-sharing website, \"GoFile.\" Further analysis revealed that a file named \"defrt.html\" was downloaded upon accessing the link. This file exploits the second vulnerability, CVE-2022-30190. The content of this file and the decoded data is displayed in Figure 3.\nUpon executing the payload, it initiates the download of an injector file named \"oehrjd.exe\" from the following URL: http[:]//pcwizard[.]net/yz/ftp/. Detailed information regarding the execution file can be found in the subsequent section.\nThe second document was discovered towards the end of May. Upon analyzing the VBA script embedded within the Word document, as illustrated in Figure 4, the code is automatically executed due to its use of the \"Auto_Open\" and \"Document_Open\" functions. Various arrays are decoded within the script and saved to a temporary folder under the name \"DD.inf\" (Figure 5). It includes a command to create an \"ema.tmp\" file to store data after line 29 in the \"DD.inf\" file. The data is then encoded using the \"ecodehex\" function and saved as \"des.jpg\". The script then uses rundll32 to load a DLL file with the function \"maintst.\" Finally, it deletes all temporary, JPG, and INF files created throughout this process.",
        "relationship": "1. [CoT]: The text states that the Word document contains an external link in \"word/_rels/document.xml.rels\" using MHTML. [Relationships]: <process:Word,contains,file:word/_rels/document.xml.rels>. \n2. [CoT]: The text mentions that accessing the external link downloads the file \"defrt.html\". [Relationships]: <process:external link,downloads,file:defrt.html>. \n3. [CoT]: The payload initiates the download of \"oehrjd.exe\" from a specified URL. [Relationships]: <process:payload,downloads,file:oehrjd.exe>. \n4. [CoT]: The VBA script automatically executes and decodes arrays to \"DD.inf\". [Relationships]: <process:VBA script,decodes,file:DD.inf>. \n5. [CoT]: The script creates \"ema.tmp\" to store data. [Relationships]: <process:VBA script,creates,file:ema.tmp>. \n6. [CoT]: The script encodes data to \"des.jpg\". [Relationships]: <process:VBA script,encodes,file:des.jpg>. \n7. [CoT]: The script uses rundll32 to load a DLL file with the function \"maintst\". [Relationships]: <process:VBA script,loads,file:rundll32>. \n8. [CoT]: The script deletes temporary, JPG, and INF files. [Relationships]: <process:VBA script,deletes,file:temporary files>. "
    },
    {
        "phase": "execution",
        "content": "As mentioned, the VBA script creates an INF file to load a DLL. The purpose of this DLL file, named \"des.jpg,\" is to download an injector from the URL \"https[:]//vertebromed[.]md/temp/dhssdf[.]exe\" for use in a later stage. It's worth noting that the download link doesn't belong to a typical file-sharing cloud platform or the attacker's command-and-control (C2) server. Instead, it leverages the website \"vertebromed.md,\" which has been active since 2018. The injector file, \"dhssdf.exe,\" was created on May 29, 2023, as shown in Figure 6. Additionally, within the same folder, we discovered another MSIL loader named \"IMG_3360_103pdf.exe,\" created on May 30, 2023. Although this file isn't directly involved in the Word document attack chain, it also loads LokiBot and connects to the same C2 IP.",
        "relationship": "1. [CoT]: The VBA script creates an INF file, indicating a process-to-file relationship where the process 'VBA script' creates the 'INF file'.   [Relationships]: <process:VBA script,creates,file:INF file>. \n2. [CoT]: The VBA script is designed to load a DLL file, showing a process-to-file relationship where the process 'VBA script' loads the 'DLL file'.   [Relationships]: <process:VBA script,loads,file:DLL file>. \n3. [CoT]: The DLL file, named \"des.jpg,\" is intended to download an injector from a specified URL, indicating a process-to-socket relationship where the process 'DLL file' downloads from the 'URL'.   [Relationships]: <process:DLL file,downloads,socket:https[:]//vertebromed[.]md/temp/dhssdf[.]exe>. \n4. [CoT]: The DLL file, named \"des.jpg,\" downloads an injector file named \"dhssdf.exe,\" showing a process-to-file relationship where the process 'DLL file' downloads the 'injector file'.   [Relationships]: <process:DLL file,downloads,file:dhssdf.exe>. \n5. [CoT]: The MSIL loader, \"IMG_3360_103pdf.exe,\" loads LokiBot, indicating a process-to-file relationship where the process 'MSIL loader' loads the 'LokiBot'.   [Relationships]: <process:IMG_3360_103pdf.exe,loads,file:LokiBot>. \n6. [CoT]: The MSIL loader, \"IMG_3360_103pdf.exe,\" connects to a C2 IP, showing a process-to-socket relationship where the process 'MSIL loader' connects to the 'C2 IP'. [Relationships]: <process:IMG_3360_103pdf.exe,connects,socket:C2 IP>. "
    },
    {
        "phase": "execution",
        "content": "In this section, we analyze the injector obtained from Follina (SHA256: 9eaf7231579ab0cb65794043affb10ae8e4ad8f79ec108b5302da2f363b77c93). The injector is written in Visual Basic (VB), and we provide an overview of its basic information in Figure 7.\nInitially, the code extracts individual letters from predetermined strings. These letters are then combined to form an API string, subsequently mapped to the corresponding functions illustrated in Figure 8.\nThe injector utilizes a hardcoded key to decrypt the payload, as shown in Figure 9. The decryption process is outlined in pseudo-code in Figure 10. The decrypted data is decompressed using the \"RtlDecompressBufferEx\" API and the parameter \"COMPRESSION_FORMAT_LZNT1\". The complete procedure through Python code and the partial payload is illustrated in Figure 11.\nThe injector incorporates various evasion techniques, including:\nChecking the \"BeingDebugged\" flag of PEB (Process Environment Block) \nUtilizing the \"NtGlobalFlag\" to determine if the process was created by a debugger \nVerifying the existence of virtual machine paths, such as \"\\VMWare\" and \"\\Oracle\\virtualbox guest additions\" \nEmploying two calls to the \"GetTickCount\" API and using Sleep() to check if the time has been accelerated \nUsing the \"FindWindowW\" function to identify the presence of specific debuggers, such as \"OllyDbg,\" \"x64dbg\", \"x32dbg\", \"WindDbg,\" \"WinDbgFrameClass,\" \"ObsidianGUI,\" \"Soft Ice,\" \"ImmDbg,\" \"Zeta Debugger,\" and \"Rock Debugger\" \nChecking the \"ProcessDebugObjectHandle\" (0x1E)\nAfter obtaining the payload and verifying the overall environment, the injector utilizes the \"VirtualAllocEx\" function to allocate memory for the subsequent execution of LokiBot.",
        "relationship": "1. [CoT]: The text states that the injector extracts individual letters from predetermined strings, indicating a process-to-file relationship where the injector process performs the action of extracting from the predetermined strings (file).   [Relationships]: <process:injector,extracts,file:predetermined strings>. \n2. [CoT]: The text mentions that the letters are combined to form an API string, showing that the injector process combines letters from the file.   [Relationships]: <process:injector,combines,file:API string>. \n3. [CoT]: The injector maps the API string to corresponding functions, indicating a process-to-file relationship where the injector process performs the action of mapping to the API string (file).   [Relationships]: <process:injector,maps,file:API string>. \n4. [CoT]: The injector uses a hardcoded key to decrypt the payload, showing a process-to-file relationship where the injector process performs the action of decrypting the payload (file).   [Relationships]: <process:injector,decrypts,file:payload>. \n5. [CoT]: The decrypted data is decompressed using the \"RtlDecompressBufferEx\" API, indicating a process-to-file relationship where the injector process performs the action of decompressing the decrypted data (file).   [Relationships]: <process:injector,decompresses,file:decrypted data>. \n6. [CoT]: The injector checks the \"BeingDebugged\" flag of PEB (Process Environment Block), showing a process-to-process relationship where the injector process performs the action of checking the PEB (process).   [Relationships]: <process:injector,checks,process:PEB (Process Environment Block)>. \n7. [CoT]: The injector utilizes the \"NtGlobalFlag\" to determine if the process was created by a debugger, indicating a process-to-process relationship where the injector process performs the action of utilizing the NtGlobalFlag (process).   [Relationships]: <process:injector,utilizes,process:NtGlobalFlag>. \n8. [CoT]: The injector verifies the existence of virtual machine paths, such as \"\\VMWare\" and \"\\Oracle\\virtualbox guest additions,\" showing a process-to-file relationship where the injector process performs the action of verifying the existence of these paths (file).   [Relationships]: <process:injector,verifies,file:\\VMWare and \\Oracle\\virtualbox guest additions>. \n9. [CoT]: The injector uses two calls to the \"GetTickCount\" API, indicating a process-to-process relationship where the injector process performs the action of using the GetTickCount API (process).   [Relationships]: <process:injector,uses,process:GetTickCount API>. \n10. [CoT]: The injector uses Sleep() to check if the time has been accelerated, showing a process-to-process relationship where the injector process performs the action of using Sleep() (process).   [Relationships]: <process:injector,uses,process:Sleep()>. \n11. [CoT]: The injector uses the \"FindWindowW\" function to identify the presence of specific debuggers, indicating a process-to-process relationship where the injector process performs the action of using the FindWindowW function (process).   [Relationships]: <process:injector,uses,process:FindWindowW function>. \n12. [CoT]: The injector checks the \"ProcessDebugObjectHandle\" (0x1E), showing a process-to-process relationship where the injector process performs the action of checking the ProcessDebugObjectHandle (process).   [Relationships]: <process:injector,checks,process:ProcessDebugObjectHandle>. \n13. [CoT]: After obtaining the payload, the injector allocates memory using the \"VirtualAllocEx\" function, indicating a process-to-file relationship where the injector process performs the action of allocating memory (file).   [Relationships]: <process:injector,allocates,file:memory>. \n14. [CoT]: The injector allocates memory for the execution of LokiBot, showing a process-to-process relationship where the injector process performs the action of allocating for LokiBot (process). [Relationships]: <process:injector,allocates,process:LokiBot>. "
    },
    {
        "phase": "collection",
        "content": "LokiBot is specifically designed to gather sensitive information from various sources, including web browsers, FTP, email, and numerous software tools installed on the compromised system. Analyzing the C2 traffic to \"95[.]164[.]23[.]2/swe/h/pin[.]php\" in Figure 13, we determined that the version is 0x0012 and the notable Binary ID is \"ckav[.]ru\". As this version of LokiBot has remained unchanged since March, we will only highlight its major components and features.\nFirst, the MD5 hash derived from the MachineGuid is in the end pcap, \"D0BECCE5760947DD9FFD80DB\". This hash serves as a mutex to ensure that multiple instances of LokiBot are not running simultaneously. It employs the \"MoveFileExW\" API to create a folder named \"%APPDATA%\\Roaming\\576094\" and a file named \"47DD9F.exe\" using a substring of the MD5 from MachineGuid. The file is marked as hidden by the \"SetFileAttributes\" function and setting the attribute to FILE_ATTRIBUTE_HIDDEN (0x2). The corresponding registry settings associated with LokiBot are depicted in Figure 14.\nThe list of targeted software names is stored in an array, and a partial list is provided in Figure 15.",
        "relationship": "1. [CoT]: The text mentions that LokiBot is designed to gather information from web browsers, indicating a process-to-process relationship where LokiBot gathers information from web browsers. [Relationships]: <process:LokiBot,gather,process:web browsers>. \n2. [CoT]: The text states that LokiBot gathers information from FTP, showing another process-to-process relationship where LokiBot gathers information from FTP. [Relationships]: <process:LokiBot,gather,process:FTP>. \n3. [CoT]: LokiBot targets email, which is stored in a process-to-process relationship. [Relationships]: <process:LokiBot,target,process:email>. \n4. [CoT]: LokiBot uses the \"MoveFileExW\" API to create a folder, indicating a process-to-file relationship where LokiBot creates a folder. [Relationships]: <process:LokiBot,create,file:%APPDATA%\\Roaming\\576094>. \n5. [CoT]: Similarly, LokiBot uses \"MoveFileExW\" to create a file, establishing another process-to-file relationship. [Relationships]: <process:LokiBot,create,file:47DD9F.exe>. \n6. [CoT]: The file 47DD9F.exe is marked as hidden using the \"SetFileAttributes\" function, showing a process-to-file relationship where LokiBot marks the file hidden. [Relationships]: <process:LokiBot,mark,file:47DD9F.exe(hidden)>. \n7. [CoT]: The MD5 hash \"D0BECCE5760947DD9FFD80DB\" is derived from the MachineGuid and used as a mutex by LokiBot, indicating a process-to-file relationship where LokiBot uses the MD5 hash as a mutex. [Relationships]: <process:LokiBot,use,file:D0BECCE5760947DD9FFD80DB>. \n8. [CoT]: The targeted software names are stored in an array by LokiBot, showing a process-to-file relationship where LokiBot stores data in an array. [Relationships]: <process:LokiBot,store,file:array of targeted software names>. "
    }
]