[
    {
        "phase": "initial access",
        "content": "The attackers penetrated the enterprise network using carefully crafted phishing emails, some of which use information that is specific to the organization under attack and is not publicly available. This could indicate that the attackers did preparatory work in advance (they may have obtained the information in earlier attacks on the same organization or its employees, or on other organizations or individuals associated with the victim organization). \nMicrosoft Word documents attached to the phishing emails contained malicious code that exploits the CVE-2017-11882 vulnerability. The vulnerability enables an attacker to execute arbitrary code (in the attacks analyzed, the main module of the PortDoor malware) without any additional user activity. \nAn earlier series of attacks in which the PortDoor malware was also used was described by Cybereason experts. A new version of PortDoor was identified in the course of our research. ",
        "relationship": "1. [CoT]: The text mentions that Microsoft Word documents contained malicious code that exploits the CVE-2017-11882 vulnerability, indicating a relationship between Microsoft Word and the vulnerability. [Relationships]: <process:Microsoft Word,contains,vulnerability:CVE-2017-11882>. \n2. [CoT]: The text states that the malicious code executes the main module of the PortDoor malware, showing a relationship between the malicious code and the PortDoor malware. [Relationships]: <process:malicious code,executes,process:PortDoor malware>. \n3. [CoT]: The text describes how the attackers used phishing emails with malicious Microsoft Word documents to penetrate the enterprise network, indicating a relationship between the attackers and the phishing emails. [Relationships]: <process:attackers,used,process:phishing emails>. \n4. [CoT]: The text mentions that the attackers used phishing emails with malicious Microsoft Word documents to penetrate the enterprise network, showing a relationship between the attackers and Microsoft Word documents. [Relationships]: <process:attackers,used,process:Microsoft Word documents>. "
    },
    {
        "phase": "command and control",
        "content": "After being launched, PortDoor collects general information on the infected system and sends it to the malware command-and-control (CnC) server. In cases where an infected system is of interest to the attackers, they use the PortDoor functionality to control the system remotely and install additional malware. ",
        "relationship": "1. [CoT]: The text states that PortDoor collects information and sends it to the CnC server, indicating a process-to-socket relationship where PortDoor is the process and CnC server is the socket.  [Relationships]: <process:PortDoor,sends,socket:malware command-and-control (CnC) server>. "
    },
    {
        "phase": "command and control",
        "content": "The attackers used five different backdoors at the same time – probably to set up redundant communication channels with infected systems in case one of the malicious programs was detected and removed by a security solution. The backdoors used provide extensive functionality for controlling infected systems and collecting confidential data. \nOf the six backdoors identified on infected systems, five (PortDoor, nccTrojan, Logtu, Cotx, and DNSep) have been used earlier in attacks attributed by other researchers to APT TA428. The sixth backdoor is new and has not been observed in other attacks. ",
        "relationship": "1. [CoT]: The text states that the attackers used five different backdoors, indicating a process-to-process relationship where the attackers (process) used (verb) the backdoors (process).   [Relationships]: <process:attackers,used,process:backdoors>. \n2. [CoT]: The text mentions that the backdoors provide functionality for controlling infected systems, indicating a process-to-process relationship where the backdoors (process) control (verb) the infected systems (process).   [Relationships]: <process:backdoors,control,process:infected systems>. \n3. [CoT]: The text states that the backdoors collect confidential data, indicating a process-to-file relationship where the backdoors (process) collect (verb) confidential data (file).   [Relationships]: <process:backdoors,collect,file:confidential data>. \n4. [CoT]: The text mentions that the backdoors have been used in attacks attributed to APT TA428, indicating a process-to-process relationship where APT TA428 (process) used (verb) the backdoors (process).   [Relationships]: <process:APT TA428,used,process:backdoors>. \n5. [CoT]: The text describes a new backdoor that has not been observed in other attacks, indicating a process-to-process relationship where other attacks (process) used (verb) the new backdoor (process). [Relationships]: <process:other attacks,used,process:new backdoor>. "
    },
    {
        "phase": "lateral movement",
        "content": "After gaining a foothold on the initial system, the attackers attempt to spread the malware to other computers on the enterprise network. To gain access to those computers, the attackers use network scanning results, as well as user credentials stolen earlier. \nThe Ladon hacking utility (which is popular in China) is used as the main lateral movement tool. It combines network scanning, vulnerability search and exploitation, password attack, and other functionality. The attackers also extensively use standard utilities that are part of the Microsoft Windows operating system. \nThe attack's final stage involves hijacking the domain controller and gaining full control of all of the organization's workstations and servers. \nThe attackers used DLL hijacking and process hollowing techniques extensively in the attack to prevent security software from detecting the malware. ",
        "relationship": "1. [CoT]: The text mentions that the Ladon hacking utility is used for network scanning, indicating a process-to-socket relationship where the process performs scanning actions on the network. [Relationships]: <process:Ladon hacking utility,scanning,socket:network>. \n2. [CoT]: The text states that Ladon combines vulnerability search and exploitation, showing a process-to-process relationship where the process performs exploitation actions on vulnerabilities. [Relationships]: <process:Ladon hacking utility,exploitation,process:vulnerability>. \n3. [CoT]: The attackers use standard utilities that are part of the Microsoft Windows operating system, indicating a process-to-process relationship where the attackers use these utilities for their actions. [Relationships]: <process:attackers,use,process:standard utilities>. \n4. [CoT]: The text describes the attackers' goal of hijacking the domain controller, showing a process-to-process relationship where the attackers attempt to hijack this important system. [Relationships]: <process:attackers,hijacking,process:domain controller>. \n5. [CoT]: The attackers use password attack techniques, indicating a process-to-process relationship where the attackers perform attacks on password-related entities. [Relationships]: <process:attackers,attack,process:password>. "
    },
    {
        "phase": "exfiltration",
        "content": "After gaining domain administrator privileges, the attackers searched for and exfiltrated documents and other files that contained the attacked organization's sensitive data to their servers hosted in different countries. These servers were also used as stage one CnC servers. \nThe attackers compressed stolen files into encrypted and password-protected ZIP archives. After receiving the data collected, the stage one CnC servers forwarded the archives received to a stage two server located in China. ",
        "relationship": "1. [CoT]: The text states that the attackers searched for files containing sensitive data, indicating a process (attackers) interacting with files (documents and other files). [Relationships]: <process:attackers,searched for,file:documents and other files>. \n2. [CoT]: The attackers exfiltrated files to their servers, showing a process (attackers) sending files (documents and other files) to a socket (their servers). [Relationships]: <process:attackers,exfiltrated,file:documents and other files>. \n3. [CoT]: The stage one CnC servers forwarded ZIP archives received from the attackers, indicating a process (stage one CnC servers) receiving files (ZIP archives) and forwarding them to another server (stage two server). [Relationships]: <process:stage one CnC servers,forwarded,file:ZIP archives>. "
    }
]