[
    {
        "phase": "initial access",
        "content": "These attacks were already well underway when another group began to deploy a previously unknown piece of malware. In October 2014, the Seaduke payload began to appear within target networks. Although Seaduke was developed in Python, the overall framework bears a striking resemblance to Cozyduke in terms of operation.  It's unclear why the attackers waited until October to deploy Seaduke. Was it reserved for a more specific attack? Was part of their cover blown, necessitating the use of an alternative framework?\nThe Seaduke framework was designed to be highly configurable. Hundreds of reconfigurations were identified on compromised networks. The communication protocol employed had many layers of encryption and obfuscation, using over 200 compromised web servers for command and control. Seaduke required a significant investment of time and resources in the preparatory and operational phases of the attack.",
        "relationship": "1. [CoT]: The text states that the Seaduke payload began to appear within target networks, indicating that the payload (a file entity) was deployed by the attackers (process entities).   [Relationships]: <process:attackers,deploy,file:Seaduke payload>. \n2. [CoT]: The text mentions that the communication protocol used over 200 compromised web servers for command and control, showing that Seaduke (a process entity) communicated with the compromised web servers (socket entities) for control.   [Relationships]: <process:Seaduke,communicate with,socket:compromised web servers>. "
    },
    {
        "phase": "execution",
        "content": "The attackers control Cozyduke via compromised websites, issuing instructions to infected machines by uploading \"tasks\" to a database file. Cozyduke will periodically contact these websites to retrieve task information to be executed on the local machine.  One such task (an encoded PowerShell script) instructed Cozyduke to download and execute Seaduke from a compromised website.",
        "relationship": "1. [CoT]: The text states that Cozyduke periodically contacts compromised websites to retrieve task information, indicating a process-to-socket relationship where 'contact' is the verb. [Relationships]: <process:Cozyduke,contact,socket:compromised websites>. \n2. [CoT]: The text mentions that attackers upload tasks to a database file, showing a process-to-file relationship with 'upload' as the verb. [Relationships]: <process:attackers,upload,file:database file>. \n3. [CoT]: Cozyduke downloads an encoded PowerShell script from a compromised website, establishing a process-to-socket relationship with 'download' as the verb. [Relationships]: <process:Cozyduke,download,socket:compromised website>. \n4. [CoT]: Cozyduke executes Seaduke, indicating a process-to-process relationship with 'execute' as the verb. [Relationships]: <process:Cozyduke,execute,process:Seaduke>. "
    },
    {
        "phase": "command and control",
        "content": "The attackers can operate Seaduke in a broadly similar fashion to Cozyduke. The Seaduke control infrastructure is essentially distinct, opening up the possibility of sub-teams concurrently exploiting the target network. Unlike Cozyduke, Seaduke operators upload \"task\" files directly to the command-and-control (C&C) server; there is no database as such present. Seaduke securely communicates with the C&C server over HTTP/HTTPS beneath layers of encoding (Base64) and encryption (RC4, AES). To an untrained eye, the communications look fairly benign, no doubt an effort to stay under the radar on compromised networks.\nSeaduke has many inbuilt commands which are available to the attackers. They have the ability to retrieve detailed bot/system information, update bot configuration, upload files, download files, and self-delete the malware from the system. The self-delete function is interestingly called \"seppuku\". This is a form of Japanese ritual suicide.",
        "relationship": "1. [CoT]: The text mentions that Seaduke securely communicates with the C&C server over HTTP/HTTPS, indicating a process-to-socket relationship where Seaduke (process) communicates with the C&C server (socket).   [Relationships]: <process:Seaduke,communicates with,socket:C&C server>. \n2. [CoT]: The text states that Seaduke operators upload \"task\" files to the C&C server, indicating a process-to-file relationship where Seaduke (process) uploads task files (file).   [Relationships]: <process:Seaduke,uploads,file:task files>. \n3. [CoT]: The text mentions that Seaduke has the ability to download files, indicating a process-to-file relationship where Seaduke (process) downloads files (file).   [Relationships]: <process:Seaduke,downloads,file:files>. \n4. [CoT]: The text mentions that Seaduke has the ability to upload files, indicating a process-to-file relationship where Seaduke (process) uploads files (file).   [Relationships]: <process:Seaduke,uploads,file:files>. \n5. [CoT]: The text mentions that Seaduke has a self-delete function called \"seppuku,\" indicating a process-to-process relationship where Seaduke (process) deletes itself (process Seaduke). [Relationships]: <process:Seaduke,deletes,process:Seaduke>. "
    },
    {
        "phase": "impact",
        "content": "The attackers have also developed a number of additional payloads. Operators can push these payloads onto infected machines for very specific attacks.\nImpersonation using Kerberos pass-the-ticket attacks (Mimikatz PowerShell)\nEmail extraction from the MS Exchange Server using compromised credentials\nArchiving sensitive information\nData exfiltration via legitimate cloud services\nSecure file deletion",
        "relationship": "1. [CoT]: The text mentions that operators can push payloads onto infected machines, indicating a process-to-process relationship where the operators (process) push payloads (process).   [Relationships]: <process:operators,push,process:payloads>. \n2. [CoT]: The text describes impersonation attacks using Kerberos pass-the-ticket, implying a process-to-process relationship where the attackers (process) use Mimikatz (process).   [Relationships]: <process:attackers,use,process:Mimikatz PowerShell>. \n3. [CoT]: The text states that operators can push payloads for very specific attacks, indicating a process-to-process relationship where the operators (process) push payloads (process).   [Relationships]: <process:operators,push,process:payloads>. \n4. [CoT]: The text mentions email extraction from the MS Exchange Server, implying a process-to-process relationship where the attackers (process) extract (verb) email (process:MS Exchange Server).   [Relationships]: <process:attackers,extract,process:MS Exchange Server>. \n5. [CoT]: The text describes archiving sensitive information, indicating a process-to-file relationship where the attackers (process) archive (verb) sensitive information (file).   [Relationships]: <process:attackers,archive,file:sensitive information>. \n6. [CoT]: The text mentions data exfiltration via legitimate cloud services, implying a process-to-socket relationship where the attackers (process) exfiltrate (verb) data (process:legitimate cloud services). [Relationships]: <process:attackers,exfiltrate,process:legitimate cloud services>. \n7. [CoT]: The text describes secure file deletion, indicating a process-to-file relationship where the attackers (process) delete (verb) files (file). [Relationships]: <process:attackers,delete,file:files>. "
    }
]