[
    {
        "phase": "initial access",
        "content": "After connecting to the C&C server, we downloaded the Waterbear RAT (A) in memory, which contains several command codes inside (see Table 1 for the list of RAT commands). In this case, the Waterbear RAT (A) was only used to download the Waterbear plugin via RAT command 1010 and activate the first export function, \"Start\", in the plugin to inject the chosen process. \nThe Waterbear plugin contains Waterbear downloader versions 0.27 and 0.28, both unencrypted, varying based on the process's bit version. If the process is 32-bit, version 0.27 of the Waterbear downloader will run. On the other hand, version 0.28 will execute to facilitate further downloads on the 64-bit process.Waterbear downloader versions 0.27 and 0.28 are the latest that we know of. Their behaviors are the same as the versions before 2020. \nIn this case, the Waterbear plugin injects into a 64-bit process, which results in version 0.28 of the Waterbear downloader trying to connect to the new C&C IP address - which is assigned by Waterbear RAT (A)  -  and download Waterbear RAT (B), which is almost the same as the previous one, just with a different RSA key inside. \nWaterbear RAT (B) will be used to collect the information from the infected machine, including the list of drives and files, and then further spread the Waterbear downloader to other machines. Interestingly, Earth Hundun will replace the C&C string with an internal IP address after downloading the new stage of the RAT or downloader. This is to erase activity traces or connect to other C&C servers in the victim's environment, showing that the threat actor can arbitrarily choose its connection targets.",
        "relationship": "1. [CoT]: The text states that the Waterbear RAT (A) was used to download the Waterbear plugin via RAT command 1010.   [Relationships]: <process:Waterbear RAT (A),download,process:Waterbear plugin>. \n2. [CoT]: The Waterbear plugin is mentioned to inject into a 64-bit process, which is the subject of the sentence.   [Relationships]: <process:Waterbear plugin,inject into,process:64-bit process>. \n3. [CoT]: The text describes that version 0.28 of the Waterbear downloader tries to connect to a new C&C IP address assigned by Waterbear RAT (A).   [Relationships]: <process:Waterbear downloader,connect to,socket:new C&C IP address>. \n4. [CoT]: Waterbear RAT (B) is mentioned to collect information from the infected machine, including the list of drives and files.   [Relationships]: <process:Waterbear RAT (B),collect,files:list of drives and files>. \n5. [CoT]: The threat actor is mentioned to arbitrarily choose its connection targets, which includes other C&C servers.   [Relationships]: <process:threat actor,choose,socket:other C&C servers>. "
    },
    {
        "phase": "command and control",
        "content": "Since discussing Waterbear's functions in our previous blog entry, there have been more that have been implemented, with the latest version shown in the following table:\nTable 1. List of Waterbear RAT commands\nBefore receiving the backdoor command, the RAT sends the victim's information to the C&C server via command code 8002:\nTable 2. The structure of victim information that Waterbear sends to the C&C server\nThis section will explain Earth Hundun's use of Deuterbear and provide a comprehensive analysis of the Deuterbear RAT.",
        "relationship": "1. [CoT]: The text states that the RAT (Waterbear) sends victim information to the C&C server via command code 8002, indicating a process-to-socket relationship where the RAT process sends information to the C.C server socket.   [Relationships]: <process:Waterbear,RAT,sends,socket:C&C server via command code 8002>. \n2. [CoT]: The text describes Deuterbear as a RAT (Reverse Shell) that can execute commands, indicating a process-to-process relationship where Deuterbear executes commands on the system.   [Relationships]: <process:Deuterbear,RAT,executes,process:commands>. "
    },
    {
        "phase": "execution",
        "content": "The installation pathway of Deuterbear is depicted in Figure 3. Note that it is similar to Waterbear, which implements two stages to install the backdoor.\nIn the first stage, the loader employs a basic XOR calculation to decrypt the downloader, facilitating the retrieval of the first stage RAT from the C&C server. Subsequently, the threat actor applies the first stage RAT to survey the victim's system and identify an appropriate folder for persistence. This is where the second-stage Deuterbear components will be installed, including the loader with CryptUnprotectData decryption, the encrypted downloader, and associated registries (the decryption flow was discussed in the previous blog entry).\nIn most of the infected systems, only the second stage Deuterbear is available. Our monitoring indicates that all components of the first stage Deuterbear are totally removed after the \"persistence installation\" is completed. It seems that Earth Hundun prefers to keep the loaders using CryptUnprotectData decryption, even in cases where the successful installation of Deuterbear is achieved during the first stage. This strategy effectively protects their tracks and prevents the malware from easily being analyzed by threat researchers, particularly in simulated environments rather than real victim systems.",
        "relationship": "1. [CoT]: The text mentions that the loader decrypts the downloader using a basic XOR calculation, indicating a process-to-file relationship where the loader decrypts the downloader file.   [Relationships]: <process:loader,decrypt,file:downloader>. \n2. [CoT]: The threat actor uses the first stage RAT to survey the victim's system, showing a process-to-process relationship where the first stage RAT is used by the threat actor.   [Relationships]: <process:threat actor,use,process:first stage RAT>. \n3. [CoT]: The first stage RAT identifies an appropriate folder for persistence, indicating a process-to-file relationship where the RAT identifies a folder.   [Relationships]: <process:first stage RAT,identify,file:appropriate folder>. \n4. [CoT]: The second-stage Deuterbear components, including the loader, are installed in the identified folder, showing a process-to-file relationship where the threat actor installs files.   [Relationships]: <process:threat actor,install,file:loader>. \n5. [CoT]: The encrypted downloader is also installed as part of the second-stage Deuterbear components, another process-to-file relationship where the threat actor installs the encrypted downloader file.   [Relationships]: <process:threat actor,install,file:encrypted downloader>. \n6. [CoT]: Associated registries are also mentioned as being installed, indicating a process-to-registry relationship where the threat actor installs registries.   [Relationships]: <process:threat actor,install,reg:registries>. "
    },
    {
        "phase": "command and control",
        "content": "The Deuterbear RAT directly inherits several components from the downloader, including:\nAll anti-analysis techniques (please refer to our previous report for more details). \nHTTPS tunnel. \nRoutine to receive and send traffic. \nRC4 key to decrypt and encrypt traffic. \nRoutine to decrypt and encrypt the desired function. \nKey to decrypt and encrypt the desired function.\nDue to having the same HTTPS channel and RC4 traffic key, Deuterbear RAT doesn't require a handshake with the C&C server to update communication protocols. This enables the threat actor to seamlessly control the client, regardless of whether the process is in the downloader or RAT status. Prior to executing backdoor commands, the Deuterbear RAT transmits victim information to the C&C server via RAT command 975 with the structure (Table 3) highly reminiscent of the Waterbear RAT (Table 2).\nTable 3. The structure of victim information that Deuterbear sends to the C&C server",
        "relationship": "1. [CoT]: The text states that the Deuterbear RAT inherits an HTTPS tunnel from the downloader, indicating a process-to-socket relationship where the RAT process inherits the HTTPS tunnel component. [Relationships]: <process:Deuterbear RAT, inherits, socket:HTTPS tunnel>. \n2. [CoT]: The text mentions that the Deuterbear RAT receives traffic, indicating a process-to-socket relationship where the RAT process receives traffic from an unspecified source. [Relationships]: <process:Deuterbear RAT, receives, socket:traffic>. \n3. [CoT]: The text mentions that the Deuterbear RAT sends traffic, indicating a process-to-socket relationship where the RAT process sends traffic to an unspecified destination. [Relationships]: <process:Deuterbear RAT, sends, socket:traffic>. \n4. [CoT]: The text states that the Deuterbear RAT has an RC4 traffic key, indicating a process-to-socket relationship where the RAT process uses the RC4 key for encrypting/decrypting traffic. [Relationships]: <process:Deuterbear RAT, uses, socket:RC4 traffic key>. \n5. [CoT]: The text mentions that the Deuterbear RAT decrypts and encrypts the desired function, indicating a process-to-file relationship where the RAT process decrypts/encrypts the desired function file. [Relationships]: <process:Deuterbear RAT, decrypts/encrypts, file:desired function>. \n6. [CoT]: The text states that the Deuterbear RAT transmits victim information to the C&C server via RAT command 975, indicating a process-to-socket relationship where the RAT process transmits data to the C&C server socket. [Relationships]: <process:Deuterbear RAT, transmits, socket:victim information to C&C server>. "
    },
    {
        "phase": "command and control",
        "content": "Comparing Deuterbear with Waterbear reveals several functionalities directly replicated from the Waterbear RAT, such as process management, file management, and remote shell capabilities.\nAlthough Deuterbear streamlines its capabilities, retaining only 20 RAT commands (Table 4) compared to over 60 for Waterbear (Table 1), the Deuterbear RAT accepts more plugins to enhance flexibility and accommodate additional functionalities, including two shellcodes and a portable executable (PE) DLL via RAT command 979. After installing the plugins, the threat actor sends the next traffic to determine which plugin is launched. There are three kinds of protocols:\nExecute the first shellcode and the first export function of PE(DLL) \nExecute the second shellcode and the first export function of PE(DLL) \nOnly execute the first export function of PE(DLL)\nTable 4. List of Deuterbear RAT commands\nExamples of similarities in backdoor commands between Waterbear and Deuterbear are shown in the images from Figure 4 to Figure 6.",
        "relationship": "1. [CoT]: The text mentions that Deuterbear retains process management capabilities from Waterbear RAT, indicating a relationship where Deuterbear performs actions on processes.   [Relationships]: <process:Deuterbear,perform,process:>. \n2. [CoT]: The text states that Deuterbear has file management functionalities similar to Waterbear RAT, showing a relationship where Deuterbear interacts with files.   [Relationships]: <process:Deuterbear,perform,file:>. \n3. [CoT]: The text describes remote shell capabilities being retained in Deuterbear, indicating a relationship where Deuterbear establishes remote connections.   [Relationships]: <process:Deuterbear,perform,socket:>. \n4. [CoT]: The text mentions that Deuterbear accepts plugins, specifically a portable executable (PE) DLL, via RAT command 979, showing a relationship where Deuterbear receives the PE DLL.   [Relationships]: <process:Deuterbear,accept,file:PE DLL>. \n5. [CoT]: The text states that the threat actor sends traffic to determine which plugin is launched after installation, indicating a relationship where the threat actor sends data to the Deuterbear process.   [Relationships]: <process:threat actor,send,process:Deuterbear>. \n6. [CoT]: The text describes executing the first shellcode and the first export function of the PE(DLL) as one of the protocols, showing a relationship where Deuterbear executes the shellcode and DLL functions.   [Relationships]: <process:Deuterbear,execute,file:first shellcode>. \n7. [CoT]: Similar to the previous relationship, the text mentions executing the second shellcode and its corresponding DLL function, indicating a relationship where Deuterbear executes these files.   [Relationships]: <process:Deuterbear,execute,file:second shellcode>. \n8. [CoT]: The text describes executing the first export function of the PE(DLL) as another protocol, showing a relationship where Deuterbear executes functions from the DLL.   [Relationships]: <process:Deuterbear,execute,file:first export function of PE(DLL)>. "
    }
]