[
    {
        "phase": "initial access",
        "content": "The campaign involves a two-step attack. During the first phase, an email without a malicious payload containing content copied from a legitimate Pakistani newspaper's article is sent to the target. The sender address, which is spoofed, impersonates the PR wing of the Pakistani Armed Forces (info@ispr.gov.pk).\nTwo days later, a second email - purportedly a warning from a Pakistani military about the Pegasus spyware - containing a cutt.ly link to a malicious encrypted Word document and the password for decryption will be sent to the target. The sender address impersonates a service similar to that on the first email (alert@ispr.gov.pk).\nIf the target clicks on either the link or on the \"unsubscribe\" link, it will download a Word document from the domain parinari[.]xyz.\nThe emails are sent either from an ExpressVPN exit node in Pakistan, or from a mail server under the attacker's control.",
        "relationship": "1. [CoT]: The text states that the sender address is spoofed and impersonates 'info@ispr.gov.pk', indicating that the socket entity is likely 'info@ispr.gov.pk'. The verb 'send' is used to describe the action of sending the email. [Relationships]: <process:threat actor, send, socket:info@ispr.gov.pk, ,email>. \n2. [CoT]: The text mentions that the sender address impersonates a similar service, which is implie"
    },
    {
        "phase": "initial access",
        "content": "After entering the password mentioned in the message, a document containing macros is displayed on screen.\nIf the victim enables macros, the malicious code will be loaded. If the victim enters any phone number and clicks \"SUBMIT,\" the text field will be replaced by the message \"Phone Number Not Found.\"\nBehind the scenes, a .NET DLL file named skfk.txt, which is filled with content found inside the \"Comments\" property of the document, is created in the temporary directory. The file is then loaded in memory via PowerShell.\nStage 1 is a simple download & execute program. It downloads an ASCII file from the same domain and converts it into binary before loading it on to the memory and jump to a dynamic function.\nStage 2 is also .NET DLL file that downloads a third file from parinari[.]xyz, converts it from ASCII to binary, and then creates a scheduled task to load it.\nStage 3 is similar to stage 1, with the only change being the URL to retrieve the next stage.\nStage 4 is the final payload (analyzed in the next section). it is never written in clear text to the file disk.\nIt should be noted that most of the compilation timestamps of these DLL files have been modified by the attacker to a year in the far future (2060, 2099 ...), and the server IP addresses are often hidden behind CloudFlare.",
        "relationship": "1. [CoT]: The text mentions that \"a document containing macros is displayed on screen,\" indicating that the PowerShell process displays the document. [Relationships]: <process:PowerShell,displays,file:document containing macros>. \n2. [CoT]: The text states that if the victim enables macros, the malicious code will be loaded. [Relationships]: <process:victim,enables,file:malicious code>. \n3. [CoT]: The text describes that the victim enters a phone number and clicks \"SUBMIT,\" which is an action performed by the victim's process. [Relationships]: <process:victim,enters,socket:phone number>. \n4. [CoT]: The text mentions that the text field is replaced by the message \"Phone Number Not Found,\" indicating an action by the process. [Relationships]: <process:victim,replaces,file:Phone Number Not Found>. \n5. [CoT]: The text states that a .NET DLL file named skfk.txt is created in the temporary directory. [Relationships]: <process:unknown,creates,file:.NET DLL file named skfk.txt>. \n6. [CoT]: The text describes that the file is loaded in memory via PowerShell. [Relationships]: <process:PowerShell,loads,file:.NET DLL file named skfk.txt>. \n7. [CoT]: The text mentions that Stage 1 downloads an ASCII file from the same domain. [Relationships]: <process:Stage 1,downloads,file:ASCII file>. \n8. [CoT]: The text states that the ASCII file is converted into binary before being loaded onto memory. [Relationships]: <process:Stage 1,converts,file:ASCII file>. \n9. [CoT]: The text describes that the binary file is loaded on to the memory. [Relationships]: <process:Stage 1,loads,file:binary file>. \n10. [CoT]: The text mentions that Stage 2 downloads a third file from parinari[.]xyz. [Relationships]: <process:Stage 2,downloads,file:third file>. \n11. [CoT]: The text states that the third file is converted from ASCII to binary. [Relationships]: <process:Stage 2,converts,file:third file>. \n12. [CoT]: The text describes that a scheduled task is created to load the third file. [Relationships]: <process:Stage 2,creates,file:scheduled task>. \n13. [CoT]: The text mentions that Stage 3 retrieves the next stage from a URL. [Relationships]: <process:Stage 3,retrieves,file:next stage>. \n14. [CoT]: The text states that Stage 4 is the final payload and is never written in clear text to the file disk. [Relationships]: <process:Stage 4,writes,file:final payload>. "
    },
    {
        "phase": "collection",
        "content": "The final payload is a .NET DLL file designed to steal documents and images with the following extensions:\nThe \"Documents,\" \"Downloads,\" \"Desktop,\" and \"Pictures\" folders of every user are checked. The DLL file also examines drives other than C:.\nWhen a file matching one of the listed extensions is found, its MD5 hash is calculated and compared to an exclusion list retrieved from the command-and-control (C&C) server pirnaram[.]xyz.\nIf the hash is not listed, the file is sent via the C&C to a directory named after the concatenation of the machine name and the username. The exclusion list is different for every machine name-username string.",
        "relationship": "1. [CoT]: The text states that the DLL file examines drives other than C:, indicating a process-to-file relationship where the DLL file (process) examines other drives (file).   [Relationships]: <process:DLL file, examines, file:drives other than C:.>. \n2. [CoT]: The text mentions that the DLL file checks the \"Documents,\" \"Downloads,\" \"Desktop,\" and \"Pictures\" folders of every user, showing a process-to-file relationship where the DLL file (process) checks these folders (files).   [Relationships]: <process:DLL file, checks, file:Documents,Downloads,Desktop,Pictures folders>. \n3. [CoT]: The text describes that if a file with a matching extension is found, its MD5 hash is calculated, indicating a process-to-file relationship where the DLL file (process) calculates the MD5 hash of the file (file).   [Relationships]: <process:DLL file, calculates, file:MD5 hash>. \n4. [CoT]: The text states that the file's MD5 hash is compared to an exclusion list retrieved from the C&C server pirnaram[.]xyz, showing a process-to-socket relationship where the DLL file (process) compares the hash to the exclusion list (socket).   [Relationships]: <process:DLL file, compares, socket:C&C server pirnaram[.]xyz>. \n5. [CoT]: If the hash is not listed, the file is sent via the C&C to a directory named after the concatenation of the machine name and the username, indicating a process-to-file relationship where the DLL file (process) sends the file (file).   [Relationships]: <process:DLL file, sends, file:directory>. "
    }
]