[
    {
        "phase": "initial access",
        "content": "The \"njRAT\" is a robust remote access trojan that once it reaches and infects the end-point, allows the attacker to have full control over the Victim system. With this access, the attacker can start scanning other systems in the victim network to perform lateral movement. \nWe will start this section by performing analysis on the following \"njRAT\" sample: \nFilename: Authorization.exe MD5: 1d3baedd747f6f9bf92c81eb9f63b34b \nThe \"Authorization.exe\" njRAT malware was embedded and dropped in the victim system by the following file: \"Authorization form may - 2013 - 115444.scr\" (MD5:   \n63781fe1932e612c6c29225d25515111). \nThe next section (Indicators & Mitigation Strategies), will provide information about other variants of the malware obtained. ",
        "relationship": "1. [CoT]: The text states that \"Authorization.exe\" was dropped by \"Authorization form may - 2013 - 115444.scr\", indicating a process-to-file relationship where the first process drops the second process.   [Relationships]: <process:Authorization form may - 2013 - 115444.scr, drops, process:Authorization.exe>. "
    },
    {
        "phase": "execution",
        "content": "The \"Authorization.exe\" malware sample was created with version V.0.5 of this RAT. The njRAT application was developed with VB.NET (Visual Basic .NET). The \"Authorization.exe\" malware has keylogger functionality. It stores the logged keystrokes in the following file: \"[CWD]\\.tmp\". When the malware is dropped by the \"Authorization form may - 2013 - 115444.scr\" carrier file, the logged keystrokes are stored in: \"C:\\Extracted\\.tmp\". \nThe IP address used by the Command & Control (C2) node appears to be under an IP range owned by: \"Palestinian Internet Services, P. O. BOX 5111 Gaza City, Palestine\". \nVariants of this malware have been observed by the community since at least 2012. The malware appears to be known by the community as: njRAT, MSIL/Bladabindi, and Backdoor.LV. \nWhen the \"Authorization.exe\" malware is executed it: \nCreates a copy of itself in the following locations:   \n%APPDATA%\\msnco.exe   \nC:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe \nTries to open the following file: [CWD]\\ Authorization.exe.config \nEntrenches in the system for persistence in the following registry locations: \nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Ru n\\b6554e5bcfef391ff7a7ffda58092e10   \nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\R un\\b6554e5bcfef391ff7a7ffda58092e10 \nMakes the following modifications to the registry to bypass the Windows Firewall: \nKey: HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe   \nValue: [%APPDATA%]\\msnco.exe:\\*:Enabled:msnco.exe \nBeacons to the following C2 node over TCP port 1177: \"217.66.231.245\" \nThe attacker tries to make sure the malware will run in the system by making the second copy into the above mentioned directory (C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe) \nThis causes the malware to execute again when the system is rebooted and re-starts the infection in the system. Once the system is infected again, it will beacon to the C2 node. \nThe attacker tries to trick the user by using different icons for the malware. Various samples were observed with MS Word and PDF icons. The following is a screenshot of how the file will look like to a normal user: \nWhen the system is configured to show file extensions, the EXE extension is now revealed:",
        "relationship": "1. [CoT]: The text states that the \"Authorization.exe\" malware was created with a specific version of the RAT, indicating the developer's tool created the file. [Relationships]: <process:Authorization.exe,was created with,process:RAT>. \n2. [CoT]: The njRAT application was developed with VB.NET, making it the development tool that created the file. [Relationships]: <process:njRAT,was developed with,process:VB.NET>. \n3. [CoT]: The \"Authorization.exe\" malware stores logged keystrokes in a specific file, .tmp, within the [CWD] directory. [Relationships]: <process:Authorization.exe,stores,file:[CWD]\\.tmp>. \n4. [CoT]: When dropped by the carrier file, the malware stores keystrokes in a specific file path. [Relationships]: <process:Authorization.exe,stores,file:C:\\Extracted\\.tmp>. \n5. [CoT]: The malware uses an IP address belonging to a specific IP range owned by Palestinian Internet Services. [Relationships]: <process:Authorization.exe,uses,socket:IP range owned by Palestinian Internet Services>. \n6. [CoT]: The malware is known by various names in the community, including njRAT. [Relationships]: <process:community,knowns,process:njRAT>. \n7. [CoT]: The malware is known by various names in the community, including MSIL/Bladabindi. [Relationships]: <process:community,knowns,process:MSIL/Bladabindi>. \n8. [CoT]: The malware is known by various names in the community, including Backdoor.LV. [Relationships]: <process:community,knowns,process:Backdoor.LV>. \n9. [CoT]: The malware creates a copy of itself in a specific file path. [Relationships]: <process:Authorization.exe,creates,file:%APPDATA%\\msnco.exe>. \n10. [CoT]: The malware creates a copy of itself in a specific file path. [Relationships]: <process:Authorization.exe,creates,file:C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe>. \n11. [CoT]: The malware tries to open a specific file. [Relationships]: <process:Authorization.exe,tries to open,file:[CWD]\\ Authorization.exe.config>. \n12. [CoT]: The malware entrenches in the system for persistence by modifying registry keys. [Relationships]: <process:Authorization.exe,entrenches,reg:HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Ru n\\b6554e5bcfef391ff7a7ffda58092e10>. \n13. [CoT]: The malware entrenches in the system for persistence by modifying registry keys. [Relationships]: <process:Authorization.exe,entrenches,reg:HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\R un\\b6554e5bcfef391ff7a7ffda58092e10>. \n14. [CoT]: The malware makes modifications to the registry to bypass the Windows Firewall. [Relationships]: <process:Authorization.exe,makes,reg:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe>. \n15. [CoT]: The malware makes modifications to the registry to bypass the Windows Firewall. [Relationships]: <process:msnco.exe,modifies,reg:HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe>. \n16. [CoT]: The malware beacons to a specific C2 node and port combination. [Relationships]: <process:Authorization.exe,beacons,socket:217.66.231.245:1177>. \n17. [CoT]: The attacker makes a copy of the malware in a specific directory to ensure persistence. [Relationships]: <process:attacker,tries to make sure,process:Authorization.exe>. \n18. [CoT]: The attacker makes a copy of the malware in a specific directory to ensure persistence. [Relationships]: <process:attacker,tries to make sure,file:C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe>. \n19. [CoT]: The malware executes again when the system is rebooted, restarting the infection. [Relationships]: <process:Authorization.exe,executes,process:"
    },
    {
        "phase": "exfiltration",
        "content": "When the malware connects to the C2 node, it will send information about the victim system, malware version, open windows, etc. The following is the network traffic observed: \nThe following table provides information of some of the fields observed in the network traffic: \nInformation sent by the attacker on opened windows in the system could inform him/her of his malware being analyzed and allowed to connect to the C2 node. For example, if Wireshark, Filemon, Regmon, and IDA are opened in the system when the analyst executes the malware, this will quickly let the attacker know that someone is performing reverse engineering of his malicious code.\nThe following WHOIS information was found related to the C2 node (21+7.16860.02.3615.22.4405).",
        "relationship": "1. [CoT]: The text states that the malware connects to the C2 node (21+7.16860.02.3615.22.4405) to send information about the victim system, which is a process-to-socket relationship. [Relationships]: <process:malware,connect,socket:21+7.16860.02.3615.22.4405>. \n2. [CoT]: The text mentions that the attacker can observe open windows in the system via network traffic, indicating a process-to-socket relationship where the attacker passes information about open windows to the attacker via the network. [Relationships]: <process:attacker,send,process:opened windows>. \n3. [CoT]: The text lists tools like Wireshark, Filemon, Regmon, and IDA that might be opened in the system during analysis, showing a process-to-process relationship where the analyst executes the malware. [Relationships]: <process:analyst,executes,process:malware>. "
    },
    {
        "phase": "command and control",
        "content": "The  \"Authorization.exe\" variant in this report appears to have been available at some point through the following URL: \"hxxp://bongdacongdong.vn/authorization.exe\". The domain currently resolves to the following IP address: \"112.213.89.144\", but at some point, the domain was associated with the following IP address: \"31.170.165.90\". \nThe following information was found at Virustotal for \"31.170.165.90\": ",
        "relationship": "1. [CoT]: The text mentions that the domain \"bongdacongdong.vn\" resolved to the IP address \"31.170.165.90\" at some point, indicating a relationship between the domain and the IP address.   [Relationships]: <process:bongdacongdong.vn, resolves to, socket:31.170.165.90>. \n2. [CoT]: The text states that the domain \"bongdacongdong.vn\" was associated with the IP address \"31.170.165.90\" at some point, indicating a relationship between the domain and the IP address.   [Relationships]: <process:bongdacongdong.vn, associated with, socket:31.170.165.90>. \n3. [CoT]: The text mentions that the domain \"bongdacongdong.vn\" currently resolves to the IP address \"112.213.89.144\", indicating a relationship between the domain and the IP address.   [Relationships]: <process:bongdacongdong.vn, resolves to, socket:112.213.89.144>. \n4. [CoT]: The text describes that the domain \"hxxp://bongdacongdong.vn/authorization.exe\" was the URL where the \"Authorization.exe\" variant was available, indicating a relationship between the domain and the file.   [Relationships]: <process:hxxp://bongdacongdong.vn/authorization.exe, available from, file:Authorization.exe>. "
    }
]