[
    {
        "title": "executive summary",
        "content": "In the past thirty days (30) an increase attack activity has been observed using the \"njRAT\" malware. This remote access trojan (RAT) has capabilities to log keystrokes, access the victim's camera, steal credentials stored in browsers, open a reverse shell, upload/download files, view the victim's desktop, perform process, file, and registry manipulations, and capabilities to let the attacker update, uninstall, restart, close, disconnect the RAT and rename its campaign ID. Through the Command & Control (CnC) server software, the attacker has capabilities to create and configure the malware to spread through USB drives. \n\"njRAT\" is currently leveraged by advanced threat actors in the Middle East, in particular when delivered via HTTP (i.e. Phishing attack or Drive-by download). It has also been observed that attackers are delivering \"njRAT\" embedded in other applications (i.e. L517 v.0.994 Word List Generator), and compressed with EZIRIZ .NET Reactor/.NET protector. Obfuscation with the use of compressors or protectors is a technique used by attackers to prevent detection by networkbased and host-based security defenses. \nWe have observed the majority of the attacks leveraging \"njRAT\" to be against organizations based in or focused on the Middle East region in the government, telecom, and energy sectors. However as this is a publicly available tool it can be attained and deployed with ease regardless of location or industry. \nDuring the analysis of \"njRAT\", it was observed that some of the top antivirus vendors were not currently detecting some variants of this threat. \nSome of the file names of carrier files or njRAT samples observed were: L517 v0.994.exe, RealUpgrade.exe, password hotmail cracker 2013.exe, elisa.exe, Crack All Games.exe, fresh cccvv all info 2013_txt.scr, spoolsv.exe, Hack Origin Game's.exe, Authorization form may - 2013 - 115444.scr, and Authorization.exe. \nThis document will provide detailed information about the njRAT's functionality, file system indicators, network indicators, some of the campaign IDs observed,  MD5 hashes, and domains. It will also go over a detailed analysis of one of the malware variants. ",
        "phase": "other"
    },
    {
        "title": "threat overview",
        "content": "The \"njRAT\" is a robust remote access trojan that once it reaches and infects the end-point, allows the attacker to have full control over the Victim system. With this access, the attacker can start scanning other systems in the victim network to perform lateral movement. \nWe will start this section by performing analysis on the following \"njRAT\" sample: \nFilename: Authorization.exe MD5: 1d3baedd747f6f9bf92c81eb9f63b34b \nThe \"Authorization.exe\" njRAT malware was embedded and dropped in the victim system by the following file: \"Authorization form may - 2013 - 115444.scr\" (MD5:   \n63781fe1932e612c6c29225d25515111). \nThe next section (Indicators & Mitigation Strategies), will provide information about other variants of the malware obtained. ",
        "phase": "initial access"
    },
    {
        "title": "summary-1",
        "content": "The \"Authorization.exe\" malware sample was created with version V.0.5 of this RAT. The njRAT application was developed with VB.NET (Visual Basic .NET). The \"Authorization.exe\" malware has keylogger functionality. It stores the logged keystrokes in the following file: \"[CWD]\\.tmp\". When the malware is dropped by the \"Authorization form may - 2013 - 115444.scr\" carrier file, the logged keystrokes are stored in: \"C:\\Extracted\\.tmp\". \nThe IP address used by the Command & Control (C2) node appears to be under an IP range owned by: \"Palestinian Internet Services, P. O. BOX 5111 Gaza City, Palestine\". \nVariants of this malware have been observed by the community since at least 2012. The malware appears to be known by the community as: njRAT, MSIL/Bladabindi, and Backdoor.LV. \nWhen the \"Authorization.exe\" malware is executed it: \nCreates a copy of itself in the following locations:   \n%APPDATA%\\msnco.exe   \nC:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe \nTries to open the following file: [CWD]\\ Authorization.exe.config \nEntrenches in the system for persistence in the following registry locations: \nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Ru n\\b6554e5bcfef391ff7a7ffda58092e10   \nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\R un\\b6554e5bcfef391ff7a7ffda58092e10 \nMakes the following modifications to the registry to bypass the Windows Firewall: \nKey: HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Services\\SharedAcc ess\\Parameters\\FirewallPolicy\\StandardProfile\\AuthorizedApplic ations\\List\\[%APPDATA%]\\msnco.exe   \nValue: [%APPDATA%]\\msnco.exe:\\*:Enabled:msnco.exe \nBeacons to the following C2 node over TCP port 1177: \"217.66.231.245\" \nThe attacker tries to make sure the malware will run in the system by making the second copy into the above mentioned directory (C:\\Documents and Settings\\%USERNAME%\\Start Menu\\Programs\\Startup\\b6554e5bcfef391ff7a7ffda58092e10.exe) \nThis causes the malware to execute again when the system is rebooted and re-starts the infection in the system. Once the system is infected again, it will beacon to the C2 node. \nThe attacker tries to trick the user by using different icons for the malware. Various samples were observed with MS Word and PDF icons. The following is a screenshot of how the file will look like to a normal user: \nWhen the system is configured to show file extensions, the EXE extension is now revealed:",
        "phase": "execution"
    },
    {
        "title": "summary-2",
        "content": "When the malware connects to the C2 node, it will send information about the victim system, malware version, open windows, etc. The following is the network traffic observed: \nThe following table provides information of some of the fields observed in the network traffic: \nInformation sent by the attacker on opened windows in the system could inform him/her of his malware being analyzed and allowed to connect to the C2 node. For example, if Wireshark, Filemon, Regmon, and IDA are opened in the system when the analyst executes the malware, this will quickly let the attacker know that someone is performing reverse engineering of his malicious code.\nThe following WHOIS information was found related to the C2 node (21+7.16860.02.3615.22.4405).",
        "phase": "exfiltration"
    },
    {
        "title": "c2",
        "content": "The  \"Authorization.exe\" variant in this report appears to have been available at some point through the following URL: \"hxxp://bongdacongdong.vn/authorization.exe\". The domain currently resolves to the following IP address: \"112.213.89.144\", but at some point, the domain was associated with the following IP address: \"31.170.165.90\". \nThe following information was found at Virustotal for \"31.170.165.90\": ",
        "phase": "command and control"
    }
]